////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.ПринудительныйЗапуск Тогда
		ВызватьИсключение НСтр("ru='Обработка не предназначена для непосредственного использования.'");
	КонецЕсли;
	
	МакетДокумента = Обработки.ЛегальностьПолученияОбновлений.ПолучитьМакет("УсловияРаспространенияОбновлений");
	ТекстПредупреждения = МакетДокумента.ПолучитьТекст();
	ПодтверждениеВыбора = 0;  // пользователю требуется явно выбрать один из вариантов
	Элементы.Примечание.Видимость = Параметры.ПоказыватьПредупреждениеОПерезапуске;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОсновныеДействияФормыПродолжить(Команда)
	
	Закрыть(ПодтверждениеВыбора = 1);
	
КонецПроцедуры

