
&НаКлиенте
Процедура Изменить(Команда)
	
	СуммаДок = Таблица.Итог("Сумма");
	
	Если СуммаСпецификации <> СуммаДок Тогда
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма переделки (" + СуммаДок + ") не совпадает с суммой спецификации (" + СуммаСпецификации + ")");
	Иначе
		УстановитьВиновных();
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Спецификация = Параметры.Спецификация;
	СуммаСпецификации = Спецификация.СуммаДокумента; 
	
	Для Каждого Стр ИЗ Спецификация.СписокВиновных Цикл
		
		НСтр = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр,Стр);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВиновных()
	
	СпецОб = Спецификация.ПолучитьОбъект();
	СпецОб.СписокВиновных.Очистить();
	СпецОб.СписокВиновных.Загрузить(Таблица.Выгрузить());
	
	Если СпецОб.Проведен Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	Иначе
		РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	
	СпецОб.Записать(РежимЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
