
&НаСервере
Функция ОбновитьСчетаИСубконто()
	
	СтруктураСчетов = БухгалтерскийУчетСервер.ПолучитьСчетаПоВидуОперации(Объект.ВидОперации);
	Объект.СчетДт = СтруктураСчетов.СчетДт;
	Объект.СчетКт = СтруктураСчетов.СчетКт;
	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ВыдачаПодотчетномуЛицу Тогда
		
		Объект.Субконто1Дт = Справочники.СтатьиДвиженияДенежныхСредств.ПеремещениеДенежныхСредств;
		Объект.Субконто1Кт = Справочники.СтатьиДвиженияДенежныхСредств.ПеремещениеДенежныхСредств;
		
	КонецЕсли;
	
	ДоступностьЭлементов();
	
КонецФункции

&НаСервере
Функция ДоступностьЭлементов()
	
	ЛексВызовСервера.ОбновитьДоступностьЭлементов(Элементы, Объект.ВидОперации);
	
	ЛексВызовСервера.ЗаполнитьТипыСубконто(Элементы, "Дт", Объект);
	ЛексВызовСервера.ЗаполнитьТипыСубконто(Элементы, "Кт", Объект);
	
КонецФункции

#Область СОБЫТИЯ_ФОРМЫ

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Параметры.Свойство("Остаток") Тогда
		Объект.Сумма = Параметры.Остаток;	
	КонецЕсли;
	
	ДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперацииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ВидОперацииПриИзмененииНаСервере()
	
	ОбновитьСчетаИСубконто();
	
КонецФункции

&НаКлиенте
Процедура СчетДтПриИзменении(Элемент)
	
	СчетДтПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Функция СчетДтПриИзмененииНаСервере()
	
	ЛексВызовСервера.ЗаполнитьТипыСубконто(Элементы, "Дт", Объект);
	
КонецФункции

&НаКлиенте
Процедура СчетКтПриИзменении(Элемент)
	
	СчетКтПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Функция СчетКтПриИзмененииНаСервере()
	
	ЛексВызовСервера.ЗаполнитьТипыСубконто(Элементы, "Кт", Объект);
	
КонецФункции

&НаКлиенте
Процедура Субконто2КтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТипСубконто = ТипЗнч(Объект.Субконто2Кт);
	
	Если ТипСубконто = Тип("СправочникСсылка.Счета")
		ИЛИ ТипСубконто = Тип("СправочникСсылка.Кассы") Тогда
		
		СтандартнаяОбработка = Ложь;
		ЛексКлиент.ВыборСчетаКассы("Субконто2Кт", Объект);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = ЛексКлиент.ПредупредитьОПовторномПроведении(Объект)
	
КонецПроцедуры

#КонецОбласти