
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Спецификация = ПараметрКоманды;
	
	Если НЕ ЗначениеЗаполнено(Спецификация)
		ИЛИ ТипЗнч(Спецификация) <> Тип("ДокументСсылка.Спецификация") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстВопроса = "Материал на спецификацию %1 уже может быть заказан. Проконсультируйтесь с логистом перед отменой размещения. Вы уверены что хотите отменить размещение спецификации?";
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, Спецификация);
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос(ТекстВопроса, Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Если НЕ ОтменитьРазмещениеСпецификации(Спецификация) Тогда
			ОповеститьОбИзменении(Спецификация);
			Оповестить("ИзмененСтатусСпецификации", Спецификация);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Документ.Спецификация.Форма.ФормаДокумента" Тогда
		ПараметрыВыполненияКоманды.Источник.Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтменитьРазмещениеСпецификации(СпецификацияСсылка)
	
	Отказ = Ложь;
	ТекстСообщения = "";
	
	ТекущийСтатус = Документы.Спецификация.ПолучитьСтатусСпецификации(СпецификацияСсылка);
	
	Если ТекущийСтатус <> Перечисления.СтатусыСпецификации.Размещен 
		И ТекущийСтатус <> Перечисления.СтатусыСпецификации.Проверяется
		И ТекущийСтатус <> Перечисления.СтатусыСпецификации.ОжиданиеМатериала 
		И ТекущийСтатус <> Перечисления.СтатусыСпецификации.Рассчитывается Тогда
		
		ТекстСообщения = "Отменить спецификацию можно только со статусом 'Размещен', 'Ожидание материала', 'Рассчитывается' или 'Проверяется'. У %1 статус '%2'";
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СпецификацияСсылка, ТекущийСтатус);
		Отказ = Истина;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		ДокОбъект = СпецификацияСсылка.ПолучитьОбъект();
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		Если НЕ ДокОбъект.Проведен Тогда
			
			Документы.Спецификация.УстановитьСтатусСпецификации(СпецификацияСсылка, Перечисления.СтатусыСпецификации.Сохранен);
			
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, СпецификацияСсылка);
		
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции
