
Функция ПечатьБюджетДДС(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Макет = Документы.БюджетДДС.ПолучитьМакет("ПечатьБюджетДДС");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БюджетДДС.Дата,
	|	БюджетДДС.Номер,
	|	БюджетДДС.Подразделение,
	|	БюджетДДС.СуммаВыплат,
	|	БюджетДДС.СуммаДокумента,
	|	БюджетДДС.СуммаПоступлений,
	|	БюджетДДС.ОбластиРаспеределения.(
	|		НомерСтроки,
	|		Статья,
	|		СуммаВыплаты,
	|		СуммаПоступления,
	|		Описание
	|	),
	|	БюджетДДС.Ссылка
	|ИЗ
	|	Документ.БюджетДДС КАК БюджетДДС
	|ГДЕ
	|	БюджетДДС.Ссылка В(&МассивОбъектов)";
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьОбластиРаспеределенияШапка = Макет.ПолучитьОбласть("ОбластиРаспеределенияШапка");
	ОбластьОбластиРаспеределения = Макет.ПолучитьОбласть("ОбластиРаспеределения");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьОбластиРаспеределенияШапка);
		ВыборкаОбластиРаспеределения = Выборка.ОбластиРаспеределения.Выбрать();
		Пока ВыборкаОбластиРаспеределения.Следующий() Цикл
			ОбластьОбластиРаспеределения.Параметры.Заполнить(ВыборкаОбластиРаспеределения);
			ТабДок.Вывести(ОбластьОбластиРаспеределения, ВыборкаОбластиРаспеределения.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПодготовитьПечатнуюФорму("ПечатьБюджетДДС", "Бюджет ДДС", "Документ.БюджетДДС.ПечатьБюджетДДС",
	МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	ТабДок = ПечатьБюджетДДС(МассивОбъектов, ОбъектыПечати); 
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, 
	ПредставлениеМакета, ТабДок, , ПолныйПутьКМакету);
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры
