Функция ПолучитьСписокМакетовОформления() Экспорт
	
	СписокМакетовОформления = Новый СписокЗначений;
	Для Каждого ОбщийМакет Из Метаданные.ОбщиеМакеты Цикл
		Если ОбщийМакет.ТипМакета = Метаданные.СвойстваОбъектов.ТипМакета.МакетОформленияКомпоновкиДанных Тогда
			СписокМакетовОформления.Добавить(ОбщийМакет.Имя, ОбщийМакет.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	СписокМакетовОформления.Добавить("Основной");
	СписокМакетовОформления.Добавить("Яркий");
	СписокМакетовОформления.Добавить("Море");
	СписокМакетовОформления.Добавить("Арктика");
	СписокМакетовОформления.Добавить("Зеленый");
	СписокМакетовОформления.Добавить("Античный");
	
	Возврат СписокМакетовОформления;
	
КонецФункции

Функция ПолучитьТекстОбособленныхПодразделений(Организация) Экспорт
	
	ТекстОрганизации = "";
	
	Возврат ТекстОрганизации;
	
КонецФункции

Функция ПолучитьТекстОрганизация(Организация = Неопределено, ВключатьОбособленныеПодразделения = Ложь) Экспорт
	
	ТекстОрганизации = "";
	
	Возврат ТекстОрганизации;
	
КонецФункции

Функция ДоступностьУчетаПоПодразделениям() Экспорт
	
	Возврат Истина;
	
КонецФункции