
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Спецификация = Параметры.Спецификация;
	Подразделение = Спецификация.Подразделение;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Подразделение", Подразделение);
	ПараметрыФормы.Вставить("ПовторнаяПроверка", Истина);
	
	ОткрытьФорму("Документ.Спецификация.Форма.ФормаДетали", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ЗагрузитьТабличнуюЧасть(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТабличнуюЧасть(АдресТаблицы)
		
	ТаблицаПроверки = ПолучитьИзВременногоХранилища(АдресТаблицы);
	ТаблицаСпецификации = Спецификация.СписокМатериалы.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПроверки", ТаблицаПроверки);
	Запрос.УстановитьПараметр("ТаблицаСпецификации", ТаблицаСпецификации);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПроверки.Материал,
	|	ТаблицаПроверки.ВыборМебельнойКромкиСправа,
	|	ТаблицаПроверки.ВыборМебельнойКромкиСнизу,
	|	ТаблицаПроверки.ВыборМебельнойКромкиСлева,
	|	ТаблицаПроверки.ВыборМебельнойКромкиСверху,
	|	ТаблицаПроверки.ВысотаДетали,
	|	ТаблицаПроверки.ШиринаДетали,
	|	ТаблицаПроверки.Количество,
	|	ТаблицаПроверки.Номенклатура
	|ПОМЕСТИТЬ ВТ_ТаблицаПроверки
	|ИЗ
	|	&ТаблицаПроверки КАК ТаблицаПроверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСпецификации.Материал КАК МатериалСпецификации,
	|	ТаблицаСпецификации.ВыборМебельнойКромкиСправа КАК ВыборМебельнойКромкиСправаСпецификации,
	|	ТаблицаСпецификации.ВыборМебельнойКромкиСнизу КАК ВыборМебельнойКромкиСнизуСпецификации,
	|	ТаблицаСпецификации.ВыборМебельнойКромкиСлева КАК ВыборМебельнойКромкиСлеваСпецификации,
	|	ТаблицаСпецификации.ВыборМебельнойКромкиСверху КАК ВыборМебельнойКромкиСверхуСпецификации,
	|	ТаблицаСпецификации.ВысотаДетали КАК ВысотаДеталиСпецификации,
	|	ТаблицаСпецификации.ШиринаДетали КАК ШиринаДеталиСпецификации,
	|	ТаблицаСпецификации.Количество КАК КоличествоСпецификации,
	|	ТаблицаСпецификации.Номенклатура КАК НоменклатураСпецификации
	|ПОМЕСТИТЬ ВТ_ТаблицаСпецификации
	|ИЗ
	|	&ТаблицаСпецификации КАК ТаблицаСпецификации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПроверки.Материал,
	|	ВТ_ТаблицаПроверки.ВыборМебельнойКромкиСправа,
	|	ВТ_ТаблицаПроверки.ВыборМебельнойКромкиСнизу,
	|	ВТ_ТаблицаПроверки.ВыборМебельнойКромкиСлева,
	|	ВТ_ТаблицаПроверки.ВыборМебельнойКромкиСверху,
	|	ВТ_ТаблицаПроверки.ВысотаДетали,
	|	ВТ_ТаблицаПроверки.ШиринаДетали,
	|	ВТ_ТаблицаПроверки.Количество,
	|	ВТ_ТаблицаПроверки.Номенклатура,
	|	ВТ_ТаблицаСпецификации.МатериалСпецификации,
	|	ВТ_ТаблицаСпецификации.ВыборМебельнойКромкиСправаСпецификации,
	|	ВТ_ТаблицаСпецификации.ВыборМебельнойКромкиСнизуСпецификации,
	|	ВТ_ТаблицаСпецификации.ВыборМебельнойКромкиСлеваСпецификации,
	|	ВТ_ТаблицаСпецификации.ВыборМебельнойКромкиСверхуСпецификации,
	|	ВТ_ТаблицаСпецификации.ВысотаДеталиСпецификации,
	|	ВТ_ТаблицаСпецификации.ШиринаДеталиСпецификации,
	|	ВТ_ТаблицаСпецификации.КоличествоСпецификации,
	|	ВТ_ТаблицаСпецификации.НоменклатураСпецификации
	|ИЗ
	|	ВТ_ТаблицаПроверки КАК ВТ_ТаблицаПроверки
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ТаблицаСпецификации КАК ВТ_ТаблицаСпецификации
	|		ПО (ВТ_ТаблицаПроверки.Материал = ВТ_ТаблицаСпецификации.МатериалСпецификации
	|				И ВТ_ТаблицаПроверки.ВысотаДетали = ВТ_ТаблицаСпецификации.ВысотаДеталиСпецификации
	|				И ВТ_ТаблицаПроверки.ШиринаДетали = ВТ_ТаблицаСпецификации.ШиринаДеталиСпецификации
	|				И ВТ_ТаблицаПроверки.Количество = ВТ_ТаблицаСпецификации.КоличествоСпецификации
	|				И ВТ_ТаблицаПроверки.Номенклатура = ВТ_ТаблицаСпецификации.НоменклатураСпецификации)";
		
	ТаблицаДеталей.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДетали(Команда)
	
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Подразделение", Подразделение);
	//ПараметрыФормы.Вставить("ПовторнаяПроверка", Истина);
	//ПараметрыФормы.Вставить("АдресТаблицы", ПоместитьВоВременноеХранилище(ТаблицаДеталей));
	//
	//ОткрытьФорму("Документ.Спецификация.Форма.ФормаДетали", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры
