
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Дата = НачалоЧаса(Дата);
	
	ЧасДаты = Час(Дата);
	Если ЧасДаты < 9 ИЛИ ЧасДаты > 18 Тогда
		Текст = "Время должно находится в интервале от 09:00 до 18:00";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, "Дата");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	Дата = НачалоЧаса(ТекущаяДата());
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоЧаса(ТекущаяДата());
	
КонецПроцедуры
