
Функция ПолучитьСтруктуруСоответствий(Номенклатура, Подразделение) Экспорт
	
	СтруктураСоответствий = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеНоменклатуры.НоменклатурнаяГруппа,
	|	НоменклатураПодразделений.Номенклатура
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатуры КАК СоответствиеНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПодразделений КАК НоменклатураПодразделений
	|		ПО СоответствиеНоменклатуры.ПодставляемаяНоменклатура = НоменклатураПодразделений.Номенклатура
	|ГДЕ
	|	СоответствиеНоменклатуры.Номенклатура = &Номенклатура
	|	И СоответствиеНоменклатуры.Подразделение = &Подразделение
	|	И НоменклатураПодразделений.Доступность
	|	И НоменклатураПодразделений.Подразделение = &Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатурныеГруппы.Ссылка КАК НоменклатурнаяГруппа,
	|	ЕСТЬNULL(втНоменклатура.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНоменклатура КАК втНоменклатура
	|		ПО (втНоменклатура.НоменклатурнаяГруппа = НоменклатурныеГруппы.Ссылка)
	|ГДЕ
	|	НЕ НоменклатурныеГруппы.ПометкаУдаления
	|	И НоменклатурныеГруппы.Предопределенный";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Имя = Справочники.НоменклатурныеГруппы.ПолучитьИмяПредопределенного(Выборка.НоменклатурнаяГруппа);
		СтруктураСоответствий.Вставить(Имя, Выборка.Номенклатура);
		
	КонецЦикла;
	
	Возврат СтруктураСоответствий;
	
КонецФункции // ПолучитьКромкуПоЦвету()

Функция ПолучитьСоответствие(Номенклатура, НоменклатурнаяГруппа, Подразделение) Экспорт
	
	СтруктураСоответствий = ПолучитьСтруктуруСоответствий(Номенклатура, Подразделение);
	Имя = Справочники.НоменклатурныеГруппы.ПолучитьИмяПредопределенного(НоменклатурнаяГруппа);
	
	Возврат СтруктураСоответствий[Имя];
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	СоответствиеНоменклатуры.НоменклатурнаяГруппа,
	//|	НоменклатураПодразделений.Номенклатура
	//|ИЗ
	//|	РегистрСведений.СоответствиеНоменклатуры КАК СоответствиеНоменклатуры
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПодразделений КАК НоменклатураПодразделений
	//|		ПО СоответствиеНоменклатуры.ПодставляемаяНоменклатура = НоменклатураПодразделений.Номенклатура
	//|ГДЕ
	//|	СоответствиеНоменклатуры.Номенклатура = &Номенклатура
	//|	И СоответствиеНоменклатуры.НоменклатурнаяГруппа = &Группа
	//|	И НоменклатураПодразделений.Доступность
	//|	И НоменклатураПодразделений.Подразделение = &Подразделение";
	//
	//Запрос.УстановитьПараметр("Номенклатура", ЛДСП);
	//Запрос.УстановитьПараметр("Группа", Группа);
	//Запрос.УстановитьПараметр("Подразделение", Подразделение);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если РезультатЗапроса.Пустой() Тогда
	//	
	//	Возврат Справочники.Номенклатура.ПустаяСсылка();
	//	
	//КонецЕсли;
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//ВыборкаДетальныеЗаписи.Следующий();
	//
	//Возврат ВыборкаДетальныеЗаписи.Номенклатура;
	
КонецФункции // ПолучитьКромкуПоЦвету()
