
Функция ПолучитьСтруктуруСоответствий(ЛДСП, Подразделение) Экспорт
	
	СтруктураПодставляяемойНоменклатуры = Новый Структура();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеНоменклатуры.НоменклатурнаяГруппа,
	|	НоменклатураПодразделений.Номенклатура
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатуры КАК СоответствиеНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПодразделений КАК НоменклатураПодразделений
	|		ПО СоответствиеНоменклатуры.ПодставляемаяНоменклатура = НоменклатураПодразделений.Номенклатура
	|ГДЕ
	|	СоответствиеНоменклатуры.Номенклатура = &Номенклатура
	|	И НоменклатураПодразделений.Доступность
	|	И НоменклатураПодразделений.Подразделение = &Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатурныеГруппы.Ссылка КАК НоменклатурнаяГруппа,
	|	втНоменклатура.Номенклатура
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНоменклатура КАК втНоменклатура
	|		ПО (втНоменклатура.НоменклатурнаяГруппа = НоменклатурныеГруппы.Ссылка)
	|ГДЕ
	|	НЕ НоменклатурныеГруппы.ПометкаУдаления
	|	И НоменклатурныеГруппы.Предопределенный";
	
	Запрос.УстановитьПараметр("Номенклатура", ЛДСП);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Имя = Справочники.НоменклатурныеГруппы.ПолучитьИмяПредопределенного(ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа);
		Номенклатура = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Номенклатура), ВыборкаДетальныеЗаписи.Номенклатура, Справочники.Номенклатура.ПустаяСсылка());
		СтруктураПодставляяемойНоменклатуры.Вставить(Имя, Номенклатура);
		
	КонецЦикла;
	
	Возврат СтруктураПодставляяемойНоменклатуры;
	
КонецФункции // ПолучитьКромкуПоЦвету()

Функция ПолучитьСоответствие(ЛДСП, Группа, Подразделение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеНоменклатуры.НоменклатурнаяГруппа,
	|	НоменклатураПодразделений.Номенклатура
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатуры КАК СоответствиеНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПодразделений КАК НоменклатураПодразделений
	|		ПО СоответствиеНоменклатуры.ПодставляемаяНоменклатура = НоменклатураПодразделений.Номенклатура
	|ГДЕ
	|	СоответствиеНоменклатуры.Номенклатура = &Номенклатура
	|	И СоответствиеНоменклатуры.НоменклатурнаяГруппа = &Группа
	|	И НоменклатураПодразделений.Доступность
	|	И НоменклатураПодразделений.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Номенклатура", ЛДСП);
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Справочники.Номенклатура.ПустаяСсылка();
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Номенклатура;
	
КонецФункции // ПолучитьКромкуПоЦвету()
