
&НаКлиенте
Функция ДобавитьЦифру(Цифра)

	ВведеннаяСтрока = ВведеннаяСтрока + Цифра;

КонецФункции // ДобавитьЦифру()

&НаКлиенте
Процедура Цифра0(Команда)
    
    ДобавитьЦифру("0");

КонецПроцедуры

&НаКлиенте
Процедура Цифра1(Команда)

    ДобавитьЦифру("1");
    
КонецПроцедуры

&НаКлиенте
Процедура Цифра2(Команда)
    
    ДобавитьЦифру("2");
    
КонецПроцедуры

&НаКлиенте
Процедура Цифра3(Команда)
    
    ДобавитьЦифру("3");
    
КонецПроцедуры

&НаКлиенте
Процедура Цифра4(Команда)
    
    ДобавитьЦифру("4");
    
КонецПроцедуры

&НаКлиенте
Процедура Цифра5(Команда)
    
    ДобавитьЦифру("5");
    
КонецПроцедуры

&НаКлиенте
Процедура Цифра6(Команда)
    
    ДобавитьЦифру("6");
    
КонецПроцедуры

&НаКлиенте
Процедура Цифра7(Команда)
    
    ДобавитьЦифру("7");
    
КонецПроцедуры

&НаКлиенте
Процедура Цифра8(Команда)
    
    ДобавитьЦифру("8");

КонецПроцедуры

&НаКлиенте
Процедура Цифра9(Команда)
    
    ДобавитьЦифру("9");

КонецПроцедуры

&НаКлиенте
Процедура КнопкаС(Команда)

    ВведеннаяСтрока = "";

КонецПроцедуры

&НаКлиенте
Процедура КнопкаОК(Команда)
    
    Закрыть(ВведеннаяСтрока);    

КонецПроцедуры
