
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьИнвентаризацияОС(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать("Инвентаризация основных средств");
	
КонецПроцедуры

&НаСервере
Процедура ПечатьИнвентаризацияОС(ТабДок, ПараметрКоманды)
	Документы.ИнвентаризацияОсновныхСредств.ПечатьИнвентаризацияОС(ТабДок, ПараметрКоманды);
КонецПроцедуры
