
&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	РассчитатьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	
	РассчитатьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСумму()
	
	Стр = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)
	
	Стр = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Если Стр.Количество <> 0 Тогда
		Стр.Цена = Стр.Сумма / Стр.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазрещеноИзменятьЦену = ПроверитьПользователя();
	ЭтаФорма.Элементы.СписокНоменклатурыЦена.ТолькоПросмотр = НЕ РазрещеноИзменятьЦену;
	ЭтаФорма.Элементы.СписокНоменклатурыСумма.ТолькоПросмотр = НЕ РазрещеноИзменятьЦену;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПользователя()

	Ответ = Ложь;
	
	СписокПравРазрешеноИзменятьЦену = Новый СписокЗначений;
	СписокПравРазрешеноИзменятьЦену.Добавить(Метаданные.Роли.АдминистраторСистемы);
	СписокПравРазрешеноИзменятьЦену.Добавить(Метаданные.Роли.Администрирование);
	//СписокПравРазрешеноИзменятьЦену.Добавить(Метаданные.Роли.ГлавныйБухгалтер);
	
	Для каждого ы Из СписокПравРазрешеноИзменятьЦену Цикл
		Ответ = Ответ ИЛИ РольДоступна(ы.Значение);
	КонецЦикла;
	
	Возврат Ответ;

КонецФункции // ПроверитьПользователя()

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ЗаполнитьСкидки();

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЕдиницаХраненияПриИзменении(Элемент)
	
	ТД = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТД.Коэффициент = ЛексСервер.ЗначениеРеквизитаОбъекта(ТД.ЕдиницаХранения, "Коэффициент") ;
	ЗаполнитьЦену(ТД);
	РассчитатьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ЗаполнитьЦену(Элементы.СписокНоменклатуры.ТекущиеДанные);
	РассчитатьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦену(ТекущиеДанные)
	
	Парам = Новый Структура;
	Парам.Вставить("Подразделение", Объект.Подразделение);
	Парам.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
	Парам.Вставить("Коэффициент", ТекущиеДанные.Коэффициент);
	Парам.Вставить("Дата", Объект.Дата);
	
	ТекущиеДанные.Цена = ПолучитьЦенуНоменклатуры(Парам);
	РассчитатьСумму();
	
КонецПроцедуры // ЗаполнитьЦену()

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатуры(Парам)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Парам.Дата);
	Запрос.УстановитьПараметр("Регион", Парам.Подразделение.Регион);
	Запрос.УстановитьПараметр("Номенклатура", Парам.Номенклатура);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Розничная
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Дата,
	|			Номенклатура = &Номенклатура
	|				И Регион = &Регион) КАК ЦеныНоменклатурыСрезПоследних";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Ответ = 0;
		
	Иначе
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Ответ = Выборка.Розничная * Парам.Коэффициент;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции // ПолучитьЦенуНоменклатуры()

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЗаполнитьСкидки();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСкидки()
	
	//Если ЗначениеЗаполнено(Объект.Подразделение) и ЗначениеЗаполнено(Объект.Контрагент) Тогда
	//	
	//	Скидки 									= ЛексСервер.ПолучитьСкидкуКонтрагента(Объект.Подразделение, Объект.Дата, Объект.Контрагент);
	//	Объект.СкидкаНаМатериалы 	= Скидки.СкидкаНаМатериалы;
	//	Объект.СкидкаНаУслуги = Скидки.СкидкаНаУслуги;
	//	
	//	// перезаполнить строки табличной части с учетом скидки
	//	Для каждого Строка Из Объект.СписокНоменклатуры Цикл
	//		
	//		Парам = Новый Структура;
	//		Парам.Вставить("Подразделение", Объект.Подразделение);
	//		Парам.Вставить("Номенклатура", Строка.Номенклатура);
	//		Парам.Вставить("Коэффициент", Строка.Коэффициент);
	//		Парам.Вставить("Дата", Объект.Дата);
	//		ЦенаНоменклатуры = ПолучитьЦенуНоменклатуры(Парам);
	//		
	//		Если Строка.Номенклатура.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Материал Тогда
	//			Скидка = Объект.СкидкаНаМатериалы;
	//		ИначеЕсли Строка.Номенклатура.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Услуга Тогда
	//			Скидка = Объект.СкидкаНаУслуги;
	//		КонецЕсли;
	//		
	//		Строка.Цена = ЦенаНоменклатуры - ЦенаНоменклатуры * Скидка / 100; 
	//		Строка.Сумма = Строка.Количество * Строка.Цена;
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗаполнитьСкидки();
	
КонецПроцедуры


