
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
 
 ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
 
КонецПроцедуры

Процедура ПечатьДопСоглашение(ТабДок, Ссылка) Экспорт
	
	// будем печатать только первый документ
	// нет времени сейчас заморачиваться с 
	// групповой печатью
	
	ДокументСсылка = Ссылка[0];
	
	Макет = Документы.ДополнительноеСоглашение.ПолучитьМакет("Соглашение");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительноеСоглашение.Дата КАК ДатаДокумента,
	|	ДополнительноеСоглашение.Офис,
	|	ДополнительноеСоглашение.СуммаДокумента,
	|	ДополнительноеСоглашение.Договор.Номер КАК НомерДоговора,
	|	ДополнительноеСоглашение.Договор.Дата КАК ДатаДоговора,
	|	ДополнительноеСоглашение.Договор.Контрагент КАК Контрагент,
	|	ДополнительноеСоглашение.Договор.Организация КАК Организация
	|ИЗ
	|	Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	|ГДЕ
	|	ДополнительноеСоглашение.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьТело = Макет.ПолучитьОбласть("Тело");
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
//	ОбластьТело.Параметры.Заполнить(ЛексСервер.ПолучитьРеквизитыКлиента(Выборка.Контрагент));
	ОбластьТело.Параметры.Заполнить(ЛексСервер.ПолучитьРеквизитыОрганизации(Выборка.Организация));
	ОбластьТело.Параметры.Заполнить(Выборка);
	
	Если Выборка.Контрагент.ЮридическоеЛицо Тогда
		НаименованиеПокупателя = Выборка.Контрагент.ПолноеНаименование;
	Иначе
		НаименованиеПокупателя = Выборка.Контрагент.Наименование;
	КонецЕсли;
	
	ОбластьТело.Параметры.НаименованиеПокупателя = НаименованиеПокупателя;
	ОбластьТело.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=DD");
	ОбластьТело.Параметры.ДатаДокумента = Формат(Выборка.ДатаДокумента, "ДЛФ=DD");
	
	ТабДок.Вывести(ОбластьТело);
	
	
КонецПроцедуры

Функция ПолучитьСуммуПлатежа(ДопСоглашениеСсылка) Экспорт
	
	// { Васильев Александр Леонидович [06.09.2013]
	// Лёха, вынеси в общий модуль. И в договоре тоже используй эту функцию
	// } Васильев Александр Леонидович [06.09.2013]
	
	Ответ = 0;
	
	СвойстваДоговора = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ДопСоглашениеСсылка.Договор, "Контрагент, Подразделение");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДопСоглашение", ДопСоглашениеСсылка);
	Запрос.УстановитьПараметр("Контрагент", СвойстваДоговора.Контрагент);
	Запрос.УстановитьПараметр("Подразделение", СвойстваДоговора.Подразделение);
	Запрос.УстановитьПараметр("Период", КонецДня(ДопСоглашениеСсылка.Дата));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческийОстатки.СуммаОстатокКт,
	|	УправленческийОстатки.Субконто1,
	|	УправленческийОстатки.Субконто2,
	|	УправленческийОстатки.Подразделение
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Остатки(
	|			&Период,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ВзаиморасчетыСПокупателями),
	|			,
	|			Подразделение = &Подразделение
	|				И Субконто1 = &Контрагент
	|				И Субконто2 = &ДопСоглашение) КАК УправленческийОстатки";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Ответ = Выборка.СуммаОстатокКт;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции 