
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Функция ПечатьДопСоглашение(Выборка, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_Соглашение";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Макет = Документы.ДополнительноеСоглашение.ПолучитьМакет("Соглашение");
	МакетРеквизитов = ПолучитьОбщийМакет("ШапкаДоговораРеквизиты");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьДопСоглашение = Макет.ПолучитьОбласть("ДопСоглашение");
	ОбластьШапкаДоговора = МакетРеквизитов.ПолучитьОбласть("ШапкаДоговора");
	
	Пока Выборка.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьЗаголовок.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=DD");
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Документы.Договор.ВывестиОбластьШапкаДоговора(ТабДок, Выборка.ДоговорСсылка);
		
		ОбластьДопСоглашение.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьДопСоглашение);
		
		Документы.Договор.ВывестиОбластьРеквизитыДоговора(ТабДок, Выборка.ДоговорСсылка);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьСуммыПлатежей(ДопСоглашениеСсылка) Экспорт
	
	// { Васильев Александр Леонидович [06.09.2013]
	// Лёха, вынеси в общий модуль. И в договоре тоже используй эту функцию
	// } Васильев Александр Леонидович [06.09.2013]
	
	Ответ = Новый Структура("ОборотДт, ОборотКт", 0,0);
	
	СвойстваДоговора = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ДопСоглашениеСсылка.Договор, "Контрагент, Подразделение");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДопСоглашение", ДопСоглашениеСсылка);
	Запрос.УстановитьПараметр("Контрагент", СвойстваДоговора.Контрагент);
	Запрос.УстановитьПараметр("Подразделение", СвойстваДоговора.Подразделение);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(УправленческийОбороты.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|	ВЫРАЗИТЬ(УправленческийОбороты.Субконто2 КАК Документ.ДополнительноеСоглашение) КАК ДопСоглашение,
	|	УправленческийОбороты.Подразделение,
	|	УправленческийОбороты.СуммаОборотДт,
	|	УправленческийОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Обороты(
	|			,
	|			,
	|			,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ВзаиморасчетыСПокупателями),
	|			,
	|			Подразделение = &Подразделение
	|				И (ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты)) = &Контрагент
	|				И (ВЫРАЗИТЬ(Субконто2 КАК Документ.ДополнительноеСоглашение)) = &ДопСоглашение,
	|			,
	|			) КАК УправленческийОбороты";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Ответ.ОборотДт = Выборка.СуммаОборотДт;
		Ответ.ОборотКт = Выборка.СуммаОборотКт;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Выборка = Запрос(МассивОбъектов);
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Соглашение") Тогда
		
		ПодготовитьПечатнуюФорму("Соглашение", "Соглашение", "Документ.ДополнительноеСоглашение.Соглашение",
		МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, Выборка);
		
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, Выборка)
	
	Если ИмяМакета = "Соглашение" Тогда
		
		ТабДок = ПечатьДопСоглашение(Выборка, ОбъектыПечати);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, 
		ПредставлениеМакета, ТабДок, , ПолныйПутьКМакету);
		
	КонецЕсли;
	
КонецПроцедуры

Функция Запрос(МассивОбъектов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДополнительноеСоглашение.Дата КАК ДатаДокумента,
	|	ДополнительноеСоглашение.Офис,
	|	ДополнительноеСоглашение.СуммаДокумента КАК Сумма,
	|	ДополнительноеСоглашение.Договор КАК ДоговорСсылка,
	|	ДополнительноеСоглашение.Договор.Номер КАК НомерДоговора,
	|	ДополнительноеСоглашение.Договор.Дата КАК ДатаДоговора,
	|	ДополнительноеСоглашение.Договор.Контрагент КАК Контрагент,
	|	ДополнительноеСоглашение.Договор.Организация КАК Организация,
	|	ДополнительноеСоглашение.Договор.Контрагент.ЮридическоеЛицо КАК ЮрЛицо,
	|	ДополнительноеСоглашение.Договор.Подразделение КАК Подразделение,
	|	ДополнительноеСоглашение.Офис.Город КАК ГородОфиса,
	|	ДополнительноеСоглашение.Офис.Телефон КАК ТелефонОфиса,
	|	ДополнительноеСоглашение.Офис.Адрес КАК АдресОФиса,
	|	ДополнительноеСоглашение.Ссылка,
	|	ВЫБОР
	|		КОГДА ДополнительноеСоглашение.Договор.Контрагент.ЮридическоеЛицо
	|			ТОГДА ДополнительноеСоглашение.Договор.Контрагент.Наименование
	|		ИНАЧЕ ПОДСТРОКА(ДополнительноеСоглашение.Договор.Контрагент.Фамилия, 1, 20) + "" "" + ПОДСТРОКА(ДополнительноеСоглашение.Договор.Контрагент.Имя, 1, 20) + "" "" + ПОДСТРОКА(ДополнительноеСоглашение.Договор.Контрагент.Отчество, 1, 20)
	|	КОНЕЦ КАК ФИОКлиента,
	|	ДополнительноеСоглашение.Автор.ФизическоеЛицо.ВЛице КАК АвторРодительныйПадеж,
	|	ДополнительноеСоглашение.Автор.ФизическоеЛицо КАК Автор,
	|	ДополнительноеСоглашение.Комментарий,
	|	ДополнительноеСоглашение.Договор.Контрагент.ИНН КАК КлиентИНН,
	|	ДополнительноеСоглашение.Договор.Контрагент.КПП КАК КлиентКПП,
	|	ДополнительноеСоглашение.Договор.Контрагент.ОГРН КАК КлиентОГРН,
	|	ДополнительноеСоглашение.Договор.Контрагент.ЮридическийАдрес КАК КлиентЮридическийАдрес,
	|	ДополнительноеСоглашение.Договор.Контрагент.Руководитель КАК КонтрагентРуководитель,
	|	ДополнительноеСоглашение.Договор.Контрагент.ДействуетНаОсновании КАК КонтрагентДействуетНаОсновании,
	|	ДополнительноеСоглашение.Договор.Контрагент.ПаспортСерия КАК СерияПаспорта,
	|	ДополнительноеСоглашение.Договор.Контрагент.ПаспортНомер КАК НомерПаспорта,
	|	ДополнительноеСоглашение.Договор.Контрагент.ПаспортДатаВыдачи КАК ДатаВыдачиПаспорта,
	|	ДополнительноеСоглашение.Договор.Контрагент.ПаспортКемВыдан КАК КемВыдан,
	|	ДополнительноеСоглашение.Договор.Контрагент.Телефон КАК ТелефонСотовый,
	|	ДополнительноеСоглашение.Договор.Контрагент.ТелефонДополнительный КАК ТелефонКонтактный,
	|	ДополнительноеСоглашение.Договор.Контрагент.БанковскиеРеквизиты КАК БанковскиеРеквизиты,
	|	ДополнительноеСоглашение.Договор.Контрагент.Наименование КАК НаименованиеЮрЛица
	|ИЗ
	|	Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	|ГДЕ
	|	ДополнительноеСоглашение.Ссылка В(&МассивСсылок)
	|	И ДополнительноеСоглашение.Проведен";
	
	Запрос.Параметры.Вставить("МассивСсылок", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции // Запрос()
