
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если СуммаДокумента > 0 И Документы.ДополнительноеСоглашение.ПолучитьСуммуПлатежа(Ссылка) < СуммаДокумента Тогда
		
		Текст = "Примите полную предоплату (" + СуммаДокумента + " руб.)";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, "СуммаДокумента");
		Отказ = Истина;
		
	КонецЕсли;
	
	ЛексСервер.СформироватьПоказателиСотрудников(Движения, Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Договор") Тогда
		Офис = ДанныеЗаполнения.Офис;
		Договор = ДанныеЗаполнения.Ссылка;
		//ВидИзменения = Перечисления.ВидИзмененийСтоимостиДоговора.Увеличить;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Отказ = НЕ ПроверитьЗаполнение();
	//РасторжениеДоговора = ВидИзменения = Перечисления.ВидИзмененийСтоимостиДоговора.Уменьшить 
	//И ЛексСервер.ПолучитьСтоимостьДоговора(Договор) * 0.9 < Сумма;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//МассивРолей = Новый Массив;
	//МассивРолей.Добавить("Администратор");
	//МассивРолей.Добавить("ГлавныйБухгалтер");
	//МассивРолей.Добавить("Бухгалтер");
	//
	//Если НЕ ЛексСервер.РольДоступнаВызовСервера(МассивРолей) Тогда
	//
	//	ДатаМонтажа = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Договор, "ДатаУстановки");
	//	Если Дата > КонецДня(ДатаМонтажа) Тогда
	//		
	//		Отказ = Истина;
	//		
	//		ТекстСообщения = "Запрщено вводить дополнительное соглашение после даты монтажа"
	//		+ Символы.ПС + "Дата  монтажа: " + Формат(ДатаМонтажа, "ДЛФ=DD")
	//		+ Символы.ПС + "Дата соглашения: " + Формат(Дата, "ДЛФ=DD");
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Дата");
	//		
	//	КонецЕсли;
	//
	//КонецЕсли;

КонецПроцедуры
