
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Обороты = Документы.ДополнительноеСоглашение.ПолучитьСуммыПлатежей(Ссылка);
	
	Если СуммаДокумента > 0 И Обороты.ОборотКт <> СуммаДокумента Тогда
		Текст = "Примите полную предоплату " + СуммаДокумента + " руб.";
		//ИначеЕсли СуммаДокумента < 0 И Обороты.ОборотДт <> -СуммаДокумента Тогда
		//	Текст = "Проведите клиенту возврат на сумму " + -СуммаДокумента + " руб.";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Текст) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, "СуммаДокумента");
		Отказ = Истина;
	КонецЕсли;
	
	ЛексСервер.СформироватьПоказателиСотрудников(Движения, Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Договор") Тогда
		Офис = ДанныеЗаполнения.Офис;
		Договор = ДанныеЗаполнения.Ссылка;
		Подразделение = ДанныеЗаполнения.Подразделение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Подразделение = Договор.Подразделение;
	КонецЕсли;
	
	Акт = Документы.Договор.ПолучитьАктВыполнения(Договор);
	
	Если ЗначениеЗаполнено(Акт) И Акт.Дата < Дата Тогда
		
		ТекстСообщения = "Запрещено вводить дополнительное соглашение к выполненному договору.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДвиженияПродажиФакт()
	
	Спецификация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Спецификация");
	Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спецификация, "Контрагент");
	
	Проводка = Движения.ПродажиФакт.Добавить();
	
	Проводка.Период = Дата;
	Проводка.Подразделение = Подразделение;
	Проводка.ВидПродажи = Перечисления.ВидыПродаж.Договоры;
	Проводка.Сотрудник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Автор, "ФизическоеЛицо");
	Проводка.Контрагент = Контрагент;
	Проводка.Офис = Офис;
	Проводка.Сумма = СуммаДокумента;
	Проводка.Количество = 1;
	
КонецФункции