
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Обороты = Документы.ДополнительноеСоглашение.ПолучитьСуммыПлатежей(Ссылка);
	
	Если СуммаДокумента > 0 И Обороты.ОборотКт <> СуммаДокумента Тогда
		Текст = "Примите полную предоплату " + СуммаДокумента + " руб.";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Текст) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, "СуммаДокумента");
		Отказ = Истина;
	КонецЕсли;
	
	Если РасторжениеДоговора Тогда
		УбратьПродажиПоДоговору();
	Иначе
		ЛексСервер.СформироватьПоказателиСотрудников(Движения, Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура УбратьПродажиПоДоговору()
	
	Если ЗначениеЗаполнено(Договор) И Договор.Проведен Тогда
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Регистратор", Договор); 
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажиФактОбороты.Подразделение,
		|	ПродажиФактОбороты.ВидПродажи,
		|	ПродажиФактОбороты.Сотрудник,
		|	ПродажиФактОбороты.Контрагент,
		|	ПродажиФактОбороты.Офис,
		|	ПродажиФактОбороты.КоличествоОборот,
		|	ПродажиФактОбороты.СуммаОборот
		|ИЗ
		|	РегистрНакопления.ПродажиФакт.Обороты(, , Регистратор, ) КАК ПродажиФактОбороты
		|ГДЕ
		|	ПродажиФактОбороты.Регистратор = &Регистратор";
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Проводка = Движения.ПродажиФакт.Добавить();
		
				Проводка.Период = Дата;
				Проводка.Подразделение = Выборка.Подразделение;
				Проводка.ВидПродажи = Выборка.ВидПродажи;
				Проводка.Сотрудник = Выборка.Сотрудник;
				Проводка.Контрагент = Выборка.Контрагент;
				Проводка.Офис = Выборка.Офис;
				Проводка.Сумма = -Выборка.СуммаОборот + СуммаДокумента;
				Проводка.Количество = -Выборка.КоличествоОборот;
	
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Договор") Тогда
		Офис = ДанныеЗаполнения.Офис;
		Договор = ДанныеЗаполнения.Ссылка;
		Подразделение = ДанныеЗаполнения.Подразделение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Подразделение = Договор.Подразделение;
	КонецЕсли;
	
	Акт = Документы.Договор.ПолучитьАктВыполнения(Договор);
	
	Если ЗначениеЗаполнено(Акт) И Акт.Дата < Дата Тогда
		
		ТекстСообщения = "Запрещено вводить дополнительное соглашение к выполненному договору.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДвиженияПродажиФакт()
	
	Спецификация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Спецификация");
	Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спецификация, "Контрагент");
	
	Проводка = Движения.ПродажиФакт.Добавить();
	
	Проводка.Период = Дата;
	Проводка.Подразделение = Подразделение;
	Проводка.ВидПродажи = Перечисления.ВидыПродаж.Договоры;
	Проводка.Сотрудник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Автор, "ФизическоеЛицо");
	Проводка.Контрагент = Контрагент;
	Проводка.Офис = Офис;
	Проводка.Сумма = СуммаДокумента;
	Проводка.Количество = 1;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если РасторжениеДоговора Тогда
		 ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СуммаДокумента"));
	КонецЕсли;
	
КонецПроцедуры
