
&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	Макет = Документы.НарядЗадание.ПолучитьМакет("ПечатьНарядЗадания");
	СпецификацииШапка = Макет.ПолучитьОбласть("СпецификацииШапка");
	ТабДок.Вывести(СпецификацииШапка);
	Массив = Новый Массив;
	Отчеты.ПроизводственныйОтчет.ВывестиПроизводственныйОтчет(ТабДок, Подразделение, Массив);
	ВставлятьРазделительСтраниц = Истина;
	
КонецПроцедуры
