
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		СформироватьНаСервере();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите подразделение",, "Подразделение");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	ТабДок = Новый ТабличныйДокумент;
	
	Разделы = Новый Структура;
	Разделы.Вставить("НеПроведенныеНоОплаченные", НеПроведенныеНоОплаченные);
	Разделы.Вставить("РазмещенныеИНаПроверке", РазмещенныеИНаПроверке);
	Разделы.Вставить("ПросроченноеИзготовление", ПросроченноеИзготовление);
	Разделы.Вставить("ИзделияНаСкладеГотовойПродукции", ИзделияНаСкладеГотовойПродукции);
	Отчеты.ПроизводственныйОтчет.ВывестиПроизводственныйОтчет(ТабДок, Подразделение, Разделы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	ОткрытьЗначение(Расшифровка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		Подразделение = ПараметрыСеанса.ТекущееПодразделение;
	КонецЕсли;
	
	// Пора бы разобраться с сохранением реквизитов отчетов и обработок...
	НеПроведенныеНоОплаченные = Истина;
	РазмещенныеИНаПроверке = Истина;
	ПросроченноеИзготовление = Истина;
	ИзделияНаСкладеГотовойПродукции = Истина;
	
КонецПроцедуры
