
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Макет = Отчеты.ПроизводственныйОтчет.ПолучитьМакет("Макет");
	СпецификацииШапка = Макет.ПолучитьОбласть("СпецификацииШапка");
	СпецификацииСтрока = Макет.ПолучитьОбласть("СпецификацииСтрока");
	СтрокаЗаметка = Макет.ПолучитьОбласть("СтрокаЗаметка");
	ТабДок.Вывести(СпецификацииШапка);
	Дата = ТекущаяДата();
	//////////////////////////////// ПРОСРОЧЕННОЕ ИЗГОТОВЛЕНИЕ
	Отчеты.ПроизводственныйОтчет.ВывестиПросроченноеИзготовление(ТабДок, Дата, Подразделение);
	
	//////////////////////////////// ИЗДЕЛИЯ НА СКЛАДЕ ГОТОВОЙ ПРОДУКЦИИ
	Отчеты.ПроизводственныйОтчет.ВывестиИзделияНаСкладеГотовойПродукции(ТабДок, Дата, Подразделение);
	
	//////////////////////////////// ГРАФИК ОТГРУЗОК
	Отчеты.ПроизводственныйОтчет.ВывестиГрафикОтгрузок(ТабДок, Дата, Подразделение);
		
	//////////////////////////////// ГРАФИК ДОСТАВОК
	Отчеты.ПроизводственныйОтчет.ВывестиГрафикДоставок(ТабДок, Дата, Подразделение);
		
	//////////////////////////////// ГРАФИК МОНТАЖЕЙ
	Попытка
		Отчеты.ПроизводственныйОтчет.ВывестиГрафикМонтажей(ТабДок, Дата, Подразделение);
	Исключение
	КонецПопытки;
		
	ВставлятьРазделительСтраниц = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//ТабДокРасшифровка = ТабДокОбработкаРасшифровкиНаСервере(Расшифровка);
	
	
КонецПроцедуры

&НаСервере
Функция ТабДокОбработкаРасшифровкиНаСервере(Расшифровка)
	
	Перем Поле, Группировка;
	
	Данные = ПолучитьИзВременногоХранилища(СтрокаРасшифровки);
	ЭлементыРасшифровки = Данные.Элементы.Получить(Расшифровка);
	Поля = ЭлементыРасшифровки.ПолучитьПоля();
	
	Если Поля.Количество() = 1 Тогда
		Поле = Поля[0].Поле;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТабДокОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
