#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает список реквизитов, которые не нужно редактировать
// с помощью обработки группового изменения объектов
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("РольИсполнителя");
	Результат.Добавить("ОсновнойОбъектАдресации");
	Результат.Добавить("ДополнительныйОбъектАдресации");
	Возврат Результат;
	
КонецФункции

#КонецЕсли