
&НаКлиенте
Процедура СменитьПароль(Команда)
	
	Если НовыйПароль <> НовыйПарольПодтверждение Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Новый пароль и подтверждение не совпадают", ЭтаФорма, "НовыйПарольПодтверждение");
		
	Иначе
		
		УстановитьНовыйПароль(НовыйПароль);
		ПоказатьОповещениеПользователя("Пароль пользователя изменен");
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	ТекущийПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийПользователь.ИдентификаторПользователяИБ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаблокироватьРаботуПользователя();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьНовыйПароль(Пароль)

	ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	ТекущийПользовательИБ.Пароль = Пароль;
	ТекущийПользовательИБ.Записать();
	
КонецФункции // ПолучитьТекущегоПользователя()
