
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Ошибки = Неопределено;
	
	Для каждого Строка Из ТекущийОбъект.ОбластиРаспеределения Цикл
	
		Если Строка.Статья.ВидСтатьи = Перечисления.ВидыСтатейДДС.Поступление и ЗначениеЗаполнено(Строка.СуммаВыплаты) Тогда
		
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, Строка.СуммаВыплаты, "Сумма выплаты должна быть пустой, если статья вида ""Поступление""");
		
		ИначеЕсли Строка.Статья.ВидСтатьи = Перечисления.ВидыСтатейДДС.Выплата и ЗначениеЗаполнено(Строка.СуммаПоступления) Тогда
		
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, Строка.СуммаВыплаты, "Сумма поступления должна быть пустой, если статья вида ""Выплата""");
		
		КонецЕсли;
	
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры
