&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьАктКорректировка(ТабДок, ПараметрКоманды);
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ПечатьАктКорректировка(ТабДок, ПараметрКоманды)
	
	Документы.КорректировкаЦеховыхОстатков.ПечатьАктКорректировка(ТабДок, ПараметрКоманды);
	
КонецПроцедуры
