
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РабочийКаталог = ФайловыеФункцииСлужебныйКлиент.ВыбратьПутьККаталогуДанныхПользователя();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		Код = СокрЛП(Элементы.Список.ТекущиеДанные.Код); 
		ПутьКИзображению = РабочийКаталог + Код + ".png";
		ФайлНаДиске = Новый Файл(ПутьКИзображению);
		
		Если ФайлНаДиске.Существует() Тогда
			АдресКартинки = ПутьКИзображению;
		Иначе
			АдресКартинки = "";
		КонецЕсли;
		
	Исключение;
	КонецПопытки;
	
КонецПроцедуры
