
&НаКлиенте
Процедура ПерключательКомуПереноситьПриИзменении(Элемент)
	
	Если ПерключательКомуПереносить = "ВсемПользователям" Тогда
		    Элементы.ПользователиСписок.Доступность = Ложь;
	Иначе
		    Элементы.ПользователиСписок.Доступность = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВыбранные(Команда)
	ПеренестиРеквизитФизическинЛицаВРегистр(ПользователиСписок);
КонецПроцедуры

&НаСервере
Процедура ПеренестиРеквизитФизическинЛицаВРегистр(ПользователиСписок ="")

	Запись = РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПользователиСписок", ПользователиСписок);
	Запрос.УстановитьПараметр("ОтборПользователей",НЕ ЗначениеЗаполнено(ПользователиСписок));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ФизЛицо) КАК Настройка,
		|	Пользователи.ФизическоеЛицо КАК Значение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	(&ОтборПользователей
		|			ИЛИ Пользователи.Ссылка В (&ПользователиСписок))
		|	И НЕ Пользователи.Служебный";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		     Запись.Пользователь =  ВыборкаДетальныеЗаписи.Пользователь;
			 Запись.Настройка = ВыборкаДетальныеЗаписи.Настройка;
			 Запись.Прочитать();
			 
			 Если  Запись.Выбран() И ЗначениеЗаполнено(Запись.Значение) Тогда
				Продолжить;			 
			 КонецЕсли;
			 
			 ЗаполнитьЗначенияСвойств(Запись,ВыборкаДетальныеЗаписи);
			 Запись.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПользователейНажатие(Элемент)
	
	СкрывемыеПользователи = Новый СписокЗначений;
	Если ПользователиСписок.Количество()<> 0 Тогда
		СкрывемыеПользователи = ПользователиСписок.Скопировать();
	КонецЕсли;
	ПараметрыОтбора = Новый Структура("ДоступКИнформационнойБазеРазрешен, РежимВыбора,СкрываемыеПользователи, ЗакрыватьПриВыборе",
	Истина, Истина,СкрывемыеПользователи, Истина);
	ПараметрыОтбора.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаСписка", ПараметрыОтбора, Элементы.ПользователиСписок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВсе(Команда)
	ПеренестиРеквизитФизическинЛицаВРегистр();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ТекПользователь) Тогда
		ПользователиСписок.Добавить(Параметры.ТекПользователь);
	КонецЕсли;
КонецПроцедуры

