
Функция ПолучитьОбщуюНоменклатуруПолностью(Подразделение) Экспорт
	
	Данные = Новый Структура();
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
			
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Общая.Ссылка КАК ОбщаяНоменклатура,
		|	СвязиОбщейНоменклатуры.Номенклатура
		|ИЗ
		|	Справочник.ОбщаяНоменклатура КАК Общая
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиОбщейНоменклатуры КАК СвязиОбщейНоменклатуры
		|		ПО Общая.Ссылка = СвязиОбщейНоменклатуры.ОбщаяНоменклатура
		|			И (СвязиОбщейНоменклатуры.Подразделение = &Подразделение)
		|ГДЕ
		|	НЕ Общая.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Общая.Наименование";
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл			
				  Данные.Вставить(Справочники.ОбщаяНоменклатура.ПолучитьИмяПредопределенного(Выборка.ОбщаяНоменклатура),Выборка.Номенклатура);
			КонецЦикла;
		
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните подразделение.");
		
	КонецЕсли;
		
	Возврат Данные;
	
КонецФункции

Функция ПолучитьОбщуюНоменклатуру(ОбщаяНоменклатура, Подразделение) Экспорт
	
	Номенклатура = Неопределено;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
			
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.УстановитьПараметр("ОбщаяНоменклатура", ОбщаяНоменклатура);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Общая.Ссылка КАК ОбщаяНоменклатура,
		|	СвязиОбщейНоменклатуры.Номенклатура
		|ИЗ
		|	Справочник.ОбщаяНоменклатура КАК Общая
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиОбщейНоменклатуры КАК СвязиОбщейНоменклатуры
		|		ПО Общая.Ссылка = СвязиОбщейНоменклатуры.ОбщаяНоменклатура
		|			И (СвязиОбщейНоменклатуры.Подразделение = &Подразделение)
		|ГДЕ
		|	Общая.Ссылка = &ОбщаяНоменклатура
		|	И НЕ Общая.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Общая.Наименование";
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Номенклатура = Выборка.Номенклатура;
		
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните подразделение.");
		
	КонецЕсли;
		
	Возврат Номенклатура;
	
КонецФункции