
&НаКлиенте
Процедура НаселенныйПунктНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ГородВладелец", Запись.ГородВладелец);
	Элемент = ОткрытьФормуМодально("РегистрСведений.Адреса.Форма.ФормаВыбораИзАдресногоКлассификатора", ПараметрыВыбора);
	
	Если ТипЗнч(Элемент) = Тип("Структура") Тогда
		
		Запись.НаселенныйПункт 					= Элемент.Наименование;
		Запись.КодАдресногоОбъектаВКоде 		= Элемент.КодАдресногоОбъектаВКоде;
		Запись.КодГородаВКоде 						= Элемент.КодГородаВКоде;
		Запись.КодНаселенногоПунктаВКоде 	= Элемент.КодНаселенногоПунктаВКоде;
		Запись.КодРайона 								= Элемент.КодРайонаВКоде;
		
	КонецЕсли;
	
КонецПроцедуры 
