
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("МОЛ", Объект.ФизическоеЛицо);
	Запрос.УстановитьПараметр("ПериодОтчета", КонецДня(ТекущаяДата()));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческийОстатки.Подразделение,
	|	ВЫРАЗИТЬ(УправленческийОстатки.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	СУММА(ВЫБОР
	|			КОГДА УправленческийОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПервоначальнаяСтоимостьОС)
	|				ТОГДА УправленческийОстатки.СуммаОстатокДт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПервоначальнаяСтоимость,
	|	СУММА(ВЫБОР
	|			КОГДА УправленческийОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.АмортизацияОС)
	|				ТОГДА УправленческийОстатки.СуммаОстатокКт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Амортазиация
	|ПОМЕСТИТЬ втОсновныеСредства
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Остатки(
	|			&ПериодОтчета,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПервоначальнаяСтоимостьОС)
	|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.АмортизацияОС),
	|			,
	|			) КАК УправленческийОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	УправленческийОстатки.Подразделение,
	|	ВЫРАЗИТЬ(УправленческийОстатки.Субконто1 КАК Справочник.ОсновныеСредства)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОсновныеСредства.Подразделение КАК Подразделение,
	|	втОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	втОсновныеСредства.ОсновноеСредство.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ЕСТЬNULL(СостояниеОсновныхСредствСрезПоследних.МОЛ, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК МОЛ,
	|	втОсновныеСредства.ПервоначальнаяСтоимость КАК Стоимость,
	|	втОсновныеСредства.Амортазиация КАК Амортизация,
	|	втОсновныеСредства.ПервоначальнаяСтоимость - втОсновныеСредства.Амортазиация КАК Остаток,
	|	СостояниеОсновныхСредствСрезПоследних.СрокАмортизации КАК Срок,
	|	ВЫБОР
	|		 КОГДА СостояниеОсновныхСредствСрезПоследних.НачислятьАмортизацию = ИСТИНА 
	|		 ТОГДА ""✓""
	|	 	 ИНАЧЕ """"
	|	КОНЕЦ КАК Амортизировать
	|ИЗ
	|	втОсновныеСредства КАК втОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеОсновныхСредств.СрезПоследних(&ПериодОтчета, ) КАК СостояниеОсновныхСредствСрезПоследних
	|		ПО втОсновныеСредства.ОсновноеСредство = СостояниеОсновныхСредствСрезПоследних.ОсновноеСредство
	|ГДЕ
	|	ВЫБОР
	|		 КОГДА &МОЛ = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|		 ТОГДА ИСТИНА
	|		 ИНАЧЕ МОЛ = &МОЛ
	|	КОНЕЦ
	|	И ВЫБОР
	|		 КОГДА &Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|		 ТОГДА ИСТИНА
	|		 ИНАЧЕ Подразделение = &Подразделение
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	втОсновныеСредства.ОсновноеСредство.Наименование";
	
	Результат = Запрос.Выполнить();
	Объект.Список.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
