
&НаКлиенте
Процедура СпецификацияПриИзменении(Элемент)
	
	Спецификация = Объект.Спецификация;
	ПерезаполнитьНаСервере(Спецификация);
	
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда)
	
	Ошибки 				= Неопределено;
	Спецификация 	= Объект.Спецификация;
	
	Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
		
		ТекстСообщения = "Не выбрано подразделение";
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.Подразделение", ТекстСообщения);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Спецификация) Тогда
		
		ТекстСообщения = "Не выбрана спецификация";
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.Спецификация", ТекстСообщения);
		
	КонецЕсли;
	
	Если Ошибки <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		Возврат;
		
	КонецЕсли;
	
	ПерезаполнитьНаСервере(Спецификация);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьНаСервере(СпецификацияСсылка)
	
	Объект.СписокНоменклатуры.Очистить();
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Ссылка", СпецификацияСсылка);
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	СпецификацияСписокНоменклатуры.Номенклатура КАК Номенклатура,
	//|	СУММА(СпецификацияСписокНоменклатуры.Количество) КАК Количество,
	//|	МИНИМУМ(СпецификацияСписокНоменклатуры.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения
	//|ИЗ
	//|	Документ.Спецификация.СписокНоменклатуры КАК СпецификацияСписокНоменклатуры
	//|ГДЕ
	//|	СпецификацияСписокНоменклатуры.Ссылка = &Ссылка
	//|	И СпецификацияСписокНоменклатуры.ЧерезСклад
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	СпецификацияСписокНоменклатуры.Номенклатура";
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//ТЗ = Новый ТаблицаЗначений;
	//ТЗ.Колонки.Добавить("Номенклатура");
	//ТЗ.Колонки.Добавить("Количество");
	//ТЗ.Колонки.Добавить("ЕдиницаИзмерения");
	//
	//ГруппаЛДСП16 	= Справочники.НоменклатурныеГруппы.ЛДСП16;
	//ГруппаЛДСП10 	= Справочники.НоменклатурныеГруппы.ЛДСП10;
	//
	//Для каждого Строка Из СпецификацияСсылка.СписокЯщики Цикл
	//	
	//	НоменклатурнаяГруппаФасада 	= Строка.ФасадНоменклатура.НоменклатурнаяГруппа;
	//	Добавить 									= НоменклатурнаяГруппаФасада = ГруппаЛДСП10 или НоменклатурнаяГруппаФасада = ГруппаЛДСП16;
	//	
	//	Если Добавить и Строка.КоличествоРучек > 0 Тогда
	//		
	//		НоваяСтрока 								= ТЗ.Добавить();
	//		НоваяСтрока.Номенклатура 			= Строка.РучкаНоменклатура;
	//		НоваяСтрока.Количество 			= Строка.КоличествоРучек * Строка.КоличествоЯщиков;
	//		НоваяСтрока.ЕдиницаИзмерения 	= Строка.РучкаНоменклатура.ЕдиницаИзмерения;
	//	
	//	КонецЕсли;
	//
	//КонецЦикла;
	//
	//ТЗ.Свернуть("Номенклатура, ЕдиницаИзмерения", "Количество");
	//СтруктураКомплектации 	= Документы.Спецификация.ПерезаполнитьКомплектацию(СпецификацияСсылка);
	Выборка 						= Документы.Спецификация.ПерезаполнитьКомплектацию(СпецификацияСсылка);//СтруктураКомплектации.Выборка;
	//ТЗ 								= СтруктураКомплектации.ТЗ;
	//Объект.СписокНоменклатуры.Загрузить(ТЗ);
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока 								= Объект.СписокНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура 			= Выборка.Номенклатура;
		НоваяСтрока.Количество 			= Выборка.Количество;
		НоваяСтрока.ЕдиницаИзмерения 	= Выборка.ЕдиницаИзмерения;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Спецификация = Объект.Спецификация;
	
	Если Объект.Ссылка = Документы.Комплектация.ПустаяСсылка() и ЗначениеЗаполнено(Объект.Спецификация) И ЗначениеЗаполнено(Объект.Подразделение) Тогда
		
		ПерезаполнитьНаСервере(Спецификация);
		
	КонецЕсли;
	
КонецПроцедуры
