
&НаСервере
Функция СформироватьОтчет(Период, Показатель, СписокПодразделений, ОбщаяСуммаДокументов)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Отчеты.ОтчетПоПродажам.ПолучитьМакет("МакетРасшифровкиРегистратор");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(НачалоМесяца(Период),КонецМесяца(Период));
	ОбластьЗаголовок.Параметры.Показатель = Показатель;
	ОбластьЗаголовок.Параметры.СписокПодразделений = ПолучитьСписокСтрокой(СписокПодразделений);
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	Запрос.УстановитьПараметр("Показатель", Показатель);
	
	Если СписокПодразделений.Количество() = 1 и (СписокПодразделений[0].Значение = Неопределено или СписокПодразделений[0].Значение = Справочники.Подразделения.ПустаяСсылка()) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подразделение В (&СписокПодразделений)", "");
	Иначе
		Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПродажиФактОбороты.Регистратор КАК Документ,
	|	ПродажиФактОбороты.Подразделение КАК Подразделение,
	|	ПродажиФактОбороты.СуммаОборот КАК Сумма,
	|	ПродажиФактОбороты.Регистратор.Комментарий КАК Комментарий,
	|	ПродажиФактОбороты.Регистратор.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрНакопления.ПродажиФакт.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Подразделение В (&СписокПодразделений)
	|				И ВидПродажи = &Показатель) КАК ПродажиФактОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПродажиФактОбороты.Регистратор.Дата";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	НомерСтроки = 1;
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрока.Параметры.РасшифровкаДокумент = Выборка.Ссылка;
		ТабДок.Вывести(ОбластьСтрока);
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	ОбластьПодвал.Параметры.ИтогСумма = ОбщаяСуммаДокументов;
	ТабДок.Вывести(ОбластьПодвал);
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокСтрокой(СписокЗначений)
	
	Результат = "";
	
	Для каждого Элем Из СписокЗначений Цикл
		
		Результат = Результат + Элем.Значение + "  ";
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТабДок = СформироватьОтчет(Параметры.Период, Параметры.Показатель, Параметры.СписокПодразделений, Параметры.ЗначениеПоказателя);
	
КонецПроцедуры
