
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Для Каждого Документ Из ПараметрКоманды Цикл
		
		Массив = Новый Массив;
		Массив.Добавить(Документ);
		
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ФиксированныйКомплект", Ложь); 
		ПараметрыПечати.Вставить("ПереопределитьПользовательскиеНастройкиКоличества", Истина);
		
		МассивМакетов = ОпределитьМакеты(Документ);
		
		ЕстьЧертежДвери = Ложь;
		
		Для каждого Элемент Из МассивМакетов Цикл
			 Если Элемент = "ЧертежДвери" Тогда
			 	ЕстьЧертежДвери = Истина;
				Прервать;			 
			 КонецЕсли; 
		 КонецЦикла;
		 
		 Если ЕстьЧертежДвери Тогда
			 
			ДляФлэш = ПолучитьДанныеДвериДляФлэш(Документ);
			 
			ПараметрыФормыФлэш = Новый Структура;
			ПараметрыФормыФлэш.Вставить("ХранимыйФайл", "ЧертежДвери");
			ПараметрыФормыФлэш.Вставить("МассивДверейФлэш", ДляФлэш.МассивСтрок);
			ПараметрыФормыФлэш.Вставить("МассивДверейСсылки", ДляФлэш.МассивСсылок);
			ПараметрыФормыФлэш.Вставить("Спецификация", Документ);
			ПараметрыФормыФлэш.Вставить("Договор", Неопределено);
			
			КартинкаДвери = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормыФлэш);
			
			ПараметрыПечати.Вставить("КартинкаДвери", КартинкаДвери);

		 КонецЕсли; 
	
		Если ЗначениеЗаполнено(МассивМакетов) Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Спецификация", СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивМакетов), Массив, ПараметрыВыполненияКоманды.Источник, ПараметрыПечати);
		Иначе
			Предупреждение("Документы на печать отсутствуют!");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьДанныеДвериДляФлэш(Документ)
	
	 МассивСтрок = Новый Массив;
	 МассивСсылок = Новый Массив;
	 
	 Для каждого Строка Из Документ.СписокДверей Цикл
	 
	 	 МассивСтрок.Добавить(Строка.Двери.СтрокаДляФлэш);
		 МассивСсылок.Добавить(Строка.Двери);
	 
	 КонецЦикла; 
	 
	 Стр = Новый Структура;
	 Стр.Вставить("МассивСтрок", МассивСтрок);
	 Стр.Вставить("МассивСсылок", МассивСсылок);
	 
	 Возврат Стр;

КонецФункции
 

&НаСервере
Функция ОпределитьМакеты(Документ)
	
	МассивМакетов = Новый Массив;
	
	Если Документ.СписокМатериалы.Количество() > 0 или Документ.СписокЯщики.Количество() > 0 или Документ.СписокНоменклатуры.Количество() > 0 Тогда
		
		МассивМакетов.Добавить("АктГотовности");
		МассивМакетов.Добавить("Спецификация");
		
		СтеклянныеФасады = Ложь;
		АлюминиевыеАГТФасады = Ложь;
		
		Для Каждого Элемент Из Документ.СписокМатериалы Цикл
			
			Если Элемент.Материал = "ФасадСтеклянныйЗакругленный" Тогда
				
				СтеклянныеФасады = Истина;
				
			КонецЕсли;
			
			Если Элемент.Материал = "ФасадАГТ" или Элемент.Материал = "ФасадАлюминиевый" Тогда
				
				АлюминиевыеАГТФасады = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Документ.СписокИзделийПоКаталогу.Количество() > 0 Тогда
			
			Если Документ.СписокИзделийПоКаталогу[0].Изделие.ВидИзделияПоКаталогу = Справочники.ВидыИзделийПоКаталогу.КухняВерхний
				ИЛИ Документ.СписокИзделийПоКаталогу[0].Изделие.ВидИзделияПоКаталогу = Справочники.ВидыИзделийПоКаталогу.КухняНижний Тогда
				МассивМакетов.Добавить("ИзделиеПоКаталогу");	
			Иначе
				МассивМакетов.Добавить("ШкафПоКаталогу");
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтеклянныеФасады Тогда
			
			МассивМакетов.Добавить("СтеклянныеФасады");
			
		КонецЕсли;
		
		Если АлюминиевыеАГТФасады Тогда

			МассивМакетов.Добавить("Фасады");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Документ.Подразделение.БрендДилер Тогда

		МассивМакетов.Добавить("ЗаказБрендДилера");
		
	КонецЕсли;
	
	Если Документ.СписокДверей.Количество() > 0 Тогда
		
		МассивМакетов.Добавить("Дверь");
		МассивМакетов.Добавить("ЧертежДвери");
		
	КонецЕсли;
		
	Если Документ.Упаковка Тогда

		МассивМакетов.Добавить("УпаковочныйЛист");
		
	КонецЕсли;
		
	Дилер = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(ПользователиКлиентСервер.ТекущийПользователь(), Справочники.ПрофилиГруппДоступа.Дилер);
	
	Если (НЕ Дилер ИЛИ (Дилер И Документ.Проведен)) И (Документ.СписокМатериалы.Количество() > 0 или Документ.СписокЯщики.Количество() > 0 или Документ.СписокДверей.Количество() > 0) Тогда
		
		МассивМакетов.Добавить("Раскрой");
		
	КонецЕсли;
	
	// { Васильев Александр Леонидович [02.07.2014]
	//СписокМакетов = СписокМакетов + ?(ЗначениеЗаполнено(СписокМакетов), ",Торг12", "Торг12");
	// ТОРГ-12 пока не печатаем, ждем команды от главного бухгалтера.
	// } Васильев Александр Леонидович [02.07.2014]
	
	Возврат МассивМакетов;
	
КонецФункции



