
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для каждого Строка Из СписокНоменклатуры Цикл
		
		Движение = Движения.ЦеныНоменклатурыПоПодразделениям.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение;
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		
	КонецЦикла;
	
	ЗаполнитьНоменклатуруПодразделений();
	
КонецПроцедуры

Процедура ЗаполнитьНоменклатуруПодразделений()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тз", СписокНоменклатуры.Выгрузить());
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзСписокНоменклатуры.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	тзСписокНоменклатуры.ПодЗаказ,
	|	тзСписокНоменклатуры.ОкруглятьДоЛистов
	|ПОМЕСТИТЬ втСписокНоменклатуры
	|ИЗ
	|	&тз КАК тзСписокНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Список.Номенклатура КАК Номенклатура,
	|	Список.ПодЗаказ КАК ПодЗаказ,
	|	Список.ОкруглятьДоЛистов КАК ОкруглятьДоЛистов,
	|	ЕСТЬNULL(НомПодр.ЗакупОптом, ЛОЖЬ) КАК ЗакупОптом,
	|	ЕСТЬNULL(НомПодр.ДнейНаИзготовление, 0) КАК ДнейНаИзготовление,
	|	НомПодр.ОсновнаяПоСкладу КАК ОсновнаяПоСкладу
	|ИЗ
	|	втСписокНоменклатуры КАК Список
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПодразделений.СрезПоследних(, Подразделение = &Подразделение) КАК НомПодр
	|		ПО Список.Номенклатура = НомПодр.Номенклатура";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Движения.НоменклатураПодразделений.Записывать = Истина;
	
	Для каждого Строка Из ТЗ Цикл
		
		Если Строка.Номенклатура.Базовый Тогда
		
			Движение = Движения.НоменклатураПодразделений.Добавить();
			Движение.Период = Дата;
			Движение.Подразделение = Подразделение;
			ЗаполнитьЗначенияСвойств(Движение, Строка);
			
		Иначе
			
			Сообщить("Позиция не записана: "+Строка.НомерСтроки+". "+Строка.Номенклатура+". Номенклатура не базовая.");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры
