
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для каждого Строка Из СписокНоменклатуры Цикл
		
		Движение = Движения.ЦеныНоменклатурыПоПодразделениям.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение;
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры
