
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
		ПараметрыФормы.Вставить("Подразделение", ТекущиеДанные.Подразделение);
		
		ОткрытьФорму("РегистрСведений.СоответствиеНоменклатуры.Форма.ФормаНастройкиСоответствия", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписаноСоответствие" Тогда
		Элементы.Список.Обновить();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьПодразделение(Команда)
	
	ОткрытьФорму("РегистрСведений.СоответствиеНоменклатуры.Форма.ФормаКопирования");
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	ОткрытьФорму("РегистрСведений.СоответствиеНоменклатуры.Форма.ФормаНастройкиСоответствия",, ЭтаФорма);
	
КонецПроцедуры
