Процедура ВыполнитьСписаниеСоСклада(Отказ)
	
	ОбщаяСебестоимость = 0;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.МатериалыНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеМатериаловСписокНоменклатуры.Номенклатура,
	|	СписаниеМатериаловСписокНоменклатуры.ЕдиницаХранения,
	|	МИНИМУМ(СписаниеМатериаловСписокНоменклатуры.НомерСтроки) КАК НомерСтроки,
	|	СУММА(СписаниеМатериаловСписокНоменклатуры.Количество) КАК Количество
	|ПОМЕСТИТЬ тчДок
	|ИЗ
	|	Документ.СписаниеМатериалов.СписокНоменклатуры КАК СписаниеМатериаловСписокНоменклатуры
	|ГДЕ
	|	СписаниеМатериаловСписокНоменклатуры.Ссылка = &Ссылка
	|	И (СписаниеМатериаловСписокНоменклатуры.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидНоменклатуры.Комплект)
	|			ИЛИ СписаниеМатериаловСписокНоменклатуры.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидНоменклатуры.Материал))
	|
	|СГРУППИРОВАТЬ ПО
	|	СписаниеМатериаловСписокНоменклатуры.ЕдиницаХранения,
	|	СписаниеМатериаловСписокНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчДок.Номенклатура,
	|	тчДок.ЕдиницаХранения,
	|	тчДок.НомерСтроки,
	|	тчДок.Количество,
	|	ЕСТЬNULL(МатериалыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(МатериалыНаСкладахОстатки.СтоимостьОстаток, 0) КАК СтоимостьОстаток
	|ИЗ
	|	тчДок КАК тчДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.МатериалыНаСкладах.Остатки(
	|				&МоментВремени,
	|				Склад = &Склад
	|					И (ЕдиницаХранения, Номенклатура) В
	|						(ВЫБРАТЬ
	|							тчДок.ЕдиницаХранения,
	|							тчДок.Номенклатура
	|						ИЗ
	|							тчДок КАК тчДок)) КАК МатериалыНаСкладахОстатки
	|		ПО тчДок.Номенклатура = МатериалыНаСкладахОстатки.Номенклатура
	|			И тчДок.ЕдиницаХранения = МатериалыНаСкладахОстатки.ЕдиницаХранения";

	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Количество > ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
			
			С = Новый СообщениеПользователю;
			с.Текст ="На складе """ + Склад + """ недостаточно свободного товара """ + ВыборкаДетальныеЗаписи.Номенклатура + 
			""". Из требуемых " + ВыборкаДетальныеЗаписи.Количество + " есть только " + ВыборкаДетальныеЗаписи.КоличествоОстаток;
			С.УстановитьДанные(ЭтотОбъект);
			С.Поле = "СписокНоменклатуры["+(ВыборкаДетальныеЗаписи.НомерСтроки-1)+ "].Количество";
			С.Сообщить();
			
			Отказ = Истина;
			Продолжить;
			
		КонецЕсли;
		
		Движение = Движения.МатериалыНаСкладах.Добавить();
		Себестоимость = ВыборкаДетальныеЗаписи.Количество / ВыборкаДетальныеЗаписи.КоличествоОстаток * ВыборкаДетальныеЗаписи.СтоимостьОстаток;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.ЕдиницаХранения = ВыборкаДетальныеЗаписи.ЕдиницаХранения;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Стоимость = Себестоимость;
		
		ОбщаяСебестоимость = Себестоимость + ОбщаяСебестоимость;
		
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		Запись = Движения.ОборотыПоСтатьям.Добавить();
		Запись.Период = Дата;
		Запись.Подразделение = Подразделение;
		Запись.Статья = Справочники.Статьи.БойБрак;
		Запись.Факт = ОбщаяСебестоимость;
		
		СуммаДокумента = ОбщаяСебестоимость;
		Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Движения.МатериалыНаСкладах.Записать();
	//
	//ВыполнитьСписаниеСоСклада(Отказ);
	//
	//Если Не Отказ Тогда
	//	Движения.МатериалыНаСкладах.Записывать = Истина;
	//	Движения.ОборотыПоСтатьям.Записывать = Истина;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнвентаризацияМатериалов") Тогда
		
	КонецЕсли;
	
КонецПроцедуры
