
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		
		Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
		
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	
	ПараметрыОтчета.Вставить("Период", Период);
	ПараметрыОтчета.Вставить("Монтажник", Монтажник);
	ПараметрыОтчета.Вставить("Город", Город);
	СформироватьНаСервере(ТабДок, ПараметрыОтчета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьНаСервере(ТабДок, ПараметрыОтчета)
	
	ТабДок.Очистить();
	ТабДок = Отчеты.ГрафикМонтажей.СформироватьОтчет(ПараметрыОтчета);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период.Вариант 		= ВариантСтандартногоПериода.Следующие7Дней;
	Пользователь 		= ПараметрыСеанса.ТекущийПользователь;
	Город 					= ЗаполнениеДокументов.ПолучитьЗначение(Пользователь, "Город");
	
КонецПроцедуры
