
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		
		Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
		
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	МассивМонтажников = Новый Массив;
	Если ЗначениеЗаполнено(Монтажник) Тогда
		МассивМонтажников.Добавить(Монтажник);
	КонецЕсли;
	
	МассивГородов = Новый Массив;
	Если ЗначениеЗаполнено(Город) Тогда
		МассивГородов.Добавить(Город);
	КонецЕсли;
	
	ПараметрыОтчета.Вставить("Период", Период);
	ПараметрыОтчета.Вставить("МассивМонтажников", МассивМонтажников);
	ПараметрыОтчета.Вставить("МассивГородов", МассивГородов);
	СформироватьНаСервере(ТабДок, ПараметрыОтчета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьНаСервере(ТабДок, ПараметрыОтчета)
	
	ТабДок.Очистить();
	ТабДок = Отчеты.ГрафикМонтажей.СформироватьОтчет(ПараметрыОтчета);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период.Вариант 		= ВариантСтандартногоПериода.Следующие7Дней;
	Пользователь 		= ПараметрыСеанса.ТекущийПользователь;
	Город 					= ЗаполнениеДокументов.ПолучитьЗначение(Пользователь, "Город");
	
КонецПроцедуры
