
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//ПодпискиНаСобытия.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	
	ОбновитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	
	ЭтаФорма.Элементы.Контрагент.Видимость = Ложь;
	ЭтаФорма.Элементы.Подотчетник.Видимость = Ложь;
	
	СтрокаХозОперация = Строка(Объект.ХозяйственнаяОперация);
	Если СтрокаХозОперация = "Закупка у поставщика" Тогда
		ЭтаФорма.Элементы.Контрагент.Видимость = Истина;
	ИначеЕсли СтрокаХозОперация = "Закупка через подотчетное лицо" Тогда
		ЭтаФорма.Элементы.Подотчетник.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимость();
	
КонецПроцедуры
