
Функция СформироватьОтчет(ПериодОтчета, СписокПодразделений) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Отчеты.ОтчетПоПродажам.ПолучитьМакет("Макет");
	ОбластьЗаголовок =  Макет.ПолучитьОбласть("Заголовок");
	ОбластьНаименованиеПоказателя = Макет.ПолучитьОбласть("НаименованиеПоказателя");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаГод = Макет.ПолучитьОбласть("Строка | ГодКолонка");
	ОбластьСтрокаМесяц = Макет.ПолучитьОбласть("Строка | МесяцКолонка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиФактОбороты.Период КАК ПериодМесяц,
	|	ПродажиФактОбороты.ВидПродажи КАК Показатель,
	|	СУММА(ЕСТЬNULL(ПродажиФактОбороты.СуммаОборот, 0)) КАК Значение,
	|	ГОД(ПродажиФактОбороты.Период) КАК ПериодГод
	|ИЗ
	|	РегистрНакопления.ПродажиФакт.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, Подразделение В (&СписокПодразделений)) КАК ПродажиФактОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиФактОбороты.Период,
	|	ПродажиФактОбороты.ВидПродажи
	|
	|УПОРЯДОЧИТЬ ПО
	|	Показатель,
	|	ПериодМесяц,
	|	ПериодГод
	|ИТОГИ ПО
	|	Показатель,
	|	ПериодГод,
	|	ПериодМесяц ПЕРИОДАМИ(МЕСЯЦ, &ДатаНачала, &ДатаОкончания) КАК ПериодМесяц";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодОтчета.ДатаОкончания);
	Если СписокПодразделений.Количество() = 1 и (СписокПодразделений[0].Значение = Неопределено или СписокПодразделений[0].Значение = Справочники.Подразделения.ПустаяСсылка()) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подразделение В (&СписокПодразделений)", "");
	Иначе
		Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПоказатель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Показатель");
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Пока ВыборкаПоказатель.Следующий() Цикл
		
		ОбластьНаименованиеПоказателя.Параметры.НаименованиеПоказателя = ВыборкаПоказатель.Показатель;
		ТабДок.Вывести(ОбластьНаименованиеПоказателя);
		
		ПериодГод = ВыборкаПоказатель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПериодГод", "ВСЕ");
		ТабДок.Вывести(ОбластьШапка);
		
		Пока ПериодГод.Следующий() Цикл
			
			ОбластьСтрокаГод.Параметры.Год = ПериодГод.ПериодГод;
			ТабДок.Вывести(ОбластьСтрокаГод);
			
			ПериодМесяц = ПериодГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПериодМесяц", "ВСЕ");
			
			Пока ПериодМесяц.Следующий() Цикл
				
				Если ПериодГод.ПериодГод = Число( Формат(ПериодМесяц.ПериодМесяц,"ДФ=гггг")) Тогда
					
					ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = ПериодМесяц.Значение;
					ОбластьСтрокаМесяц.Параметры.РасшифровкаПоказателя = Новый Структура("Период, ЗначениеПоказателя, Показатель, СписокПодразделений", ПериодМесяц.ПериодМесяц, ПериодМесяц.Значение, ВыборкаПоказатель.Показатель, СписокПодразделений);
					ТабДок.Присоединить(ОбластьСтрокаМесяц);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции