
Функция СформироватьОтчет(ПериодОтчета, СписокПодразделений) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Отчеты.ОтчетПоПродажам.ПолучитьМакет("Макет");
	ОбластьЗаголовок =  Макет.ПолучитьОбласть("Заголовок");
	ОбластьНаименованиеПоказателя = Макет.ПолучитьОбласть("НаименованиеПоказателя");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаГод = Макет.ПолучитьОбласть("Строка | ГодКолонка");
	ОбластьСтрокаМесяц = Макет.ПолучитьОбласть("Строка | МесяцКолонка");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	Если ПериодОтчета.ДатаОкончания = Дата("01.01.0001 0:00:00") Тогда
		ПериодОтчета.ДатаОкончания = Дата("31.12.2099 23:59:59");
	КонецЕсли;
	
	ИтогиПоКолонкам = Новый Массив();
	МассивГодов = Новый Массив();
	
	МассивВидовЗапроса = Новый Массив();
	МассивВидовЗапроса.Добавить("Обороты");
	МассивВидовЗапроса.Добавить("Количество договоров");
	
	Для Каждого ВидЗапроса ИЗ МассивВидовЗапроса Цикл
	
		Запрос = Новый Запрос;	
		Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(ПериодОтчета.ДатаНачала));
		Запрос.УстановитьПараметр("ДатаОкончания",КонецГода(ПериодОтчета.ДатаОкончания));
		Запрос.УстановитьПараметр("ВидЗапроса",ВидЗапроса);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажиФактОбороты.Период КАК ПериодМесяц,
		|	ВЫБОР
		|		КОГДА &ВидЗапроса = ""Обороты""
		|			ТОГДА ПродажиФактОбороты.ВидПродажи
		|		ИНАЧЕ ""Количество договоров""
		|	КОНЕЦ КАК Показатель,
		|	СУММА(ВЫБОР
		|			КОГДА &ВидЗапроса = ""Обороты""
		|				ТОГДА ЕСТЬNULL(ПродажиФактОбороты.СуммаОборот, 0)
		|			ИНАЧЕ ЕСТЬNULL(ПродажиФактОбороты.КоличествоОборот, 0)
		|		КОНЕЦ) КАК Значение,
		|	ГОД(ПродажиФактОбороты.Период) КАК ПериодГод
		|ИЗ
		|	РегистрНакопления.ПродажиФакт.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, Подразделение В (&СписокПодразделений)) КАК ПродажиФактОбороты
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ВидЗапроса = ""Обороты""
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПродажиФактОбороты.ВидПродажи = ЗНАЧЕНИЕ(Перечисление.ВидыПродаж.Договоры)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиФактОбороты.Период,
		|	ПродажиФактОбороты.ВидПродажи
		|
		|УПОРЯДОЧИТЬ ПО
		|	Показатель,
		|	ПериодМесяц,
		|	ПериодГод
		|ИТОГИ ПО
		|	Показатель,
		|	ПериодГод,
		|	ПериодМесяц ПЕРИОДАМИ(МЕСЯЦ, &ДатаНачала, &ДатаОкончания) КАК ПериодМесяц";
		
		Если СписокПодразделений.Количество() = 1 и (СписокПодразделений[0].Значение = Неопределено или СписокПодразделений[0].Значение = Справочники.Подразделения.ПустаяСсылка()) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подразделение В (&СписокПодразделений)", "");
		Иначе
			Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаПоказатель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Показатель");
		
		Если ВидЗапроса = "Обороты" Тогда
			ТабДок.Вывести(ОбластьЗаголовок);
			ВывестиДанныеВыборки(ВыборкаПоказатель,ТабДок,СписокПодразделений,ВидЗапроса,ИтогиПоКолонкам,МассивГодов);
		Иначе
			ВывестиДанныеВыборки(ВыборкаПоказатель,ТабДок,СписокПодразделений,ВидЗапроса);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(ПериодОтчета.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецГода(ПериодОтчета.ДатаОкончания));		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Количество замеров"" КАК Показатель,
	|	НАЧАЛОПЕРИОДА(Замер.ДатаЗамера, МЕСЯЦ) КАК ПериодМесяц,
	|	ГОД(Замер.ДатаЗамера) КАК ПериодГод,
	|	КОЛИЧЕСТВО(Замер.Ссылка) КАК Значение
	|ИЗ
	|	Документ.Замер КАК Замер
	|ГДЕ
	|	Замер.ДатаЗамера МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Замер.Проведен
	|	И Замер.Подразделение В(&СписокПодразделений)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Замер.ДатаЗамера, МЕСЯЦ),
	|	ГОД(Замер.ДатаЗамера)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодГод,
	|	ПериодМесяц
	|ИТОГИ ПО
	|	Показатель,
	|	ПериодГод";
	
	Если СписокПодразделений.Количество() = 1 и (СписокПодразделений[0].Значение = Неопределено или СписокПодразделений[0].Значение = Справочники.Подразделения.ПустаяСсылка()) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Замер.Подразделение В (&СписокПодразделений)", "ИСТИНА");
	Иначе
		Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПоказатель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Показатель");
	
	ВидЗапроса = "Количество замеров";
	
	ВывестиДанныеВыборки(ВыборкаПоказатель,ТабДок,СписокПодразделений,ВидЗапроса);
	
	ОбластьНаименованиеПоказателя.Параметры.НаименованиеПоказателя = "Итоги";
	ТабДок.Вывести(ОбластьНаименованиеПоказателя);
	ТабДок.Вывести(ОбластьШапка);
	
	СчетчикГод = 0;
	
	Для Каждого Год Из МассивГодов Цикл
		
		ПострочныйРезультат = 0;
		
		ОбластьСтрокаГод.Параметры.Год = Год;
		ТабДок.Вывести(ОбластьСтрокаГод);
		
		Для Каждого Месяц ИЗ ИтогиПоКолонкам Цикл
			
			ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = Месяц[СчетчикГод];
			ТабДок.Присоединить(ОбластьСтрокаМесяц);
			
			ПострочныйРезультат = ПострочныйРезультат + Месяц[СчетчикГод];
			
		КонецЦикла;
		
		ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = ПострочныйРезультат;
		ТабДок.Присоединить(ОбластьСтрокаМесяц);

		СчетчикГод = СчетчикГод + 1;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура ВывестиДанныеВыборки(Выборка,ТабДок,СписокПодразделений,ВидЗапроса,ИтогиПоКолонкам=Неопределено,МассивГодов=Неопределено)
	
	Макет = Отчеты.ОтчетПоПродажам.ПолучитьМакет("Макет");
	ОбластьЗаголовок =  Макет.ПолучитьОбласть("Заголовок");
	ОбластьНаименованиеПоказателя = Макет.ПолучитьОбласть("НаименованиеПоказателя");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаГод = Макет.ПолучитьОбласть("Строка | ГодКолонка");
	ОбластьСтрокаМесяц = Макет.ПолучитьОбласть("Строка | МесяцКолонка");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	Если МассивГодов = Неопределено Тогда
		МассивГодов = Новый Массив;	
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьНаименованиеПоказателя.Параметры.НаименованиеПоказателя = Выборка.Показатель;
		ТабДок.Вывести(ОбластьНаименованиеПоказателя);
		
		ПериодГод = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПериодГод", "ВСЕ");
		ТабДок.Вывести(ОбластьШапка);
		
		СчетчикГод = 0;
		
		Пока ПериодГод.Следующий() Цикл
			
			ПострочныйРезультат = 0;
			СчетчикГод = СчетчикГод + 1;
			СчетчикМесяц = 0;
			
			ОбластьСтрокаГод.Параметры.Год = Формат(ПериодГод.ПериодГод,"ЧГ=");
			ТабДок.Вывести(ОбластьСтрокаГод);
			
			Если МассивГодов.Количество() < СчетчикГод Тогда
				МассивГодов.Добавить(Формат(ПериодГод.ПериодГод,"ЧГ="));
			КонецЕсли;
			
			Если ВидЗапроса = "Количество замеров" Тогда
				ПериодМесяц = ПериодГод.Выбрать();
			Иначе
				ПериодМесяц = ПериодГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПериодМесяц", "ВСЕ");
			КонецЕсли;
			
			ПервыйМесяц = Истина;
				
			Пока ПериодМесяц.Следующий() Цикл
				
				Если ПериодГод.ПериодГод = Число( Формат(ПериодМесяц.ПериодМесяц,"ДФ=гггг")) Тогда
					
					СчетчикМесяц = СчетчикМесяц +1;
										
					Мес = Число( Формат(ПериодМесяц.ПериодМесяц,"ДФ=М"));
					
					Если ВидЗапроса = "Количество замеров" И ПервыйМесяц И Мес<>1 Тогда
																	
						ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = "";
						
						Для Сч = 1 ПО (Мес-1) Цикл 
							ТабДок.Присоединить(ОбластьСтрокаМесяц);	
						КонецЦикла;
						
					КонецЕсли;
					
					ПервыйМесяц = Ложь;
					
					ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = ПериодМесяц.Значение;
					
					Если ВидЗапроса = "Обороты" Тогда
						ОбластьСтрокаМесяц.Параметры.РасшифровкаПоказателя = Новый Структура("Период, ЗначениеПоказателя, Показатель, СписокПодразделений", ПериодМесяц.ПериодМесяц, ПериодМесяц.Значение, Выборка.Показатель, СписокПодразделений);
					КонецЕсли;
					
					ТабДок.Присоединить(ОбластьСтрокаМесяц);

					ПострочныйРезультат = ПострочныйРезультат + ?(ЗначениеЗаполнено(ПериодМесяц.Значение), ПериодМесяц.Значение, 0);
					
					Если ИтогиПоКолонкам <> Неопределено Тогда
					
						Если ИтогиПоКолонкам.Количество() < СчетчикМесяц Тогда
							МасГод = Новый Массив();
							ИтогиПоКолонкам.Добавить(МасГод);
						КонецЕсли;
						
						Если ИтогиПоКолонкам[СчетчикМесяц-1].Количество() < СчетчикГод Тогда
							ИтогиПоКолонкам[СчетчикМесяц-1].Добавить(0);
						КонецЕсли;
						
						ИтогиПоКолонкам[СчетчикМесяц-1][СчетчикГод-1] = ИтогиПоКолонкам[СчетчикМесяц-1][СчетчикГод-1] + ?(ЗначениеЗаполнено(ПериодМесяц.Значение), ПериодМесяц.Значение, 0);  
						
					КонецЕсли;	
											
				КонецЕсли;
				
			КонецЦикла;
			
			ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = "";
			Если ВидЗапроса = "Количество замеров" Тогда
				Пока Мес < 12 Цикл 
					ТабДок.Присоединить(ОбластьСтрокаМесяц);
					Мес = Мес + 1;	
				КонецЦикла;
			КонецЕсли;
			
			ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = ПострочныйРезультат;
			ТабДок.Присоединить(ОбластьСтрокаМесяц);
	
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры