
Функция СформироватьОтчет(ПериодОтчета, СписокПодразделений) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Отчеты.ОтчетПоПродажам.ПолучитьМакет("Макет");
	ОбластьЗаголовок =  Макет.ПолучитьОбласть("Заголовок");
	ОбластьНаименованиеПоказателя = Макет.ПолучитьОбласть("НаименованиеПоказателя");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаГод = Макет.ПолучитьОбласть("Строка | ГодКолонка");
	ОбластьСтрокаМесяц = Макет.ПолучитьОбласть("Строка | МесяцКолонка");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	Если ПериодОтчета.ДатаОкончания = Дата("01.01.0001 0:00:00") Тогда
		ПериодОтчета.ДатаОкончания = Дата("31.12.2099 23:59:59");
	КонецЕсли;
	
	ИтогиПоКолонкам = Новый Массив();
	МассивГодов = Новый Массив();
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(ПериодОтчета.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецГода(ПериодОтчета.ДатаОкончания));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиФактОбороты.Период КАК ПериодМесяц,
	|	ПродажиФактОбороты.ВидПродажи КАК Показатель,
	|	СУММА(ЕСТЬNULL(ПродажиФактОбороты.СуммаОборот, 0)) КАК ЗначениеСумма,
	|	СУММА(ЕСТЬNULL(ПродажиФактОбороты.КоличествоОборот, 0)) КАК ЗначениеКоличество,
	|	ГОД(ПродажиФактОбороты.Период) КАК ПериодГод
	|ИЗ
	|	РегистрНакопления.ПродажиФакт.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, Подразделение В (&СписокПодразделений)) КАК ПродажиФактОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиФактОбороты.Период,
	|	ПродажиФактОбороты.ВидПродажи
	|
	|УПОРЯДОЧИТЬ ПО
	|	Показатель,
	|	ПериодМесяц,
	|	ПериодГод
	|ИТОГИ ПО
	|	Показатель,
	|	ПериодГод,
	|	ПериодМесяц ПЕРИОДАМИ(МЕСЯЦ, &ДатаНачала, &ДатаОкончания) КАК ПериодМесяц";
	
	Если СписокПодразделений.Количество() = 1 и (СписокПодразделений[0].Значение = Неопределено или СписокПодразделений[0].Значение = Справочники.Подразделения.ПустаяСсылка()) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подразделение В (&СписокПодразделений)", "");
	Иначе
		Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПоказатель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Показатель");
	
	МассивВидовЗапроса = Новый Массив();
	МассивВидовЗапроса.Добавить("Обороты");
	МассивВидовЗапроса.Добавить("Количество договоров");
	МассивВидовЗапроса.Добавить("Количество замеров");
	
	Для Каждого ВидЗапроса ИЗ МассивВидовЗапроса Цикл
	
		ВыборкаПоказатель.Сбросить();
		
		Если ВидЗапроса = "Обороты" Тогда
			
			ТабДок.Вывести(ОбластьЗаголовок);
			ВывестиДанныеВыборки(ВыборкаПоказатель,ТабДок,СписокПодразделений,ВидЗапроса,ИтогиПоКолонкам,МассивГодов);
			
			ОбластьНаименованиеПоказателя.Параметры.НаименованиеПоказателя = "Итоги";
			ТабДок.Вывести(ОбластьНаименованиеПоказателя);
			ТабДок.Вывести(ОбластьШапка);
			
			СчетчикГод = 0;
			
			Для Каждого Год Из МассивГодов Цикл
				
				ПострочныйРезультат = 0;
				
				ОбластьСтрокаГод.Параметры.Год = Год;
				ТабДок.Вывести(ОбластьСтрокаГод);
				
				Для Каждого Месяц ИЗ ИтогиПоКолонкам Цикл
					
					ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = Месяц[СчетчикГод];
					ТабДок.Присоединить(ОбластьСтрокаМесяц);
					
					ПострочныйРезультат = ПострочныйРезультат + Месяц[СчетчикГод];
					
				КонецЦикла;
				
				ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = ПострочныйРезультат;
				ТабДок.Присоединить(ОбластьСтрокаМесяц);

				СчетчикГод = СчетчикГод + 1;
				
			КонецЦикла;
			
			ТабДок.Вывести(ОбластьПустаяСтрока);
			
		Иначе
			ВывестиДанныеВыборки(ВыборкаПоказатель,ТабДок,СписокПодразделений,ВидЗапроса);
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиДанныеПоКоличествуОбращений(ТабДок, СписокПодразделений, ПериодОтчета);
	
	Возврат ТабДок;
	
КонецФункции

Процедура ВывестиДанныеПоКоличествуОбращений(ТабДок, СписокПодразделений, ПериодОтчета, ИтогиПоКолонкам=Неопределено, МассивГодов=Неопределено)
	
	ВидЗапроса = "Количество обращений"; 
	
	Макет = Отчеты.ОтчетПоПродажам.ПолучитьМакет("Макет");
	ОбластьЗаголовок =  Макет.ПолучитьОбласть("Заголовок");
	ОбластьНаименованиеПоказателя = Макет.ПолучитьОбласть("НаименованиеПоказателя");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаГод = Макет.ПолучитьОбласть("Строка | ГодКолонка");
	ОбластьСтрокаМесяц = Макет.ПолучитьОбласть("Строка | МесяцКолонка");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(ПериодОтчета.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецГода(ПериодОтчета.ДатаОкончания));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(1) КАК ЗначениеКоличество,
	|	НАЧАЛОПЕРИОДА(Обращение.Дата, МЕСЯЦ) КАК ПериодМесяц,
	|	ГОД(Обращение.Дата) КАК ПериодГод
	|ИЗ
	|	Документ.Обращение КАК Обращение
	|ГДЕ
	|	Обращение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Обращение.Проведен
	|	И Обращение.Подразделение В(&СписокПодразделений)
	|
	|СГРУППИРОВАТЬ ПО
	|	Обращение.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодМесяц,
	|	ПериодГод
	|ИТОГИ ПО
	|	ПериодГод,
	|	ПериодМесяц ПЕРИОДАМИ(МЕСЯЦ, &ДатаНачала, &ДатаОкончания) КАК ПериодМесяц";
	
	Если СписокПодразделений.Количество() = 1 и (СписокПодразделений[0].Значение = Неопределено или СписокПодразделений[0].Значение = Справочники.Подразделения.ПустаяСсылка()) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Обращение.Подразделение В (&СписокПодразделений)", "");
	Иначе
		Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	КонецЕсли;
	
	Если МассивГодов = Неопределено Тогда
		МассивГодов = Новый Массив;	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();

	ОбластьНаименованиеПоказателя.Параметры.НаименованиеПоказателя = ВидЗапроса;
	ТабДок.Вывести(ОбластьНаименованиеПоказателя);
	
	ПериодГод = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПериодГод", "ВСЕ");
	ТабДок.Вывести(ОбластьШапка);
	
	СчетчикГод = 0;
	
	Пока ПериодГод.Следующий() Цикл
		
		ПострочныйРезультат = 0;
		СчетчикГод = СчетчикГод + 1;
		СчетчикМесяц = 0;
		
		ОбластьСтрокаГод.Параметры.Год = Формат(ПериодГод.ПериодГод,"ЧГ=");
		ТабДок.Вывести(ОбластьСтрокаГод);
		
		Если МассивГодов.Количество() < СчетчикГод Тогда
			МассивГодов.Добавить(Формат(ПериодГод.ПериодГод,"ЧГ="));
		КонецЕсли;

		ПериодМесяц = ПериодГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПериодМесяц", "ВСЕ");

		Пока ПериодМесяц.Следующий() Цикл
			
			Если ПериодГод.ПериодГод = Число( Формат(ПериодМесяц.ПериодМесяц,"ДФ=гггг")) Тогда
				
				СчетчикМесяц = СчетчикМесяц +1;
				
				Значение = ПериодМесяц.ЗначениеКоличество;
				Показатель = ВидЗапроса;
				
				ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = Значение;
				
				ТабДок.Присоединить(ОбластьСтрокаМесяц);

				ПострочныйРезультат = ПострочныйРезультат + ?(ЗначениеЗаполнено(Значение), Значение, 0);
				
				Если ИтогиПоКолонкам <> Неопределено Тогда
				
					Если ИтогиПоКолонкам.Количество() < СчетчикМесяц Тогда
						МасГод = Новый Массив();
						ИтогиПоКолонкам.Добавить(МасГод);
					КонецЕсли;
					
					Если ИтогиПоКолонкам[СчетчикМесяц-1].Количество() < СчетчикГод Тогда
						ИтогиПоКолонкам[СчетчикМесяц-1].Добавить(0);
					КонецЕсли;
					
					ИтогиПоКолонкам[СчетчикМесяц-1][СчетчикГод-1] = ИтогиПоКолонкам[СчетчикМесяц-1][СчетчикГод-1] + ?(ЗначениеЗаполнено(Значение), Значение, 0);  
					
				КонецЕсли;	
										
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = ПострочныйРезультат;
		ТабДок.Присоединить(ОбластьСтрокаМесяц);

	КонецЦикла;
		
КонецПроцедуры

Процедура ВывестиДанныеВыборки(Выборка,ТабДок,СписокПодразделений,ВидЗапроса,ИтогиПоКолонкам=Неопределено,МассивГодов=Неопределено)
	
	Макет = Отчеты.ОтчетПоПродажам.ПолучитьМакет("Макет");
	ОбластьЗаголовок =  Макет.ПолучитьОбласть("Заголовок");
	ОбластьНаименованиеПоказателя = Макет.ПолучитьОбласть("НаименованиеПоказателя");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаГод = Макет.ПолучитьОбласть("Строка | ГодКолонка");
	ОбластьСтрокаМесяц = Макет.ПолучитьОбласть("Строка | МесяцКолонка");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	Если МассивГодов = Неопределено Тогда
		МассивГодов = Новый Массив;	
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Пропустить = Ложь;
		
		Если ВидЗапроса = "Обороты" Тогда
			
			Если Выборка.Показатель = Перечисления.ВидыПродаж.Замер Тогда
				Пропустить = Истина;	
			КонецЕсли;
			
			ОбластьНаименованиеПоказателя.Параметры.НаименованиеПоказателя = Выборка.Показатель;

		Иначе
			
			Если ВидЗапроса = "Количество договоров" Тогда
				
				Если Выборка.Показатель <> Перечисления.ВидыПродаж.Договоры Тогда
					Пропустить = Истина;	
				КонецЕсли;
				
			ИначеЕсли ВидЗапроса = "Количество замеров" Тогда 
				
				Если Выборка.Показатель <> Перечисления.ВидыПродаж.Замер Тогда
					Пропустить = Истина;	
				КонецЕсли;
				
			КонецЕсли;
			
			ОбластьНаименованиеПоказателя.Параметры.НаименованиеПоказателя = ВидЗапроса;
	
		КонецЕсли;
		
		Если НЕ Пропустить Тогда
		
			ТабДок.Вывести(ОбластьНаименованиеПоказателя);
			
			ПериодГод = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПериодГод", "ВСЕ");
			ТабДок.Вывести(ОбластьШапка);
			
			СчетчикГод = 0;
			
			Пока ПериодГод.Следующий() Цикл
				
				ПострочныйРезультат = 0;
				СчетчикГод = СчетчикГод + 1;
				СчетчикМесяц = 0;
				
				ОбластьСтрокаГод.Параметры.Год = Формат(ПериодГод.ПериодГод,"ЧГ=");
				ТабДок.Вывести(ОбластьСтрокаГод);
				
				Если МассивГодов.Количество() < СчетчикГод Тогда
					МассивГодов.Добавить(Формат(ПериодГод.ПериодГод,"ЧГ="));
				КонецЕсли;

				ПериодМесяц = ПериодГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПериодМесяц", "ВСЕ");
		
				Пока ПериодМесяц.Следующий() Цикл
					
					Если ПериодГод.ПериодГод = Число( Формат(ПериодМесяц.ПериодМесяц,"ДФ=гггг")) Тогда
						
						СчетчикМесяц = СчетчикМесяц +1;
						
						Если ВидЗапроса = "Обороты" Тогда
							Значение = ПериодМесяц.ЗначениеСумма;
							Показатель = Выборка.Показатель;
							ОбластьСтрокаМесяц.Параметры.РасшифровкаПоказателя = Новый Структура("Период, ЗначениеПоказателя, Показатель, СписокПодразделений", ПериодМесяц.ПериодМесяц, Значение, Показатель, СписокПодразделений);	
						Иначе
							Значение = ПериодМесяц.ЗначениеКоличество;
							Показатель = ВидЗапроса;
						КонецЕсли;
						
						ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = Значение;
						
						ТабДок.Присоединить(ОбластьСтрокаМесяц);

						ПострочныйРезультат = ПострочныйРезультат + ?(ЗначениеЗаполнено(Значение), Значение, 0);
						
						Если ИтогиПоКолонкам <> Неопределено Тогда
						
							Если ИтогиПоКолонкам.Количество() < СчетчикМесяц Тогда
								МасГод = Новый Массив();
								ИтогиПоКолонкам.Добавить(МасГод);
							КонецЕсли;
							
							Если ИтогиПоКолонкам[СчетчикМесяц-1].Количество() < СчетчикГод Тогда
								ИтогиПоКолонкам[СчетчикМесяц-1].Добавить(0);
							КонецЕсли;
							
							ИтогиПоКолонкам[СчетчикМесяц-1][СчетчикГод-1] = ИтогиПоКолонкам[СчетчикМесяц-1][СчетчикГод-1] + ?(ЗначениеЗаполнено(Значение), Значение, 0);  
							
						КонецЕсли;	
												
					КонецЕсли;
					
				КонецЦикла;
				
				ОбластьСтрокаМесяц.Параметры.ЗначениеПоказателя = ПострочныйРезультат;
				ТабДок.Присоединить(ОбластьСтрокаМесяц);
		
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры