////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗакрыватьПриЗакрытииВладельца = Истина;
	
	Заголовок           = Параметры.Заголовок;
	КомпоновщикНастроек = Параметры.КомпоновщикНастроек;
	ПериодДанных        = Параметры.ПериодДанных;
	
	Если Параметры.ВыборПериода Тогда
		ВыгружатьЗаПериод = ЗначениеЗаполнено(ПериодДанных);
	Иначе
		ВыгружатьЗаПериод = Ложь;
		Элементы.ВыгружатьЗаПериод.Видимость = Ложь;
		Элементы.ПериодДанных.Видимость      = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьПериодаОтбора();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ
//

&НаКлиенте
Процедура ВыгружатьЗаПериодПриИзменении(Элемент)
	УстановитьДоступностьПериодаОтбора();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ
//

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ОповеститьОВыборе(Новый Структура(
		"ДействиеВыбора, КомпоновщикНастроек, ПериодДанных",
		Параметры.ДействиеВыбора, 
		КомпоновщикНастроек, ?(ВыгружатьЗаПериод, ПериодДанных, Новый СтандартныйПериод)));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

&НаКлиенте
Процедура УстановитьДоступностьПериодаОтбора()
	Элементы.ПериодДанных.Доступность = ВыгружатьЗаПериод;
КонецПроцедуры


