
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Структура = ПолучитьСтруктуруОснование(ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура("СтруктураЗамера", Структура);
	ОткрытьФорму("Документ.Замер.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруОснование(Основание)

	Структура = Новый Структура;
	
	ПервыйЗамер = ?(ЗначениеЗаполнено(Основание.ПервыйЗамер), Основание.ПервыйЗамер, Основание.Ссылка);
	Структура.Вставить("ПервыйЗамер", ПервыйЗамер);
	Структура.Вставить("Подразделение", Основание.Подразделение);
	Структура.Вставить("ИмяЗаказчика", Основание.ИмяЗаказчика);
	Структура.Вставить("ОткудаПришел", Основание.ОткудаПришел);
	Структура.Вставить("АдресЗамера", Основание.АдресЗамера);
	Структура.Вставить("Километраж", Основание.Километраж);
	Структура.Вставить("Замерщик", Основание.Замерщик);
	Структура.Вставить("Телефон", Основание.Телефон);
	Структура.Вставить("Агент", Основание.Агент);
	Структура.Вставить("Офис", Основание.Офис);
	
	Возврат Структура;
	
КонецФункции