
Функция СформироватьОтчет(Спецификация) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Отчеты.ИсторияСтатусовСпецификаций.ПолучитьМакет("МакетИсторияСтатусов");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусСпецификации.Период,
	|	СтатусСпецификации.Автор,
	|	СтатусСпецификации.Статус
	|ИЗ
	|	РегистрСведений.СтатусСпецификации КАК СтатусСпецификации
	|ГДЕ
	|	СтатусСпецификации.Спецификация = &Спецификация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьШапка.Параметры.Спецификация = Спецификация;
	
	ТабДок.Вывести(ОбластьШапка);
	
	Номер = 1;
	
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ОбластьСтрока.Параметры.Номер = Номер;
		ТабДок.Вывести(ОбластьСтрока);
		Номер = Номер + 1;
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
