
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Договор = ПолучитьДоговор(Расшифровка);
	
	Если Договор <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Договор", Договор);
		
		ОткрытьФорму("Отчет.ОтчетДополнительнаяМаржа.Форма.ФормаРасшифровки", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДоговор(Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Эл = Данные.Элементы.Получить(Расшифровка);
	МассивРодителей = Эл.ПолучитьРодителей(); 
	Данные = Данные.Элементы.Получить(МассивРодителей[0].Идентификатор).ПолучитьПоля().Получить(0);
	
	Если Данные.Поле = "Договор" Тогда
		
		Возврат Данные.Значение
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции