	
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Функция РольДоступняДляРедактирования() Экспорт
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	ПользовательСупервайзер = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Супервайзер);
	ПользовательАдминистратор = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Администратор);
	
	ДоступныСтатусы = ПользовательСупервайзер ИЛИ ПользовательАдминистратор;
	
	Возврат ДоступныСтатусы;
	
КонецФункции

Процедура Печать(Ссылка, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛицеваяКухни") Тогда
		ПодготовитьПечатнуюФорму("ЛицеваяКухни", "Лицевая кухни", "Документ.Замер.Лицевая",
		Ссылка, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛицеваяШкаф") Тогда
		ПодготовитьПечатнуюФорму("ЛицеваяШкаф", "Лицевая шкаф", "Документ.Замер.Лицевая",
		Ссылка, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОборотнаяКухни") Тогда
		ПодготовитьПечатнуюФорму("ОборотнаяКухни", "Оборотная кухни", "Документ.Замер.Оборотная",
		Ссылка, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОборотнаяШкаф") Тогда
		ПодготовитьПечатнуюФорму("ОборотнаяШкаф", "Оборотная шкаф", "Документ.Замер.Оборотная",
		Ссылка, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);		
	КонецЕсли;                                                                            
	                                                                 
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;                                            
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", Ссылка, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
			
	Если ПредставлениеМакета = "Лицевая кухни" Тогда
		
		ТабДок = ПечатьЛицеваяКухни(Ссылка, ОбъектыПечати);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
		
	ИначеЕсли ПредставлениеМакета = "Лицевая шкаф" Тогда
		
		ТабДок = ПечатьЛицеваяШкаф(Ссылка, ОбъектыПечати);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
		
	ИначеЕсли ПредставлениеМакета = "Оборотная кухни" Тогда
		
		ТабДок = ПечатьОборотнаяКухни(Ссылка, ОбъектыПечати);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
		
	ИначеЕсли ПредставлениеМакета = "Оборотная шкаф" Тогда
		
		ТабДок = ПечатьОборотнаяШкаф(Ссылка, ОбъектыПечати);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПечатьОборотнаяШкаф(Ссылка, ОбъектыПечати) 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ОборотнаяШкаф";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Макет = Документы.Замер.ПолучитьМакет("ОборотнаяШкаф");
	ОбластьТело = Макет.ПолучитьОбласть("Тело");
	
	ТабДок.Вывести(ОбластьТело);
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 1, ОбъектыПечати, Ссылка);
	
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьЛицеваяКухни(Ссылка, ОбъектыПечати) 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ЛицеваяКухни";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Макет = Документы.Замер.ПолучитьМакет("ЛицеваяКухни");
	ОбластьТело = Макет.ПолучитьОбласть("Тело");
	
	ТабДок.Вывести(ОбластьТело);
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 1, ОбъектыПечати, Ссылка);
	
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьОборотнаяКухни(Ссылка, ОбъектыПечати) 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ОборотнаяКухни";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Макет = Документы.Замер.ПолучитьМакет("ОборотнаяКухни");
	ОбластьТело = Макет.ПолучитьОбласть("Тело");
	
	ТабДок.Вывести(ОбластьТело);
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 1, ОбъектыПечати, Ссылка);
	
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьЛицеваяШкаф(Ссылка, ОбъектыПечати) 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ЛицеваяШкаф";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Макет = Документы.Замер.ПолучитьМакет("ЛицеваяШкаф");
	ОбластьТело = Макет.ПолучитьОбласть("Тело");	
	
	ТабДок.Вывести(ОбластьТело);
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 1, ОбъектыПечати, Ссылка);
	
	Возврат ТабДок;
	
КонецФункции
