	
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Функция РольДоступняДляРедактирования() Экспорт
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	ПользовательСупервайзер = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Супервайзер);
	ПользовательАдминистратор = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Администратор);
	
	ДоступныСтатусы = ПользовательСупервайзер ИЛИ ПользовательАдминистратор;
	
	Возврат ДоступныСтатусы;
	
КонецФункции

Процедура Печать(Ссылка, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛицеваяКухни") Тогда
		ПодготовитьПечатнуюФорму("ЛицеваяКухни", "Лицевая кухни", "Документ.Замер.Лицевая",
		Ссылка, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛицеваяШкаф") Тогда
		ПодготовитьПечатнуюФорму("ЛицеваяШкаф", "Лицевая шкаф", "Документ.Замер.Лицевая",
		Ссылка, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОборотнаяКухни") Тогда
		ПодготовитьПечатнуюФорму("ОборотнаяКухни", "Оборотная кухни", "Документ.Замер.Оборотная",
		Ссылка, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОборотнаяШкаф") Тогда
		ПодготовитьПечатнуюФорму("ОборотнаяШкаф", "Оборотная шкаф", "Документ.Замер.Оборотная",
		Ссылка, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);		
	КонецЕсли;                                                                            
	                                                                 
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;                                            
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", Ссылка, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
			
	Если ИмяМакета = "ЛицеваяКухни" Тогда
		
		ТабДок = ПечатьЛицевая(Ссылка, ОбъектыПечати, ИмяМакета);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
		
	ИначеЕсли ИмяМакета = "ЛицеваяШкаф" Тогда
		
		ТабДок = ПечатьЛицевая(Ссылка, ОбъектыПечати, ИмяМакета);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
		
	ИначеЕсли ИмяМакета = "ОборотнаяКухни" Тогда
		
		ТабДок = ПечатьОборотная(Ссылка, ОбъектыПечати, ИмяМакета);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
		
	ИначеЕсли ИмяМакета = "ОборотнаяШкаф" Тогда
		
		ТабДок = ПечатьОборотная(Ссылка, ОбъектыПечати, ИмяМакета);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПечатьОборотная(Ссылка, ОбъектыПечати, ИмяМакета) 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ОборотнаяШкаф";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Макет = Документы.Замер.ПолучитьМакет("Оборотная");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Если ИмяМакета = "ОборотнаяШкаф" Тогда
		ОбластьТело = Макет.ПолучитьОбласть("Шкаф");
	ИначеЕсли ИмяМакета = "ОборотнаяКухни" Тогда
		ОбластьТело = Макет.ПолучитьОбласть("Кухня");
	КонецЕсли;
	
	
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьТело);
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 1, ОбъектыПечати, Ссылка);
	
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьЛицевая(Ссылка, ОбъектыПечати, ИмяМакета) 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ЛицеваяКухни";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Макет = Документы.Замер.ПолучитьМакет("Лицевая");
	
	Если ИмяМакета = "ЛицеваяШкаф" Тогда
		ОбластьТело = Макет.ПолучитьОбласть("Шкаф");
	ИначеЕсли ИмяМакета = "ЛицеваяКухни" Тогда
		ОбластьТело = Макет.ПолучитьОбласть("Кухня");
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьТело);
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 1, ОбъектыПечати, Ссылка);
	
	Возврат ТабДок;
	
КонецФункции
