	
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Функция РольДоступняДляРедактирования() Экспорт
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	ПользовательСупервайзер = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Супервайзер);
	ПользовательАдминистратор = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Администратор);
	
	ДоступныСтатусы = ПользовательСупервайзер ИЛИ ПользовательАдминистратор;
	
	Возврат ДоступныСтатусы;
	
КонецФункции
