
&НаКлиенте
Процедура ПоворотВправоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.ПоворотВправо = ДеталиРасположениеПазовОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Функция ДеталиРасположениеПазовОбработкаВыбораНаСервере(ЗначениеСправочника)
	
	ЭлементСправочника = Справочники.РасположениеПазовИРучкиНаФасадах.НайтиПоРеквизиту("ИмяКартинки", ЗначениеСправочника);
	Возврат ЭлементСправочника;
	
КонецФункции

&НаКлиенте
Процедура ЗеркальноеПоложениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.ЗеркальноеПоложение = ДеталиРасположениеПазовОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры
