////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьНазваниеТипаАдресногоОбъекта();
	СформироватьНазваниеПризнакаАктуальности();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТипАдресногоЭлементаПриИзменении(Элемент)
	
	СформироватьНазваниеТипаАдресногоОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ПризнакАктуальностиПриИзменении(Элемент)
	
	СформироватьНазваниеПризнакаАктуальности();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

&НаКлиенте
Процедура СформироватьНазваниеТипаАдресногоОбъекта()
	
	Если Запись.ТипАдресногоЭлемента = 1 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru = '(регион)'");
	ИначеЕсли Запись.ТипАдресногоЭлемента = 2 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru = '(район)'");
	ИначеЕсли Запись.ТипАдресногоЭлемента = 3 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru = '(город)'");
	ИначеЕсли Запись.ТипАдресногоЭлемента = 4 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru = '(нас.пункт)'");
	ИначеЕсли Запись.ТипАдресногоЭлемента = 5 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru = '(улица)'");
	ИначеЕсли Запись.ТипАдресногоЭлемента = 6 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru = '(дом)'");
	ИначеЕсли Запись.ТипАдресногоЭлемента = 7 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru = '(квартира)'");
	Иначе
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНазваниеПризнакаАктуальности()
	
	Если Запись.ПризнакАктуальности = 0 Тогда
		Элементы.НазваниеПризнакаАктуальности.Заголовок = НСтр("ru = '(актуален)'");
	ИначеЕсли Запись.ПризнакАктуальности >= 1 И Запись.ПризнакАктуальности <= 50 Тогда
		Элементы.НазваниеПризнакаАктуальности.Заголовок = НСтр("ru = '(переименован)'");
	ИначеЕсли Запись.ПризнакАктуальности = 51 Тогда
		Элементы.НазваниеПризнакаАктуальности.Заголовок = НСтр("ru = '(переподчинен)'");
	ИначеЕсли Запись.ПризнакАктуальности = 99 Тогда
		Элементы.НазваниеПризнакаАктуальности.Заголовок = НСтр("ru = '(не существует)'");
	Иначе
		Элементы.НазваниеПризнакаАктуальности.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры