Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,
	ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасходныйКассовыйОрдер") Тогда
		ПодготовитьПечатнуюФорму("РасходныйКассовыйОрдер", "Расходный кассовый ордер", "Документ.РасходДенежныхСредств.РасходныйКассовыйОрдер",
		МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	Если НужноПечататьМакет Тогда
		Если ИмяМакета = "РасходныйКассовыйОрдер" Тогда
			ТабДок = ПечатьКассовыйОрдер(МассивОбъектов, ОбъектыПечати); 
		КонецЕсли;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьКассовыйОрдер(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_РасходныйКассовыйОрдер";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасходДенежныхСредств.Подразделение КАК ПредставлениеПодразделения,
	|	РасходДенежныхСредств.Подразделение.Организация КАК ПредставлениеОрганизации,
	|	РасходДенежныхСредств.Номер КАК НомерДокумента,
	|	РасходДенежныхСредств.Дата КАК ДатаДокумента,
	|	РасходДенежныхСредств.Подразделение.Код,
	|	РасходДенежныхСредств.Субконто1Дт,
	|	РасходДенежныхСредств.Субконто1Кт КАК Основание,
	|	РасходДенежныхСредств.Субконто2Дт,
	|	РасходДенежныхСредств.Субконто2Кт,
	|	РасходДенежныхСредств.Субконто3Дт,
	|	РасходДенежныхСредств.Субконто3Кт,
	|	РасходДенежныхСредств.Сумма,
	|	РасходДенежныхСредств.Подразделение,
	|	РасходДенежныхСредств.Подразделение.Организация.ФИОДолжностногоЛица,
	|	РасходДенежныхСредств.СчетДт.Код КАК СубСчет,
	|	РасходДенежныхСредств.СчетКт.Код КАК КредитСубСчет,
	|	РасходДенежныхСредств.Ссылка,
	|	ДокументыФизическихЛицСрезПоследних.Серия,
	|	ДокументыФизическихЛицСрезПоследних.Номер,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан,
	|	ДокументыФизическихЛицСрезПоследних.ВидДокумента
	|ИЗ
	|	Документ.РасходДенежныхСредств КАК РасходДенежныхСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	|		ПО (ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(РасходДенежныхСредств.Субконто1Дт) = ТИП(Справочник.ФизическиеЛица)
	|					ТОГДА РасходДенежныхСредств.Субконто1Дт = ДокументыФизическихЛицСрезПоследних.Физлицо
	|			КОНЕЦ)
	|ГДЕ
	|	РасходДенежныхСредств.Ссылка В(&Ссылка)
	|	И РасходДенежныхСредств.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Макет 	= Документы.РасходДенежныхСредств.ПолучитьМакет("РасходныйКассовыйОрдер");
	Шапка 	= Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;	
	
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		ФормСтрока = "Л = ru_RU; ДП = Истина";
		ПарПредмета = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
		СуммаПрописью = ЧислоПрописью(Выборка.Сумма, ФормСтрока, ПарПредмета);
		
		ДатаПрописью = ЛексКлиентСервер.ДатаПрописью(Выборка.ДатаДокумента);
		
		Сотрудник = ?(ТипЗнч(Выборка.Субконто1Дт) = Тип("СправочникСсылка.Контрагенты") ИЛИ 
								ТипЗнч(Выборка.Субконто1Дт) = Тип("СправочникСсылка.ФизическиеЛица"), Выборка.Субконто1Дт, Неопределено);
		
		Шапка.Параметры.Заполнить(Выборка);
		
		Шапка.Параметры.Сотрудник = Сотрудник;
		Шапка.Параметры.СуммаПрописью = СуммаПрописью;
		Шапка.Параметры.РеквизитыДокументаУдостоверяющегоЛичность = ?(ТипЗнч(Выборка.Субконто1Дт) = Тип("СправочникСсылка.ФизическиеЛица"), Строка(Выборка.ВидДокумента) + " " + 
		"Серия " + Строка(Выборка.Серия) + " " +
		"Номер " + Строка(Выборка.Номер) + " " +
		"Выдан " + Строка(Формат(Выборка.ДатаВыдачи, "ДЛФ=Д")) + " " +
		Строка(Выборка.КемВыдан), "");

		
		ТабДок.Вывести(Шапка);
		
		ВставлятьРазделительСтраниц = Истина;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 
		НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры
