
Процедура ОбработкаПроведения(Отказ, Режим)
	
	БухгалтерскийУчетСервер.ПроведениеДенежныхСредств(Ссылка, Движения);
	
	Если СчетДт = ПланыСчетов.Управленческий.ВзаиморасчетыСПокупателями Тогда
		Если ТипЗнч(Субконто2Дт) = Тип("ДокументСсылка.Договор") Тогда
			ДобавитьПоказателиСотрудникам();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Для Каждого Элемент Из СчетДт.ВидыСубконто Цикл
	//	ПроверяемыеРеквизиты.Добавить("Субконто" +Элемент.НомерСтроки+ "Дт");
	//КонецЦикла;
	//
	//Для Каждого Элемент Из СчетКт.ВидыСубконто Цикл
	//	ПроверяемыеРеквизиты.Добавить("Субконто" +Элемент.НомерСтроки+ "Кт");
	//КонецЦикла;	
	
КонецПроцедуры

Процедура ДобавитьПоказателиСотрудникам()
	
	ПроцентПоделиться = Субконто2Дт.ПроцентПоделиться / 100;
	ПроцентАвтора = 1 - ПроцентПоделиться;
		
	ДопПроводки = Движения.Управленческий.Добавить();
	ДопПроводки.Период = Дата;
	ДопПроводки.СчетДт = ПланыСчетов.Управленческий.ПустаяСсылка();
	ДопПроводки.СчетКт = ПланыСчетов.Управленческий.ПоказателиСотрудника;
	ДопПроводки.Подразделение = Подразделение;
	ДопПроводки.СубконтоКт.ВидыПоказателейСотрудников = Перечисления.ВидыПоказателейСотрудников.ВыручкаПоДоговорам;
	ДопПроводки.СубконтоКт.ФизическиеЛица = Субконто2Дт.Автор.ФизическоеЛицо;
	ДопПроводки.Сумма = Сумма * ПроцентАвтора;
	ДопПроводки.Содержание = "Показатели сотрудников";
	
	Если ПроцентПоделиться <> 0 Тогда
		
		ДопПроводки = Движения.Управленческий.Добавить();
		ДопПроводки.Период = Дата;
		ДопПроводки.СчетДт = ПланыСчетов.Управленческий.ПустаяСсылка();
		ДопПроводки.СчетКт = ПланыСчетов.Управленческий.ПоказателиСотрудника;
		ДопПроводки.Подразделение = Подразделение;
		ДопПроводки.СубконтоКт.ВидыПоказателей = Перечисления.ВидыПоказателейСотрудников.ВыручкаПоДоговорам;
		ДопПроводки.СубконтоКт.ФизическиеЛица = Субконто2Дт.Поделиться;
		ДопПроводки.Сумма = Сумма * ПроцентПоделиться;
		ДопПроводки.Содержание = "Показатели сотрудников";
		
	КонецЕсли;
	
КонецПроцедуры