
&НаКлиенте
Процедура СтрокаПолнотекстовогоПоискаПриИзменении(Элемент)
	
	ПараметрыПоиска = Новый Структура("ПереданнаяСтрокаПоиска", СтрокаПолнотекстовогоПоиска);
	ОткрытьФорму("Обработка.ПолнотекстовыйПоискВДанных.Форма", ПараметрыПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьПароль(Команда)
	
	ОткрытьФорму("ОбщаяФорма.СменаПароля");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУчебныеЗанятияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Тема", Элементы.СписокУчебныеЗанятия.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Справочник.УчебныеЗанятия.Форма.ФормаВыборДействия", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокУчебныеЗанятия.Параметры.УстановитьЗначениеПараметра("Пользователь", ПолучитьПользователя());
	СписокУчебныеЗанятия.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПользователя()
	
	Возврат Пользователи.ТекущийПользователь();
	
КонецФункции

