
&НаКлиенте
Процедура СтрокаПолнотекстовогоПоискаПриИзменении(Элемент)
	
	ПараметрыПоиска = Новый Структура("ПереданнаяСтрокаПоиска", СтрокаПолнотекстовогоПоиска);
	ОткрытьФорму("Обработка.ПолнотекстовыйПоискВДанных.Форма", ПараметрыПоиска);
	
	//ПараметрыПоиска = Новый Структура("СтрокаПоиска", СтрокаПолнотекстовогоПоиска);
	//ОткрытьФорму("Обработка.ПоискВДанных.Форма", ПараметрыПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьПароль(Команда)
	
	ОткрытьФорму("ОбщаяФорма.СменаПароля");
	
КонецПроцедуры
