
&НаКлиенте
Процедура Скопировать(Команда)
	
	СкопироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа", НоменклатурнаяГруппа);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеИсточник);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеНоменклатуры.Номенклатура,
	|	СоответствиеНоменклатуры.НоменклатурнаяГруппа,
	|	СоответствиеНоменклатуры.Подразделение,
	|	СоответствиеНоменклатуры.ПодставляемаяНоменклатура
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатуры КАК СоответствиеНоменклатуры
	|ГДЕ
	|	СоответствиеНоменклатуры.Подразделение = &Подразделение
	|	И ВЫБОР
	|			КОГДА &НоменклатурнаяГруппа = ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ СоответствиеНоменклатуры.Номенклатура.НоменклатурнаяГруппа = &НоменклатурнаяГруппа
	|		КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.СоответствиеНоменклатуры.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Подразделение = ПодразделениеПриемник;
		МенеджерЗаписи.НоменклатурнаяГруппа = Выборка.НоменклатурнаяГруппа;
		МенеджерЗаписи.ПодставляемаяНоменклатура = Выборка.ПодставляемаяНоменклатура;
		МенеджерЗаписи.Номенклатура = Выборка.Номенклатура;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
