
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		СтандартнаяОбработка=Ложь;
		ОткрытьФормуЭлемента(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		Отказ=Истина;
		ОткрытьФормуЭлемента(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЭлемента(Элемент)
	
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Документ.СообщениеДилеру.Форма.ФормаПросмотра", ПараметрыФормы);

КонецПроцедуры
 
