
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НавСсылка = ПолучитьНавигационнуюСсылку(Параметры.Тема);
	
	МассивСтрок = Новый Массив;
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("Тестирование призвано помочь сотрудникам закрепить изученный материал и выявить пробелы в знаниях." + Символы.ПС));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("Вы можете проходить тесты неограниченное количество раз, однако процент знания темы определяется как средний по всем попыткам." + Символы.ПС + Символы.ПС));
	
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("Тест по теме "));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Параметры.Тема.Наименование,,,, НавСсылка));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" состоит из "));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Параметры.КоличествоВопросов, Новый Шрифт(,,Истина)));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" вопросов." + Символы.ПС + Символы.ПС));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("На вопросы не обязательно отвечать по порядку, можно вернуться к ним позднее если возникают сложности." + Символы.ПС));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("Вопросы оставленные без ответов будут зачтены как неправильные." + Символы.ПС));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("Время на ответы не ограничено, но будет зафиксированно." + Символы.ПС));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("После окончания теста, Вам будет предоставлен результат с указанными правильными ответами и ошибками" + Символы.ПС + Символы.ПС));
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("Внимание! В вопросе может быть больше одного правильного ответа!" + Символы.ПС + Символы.ПС , Новый Шрифт(,,Истина)));
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("Желаем удачи!!!", Новый Шрифт(,,Истина)));
	
	ТекстОписания = Новый ФорматированнаяСтрока(МассивСтрок);
	ОписаниеТеста = Новый ФорматированнаяСтрока(ТекстОписания);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьТестирование(Команда)
	
	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьТестирование(Команда)
	
	Закрыть(Ложь);
	
КонецПроцедуры
