
&НаКлиенте
Процедура Все(Комана)

	Для каждого ъ Из Список Цикл
	
		ъ.Пометка = Истина;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Параметры.Подразделение);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ФизическиеЛица.Подразделение = &Подразделение
	|		КОНЕЦ
	|	И ФизическиеЛица.Активность
	|	И ФизическиеЛица.ЗамерыИВстречи";
	
	Список.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Если Параметры.Свойство("ОригинальныйСписок") Тогда
		Для каждого ъ Из Параметры.ОригинальныйСписок Цикл
			
			ЗначениеПолногоСписка = Неопределено;
			ЗначениеПолногоСписка = Список.НайтиПоЗначению(ъ.Значение);
			
			Если ЗначениеПолногоСписка <> Неопределено Тогда
				ЗначениеПолногоСписка.Пометка = Истина;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если НЕ ВладелецФормы = Неопределено Тогда
		
		СписокВыбранных = Новый СписокЗначений;
		
		Для каждого ъ Из Список Цикл
			Если ъ.Пометка Тогда
				СписокВыбранных.Добавить(ъ.Значение);
			КонецЕсли;
		КонецЦикла;
		
		ОповеститьОВыборе(СписокВыбранных);
		
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Инвертировать(Команда)
	
	Для каждого ъ Из Список Цикл
		ъ.Пометка = НЕ ъ.Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	Для каждого ъ Из Список Цикл
		ъ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
