////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контроль динамического обновления конфигурации"
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Обработчик ожидания проверяет, что информационная база была обновлена динамически, и 
// сообщает об этом пользователю.
//
Процедура ОбработчикОжиданияПроверкиДинамическогоИзмененияИБ() Экспорт
	
	КонтрольДинамическогоОбновленияКонфигурацииКлиент.ОбработчикОжиданияПроверкиДинамическогоОбновления();
	
КонецПроцедуры