
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = Спецификация.Контрагент.Префикс;
	ЛексСервер.УстановитьПрефиксКонтрагента(Ссылка, Префикс);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Спецификация") Тогда
		
		Спецификация = ДанныеЗаполнения.Ссылка;
		АдресДоговора = ДанныеЗаполнения.АдресМонтажа;
		Изделие = "" + ДанныеЗаполнения.Изделие;
		ДатаМонтажа = ДанныеЗаполнения.ДатаМонтажа;
		СуммаДокумента = Документы.Спецификация.ПолучитьСуммаСДилерскимиНаценками(Спецификация);
		
	КонецЕсли;
	
КонецПроцедуры
