Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьБухгалтерскаяСправка") Тогда
		ПодготовитьПечатнуюФорму("ПечатьБухгалтерскаяСправка", "Печать бухгалтерская справка", "Документ.Операция.ПечатьБухгалтерскаяСправка",
		МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	
	Если НужноПечататьМакет Тогда
		
		Если ИмяМакета = "ПечатьБухгалтерскаяСправка" Тогда
			
			ТабДок = ПечатьБухгалтерскаяСправка(МассивОбъектов, ОбъектыПечати);
			
		КонецЕсли;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьБухгалтерскаяСправка(МассивДокументов, ОбъектыПечати) Экспорт
	
	НомерСтрокиНачало = 0;
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	
	Макет = Документы.Операция.ПолучитьМакет("БухгалтерскаяСправка");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал"); 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ПечатьБухгалтерскаяСправка";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("МассивДокументов", МассивДокументов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УправленческийДвиженияССубконто.Регистратор КАК Регистратор,
	|	УправленческийДвиженияССубконто.СчетДт,
	|	УправленческийДвиженияССубконто.СубконтоДт1,
	|	УправленческийДвиженияССубконто.СубконтоДт2,
	|	УправленческийДвиженияССубконто.СубконтоДт3,
	|	УправленческийДвиженияССубконто.СчетКт,
	|	УправленческийДвиженияССубконто.СубконтоКт1,
	|	УправленческийДвиженияССубконто.СубконтоКт2,
	|	УправленческийДвиженияССубконто.СубконтоКт3,
	|	УправленческийДвиженияССубконто.Сумма,
	|	УправленческийДвиженияССубконто.КоличествоДт,
	|	УправленческийДвиженияССубконто.КоличествоКт
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.ДвиженияССубконто(, , Регистратор В (&МассивДокументов), , ) КАК УправленческийДвиженияССубконто
	|ИТОГИ ПО
	|	Регистратор";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ВыборкаРегистратор = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаРегистратор.Следующий() Цикл
			
			Док = ВыборкаРегистратор.Регистратор;
		
			ОбластьШапка.Параметры.Организация = Док.Подразделение.Организация;
			ОбластьШапка.Параметры.НомерДокумента = Док.Номер;
			ОбластьШапка.Параметры.ДатаДокумента = Формат(Док.Дата,"ДЛФ=D");
			ОбластьШапка.Параметры.Содержание = Док.Содержание;
			
			ТабДок.Вывести(ОбластьШапка);
			Табдок.Вывести(ОбластьЗаголовокТаблицы);
			
			ВыборкаДвижение = ВыборкаРегистратор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			НомерСтроки = 1;
			
			Пока ВыборкаДвижение.Следующий() Цикл
				
				 ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаДвижение);
				 СтрокаСубконтоДт = ?(ЗначениеЗаполнено(ВыборкаДвижение.СубконтоДт1),""+ВыборкаДвижение.СубконтоДт1,"") + ?(ЗначениеЗаполнено(ВыборкаДвижение.СубконтоДт2),", "+ВыборкаДвижение.СубконтоДт2,"") + ?(ЗначениеЗаполнено(ВыборкаДвижение.СубконтоДт3),", "+ВыборкаДвижение.СубконтоДт3,"");
				 СтрокаСубконтоКт = ?(ЗначениеЗаполнено(ВыборкаДвижение.СубконтоКт1),""+ВыборкаДвижение.СубконтоКт1,"") + ?(ЗначениеЗаполнено(ВыборкаДвижение.СубконтоКт2),", "+ВыборкаДвижение.СубконтоКт2,"") + ?(ЗначениеЗаполнено(ВыборкаДвижение.СубконтоКт3),", "+ВыборкаДвижение.СубконтоКт3,"");
				 
				 ОбластьСтрокаТаблицы.Параметры.АналитикаДт = СтрокаСубконтоДт;
				 ОбластьСтрокаТаблицы.Параметры.АналитикаКт = СтрокаСубконтоКт;
				  
				 ОбластьСтрокаТаблицы.Параметры.НомерСтроки = НомерСтроки;
				 НомерСтроки = НомерСтроки + 1;
				 
				 Табдок.Вывести(ОбластьСтрокаТаблицы);
				 
			КонецЦикла;
			
			ОбластьПодвал.Параметры.РасшифровкаПодписиИсполнителя = Док.Автор;
			Табдок.Вывести(ОбластьПодвал);
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;

	КонецЕсли;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, МассивДокументов);
	
	Возврат ТабДок;
	
КонецФункции

