&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = Параметры.НачалоПериода;
	КонецПериода = Параметры.КонецПериода;
	Подразделения = Параметры.Подразделения;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Функция СформироватьОтчет()
	
	ТабДок.Очистить();
	
	Макет = Отчеты.КлючевыеПоказатели.ПолучитьМакет("МакетРасшифровкаЛимита");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьЗаголовок.Параметры.Период = Формат(НачалоПериода,"ДФ=dd.MM.yy")+" - "+Формат(КонецПериода,"ДФ=dd.MM.yy");
	ОбластьЗаголовок.Параметры.Подразделения = ПолучитьСписокСтрокой(Подразделения);
	
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Подразделение", Подразделения);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	УправленческийОбороты.Период КАК Период,
	|	МАКСИМУМ(ПлановыйЛимит.Норматив) КАК Норматив,
	|	СУММА(УправленческийОбороты.СуммаОборот) КАК Наряд
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			День,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПоказателиПодразделения),
	|			,
	|			Подразделение В (&Подразделение)
	|				И Субконто1 = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейПодразделений.СуммаДетали),
	|			,
	|			) КАК УправленческийОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыйЛимит КАК ПлановыйЛимит
	|		ПО (ПлановыйЛимит.Период В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ПлановыйЛимит.Период КАК Период
	|				ИЗ
	|					РегистрСведений.ПлановыйЛимит КАК ПлановыйЛимит
	|				ГДЕ
	|					ПлановыйЛимит.Период <= УправленческийОбороты.Период
	|					И ПлановыйЛимит.Подразделение В (&Подразделение)
	|				УПОРЯДОЧИТЬ ПО
	|					Период УБЫВ))
	|			И УправленческийОбороты.Подразделение = ПлановыйЛимит.Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	УправленческийОбороты.Период";
	
	Таблица = Запрос.Выполнить().Выгрузить();

	ДнейВМесяце =  День(КонецПериода);
	ТекущийДень = НачалоПериода;
	СНорматив = 0;
	СНаряд = 0;
	СуммаНорматив = 0;
	СуммаНаряд = 0;
	СуммаДней = 0;
	 
	Пока ( День(ТекущийДень) <= ДнейВМесяце ) И ( ТекущийДень <= КонецПериода) Цикл
		
		ЕстьЗапись = Ложь;
		
		Для Каждого Строка Из Таблица Цикл
			
			Если День(Строка.Период) = День(ТекущийДень) Тогда
				
				СНорматив = Строка.Норматив;
				СНаряд = Строка.Наряд;
				
				ЕстьЗапись = Истина;
				                     
				Таблица.Удалить(Строка);
				Прервать;
				
			КонецЕсли;
				
		КонецЦикла;
		
		Если НЕ ЕстьЗапись Тогда
			СНаряд = 0;
		КонецЕсли;
				
		Если ДеньНедели(ТекущийДень) = 7 Тогда
			ОбластьСтрока2.Параметры.Дата = Формат(ТекущийДень,"ДФ=dd.MM.yy");
            ТабДок.Вывести(ОбластьСтрока2);
		Иначе
			ОбластьСтрока.Параметры.Дата = Формат(ТекущийДень,"ДФ=dd.MM.yy");
	   	    ОбластьСтрока.Параметры.Норматив = СНорматив;
			ОбластьСтрока.Параметры.Наряд = СНаряд;
			ТабДок.Вывести(ОбластьСтрока);
			
			СуммаНорматив = СуммаНорматив + СНорматив;
			СуммаНаряд = СуммаНаряд + СНаряд;
			СуммаДней = СуммаДней + 1;
			
		КонецЕсли;

		ТекущийДень = ТекущийДень + 3600*24;
		
	КонецЦикла;
	
	ОбластьПодвал.Параметры.НормативСреднее = Окр(СуммаНорматив / СуммаДней);
	ОбластьПодвал.Параметры.НарядСреднее = Окр(СуммаНаряд / СуммаДней);
	ТабДок.Вывести(ОбластьПодвал);
	
КонецФункции

&НаСервере
Функция ПолучитьСписокСтрокой(СписокЗначений)
	
	Результат = "";
	
	Для каждого Элем Из СписокЗначений Цикл
		
		Результат = Результат + Элем.Значение + ";";
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
