
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		 ЗаполнитьСтатьюПоУмолчанию();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьюПоУмолчанию()
	
	Если Объект.ВидКорректировки = Перечисления.ВидКорректировкиВзаиморасчетов.СписатьСоСчетаДилера Тогда
		Объект.Статья = Справочники.СтатьиДоходовРасходов.ДоходыПрочие;
	ИначеЕсли Объект.ВидКорректировки = Перечисления.ВидКорректировкиВзаиморасчетов.НачислитьНаСчетДилера Тогда 
		Объект.Статья = Справочники.СтатьиДоходовРасходов.ПрочиеХозяйственныеРасходы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКорректировкиПриИзменении(Элемент)
	ЗаполнитьСтатьюПоУмолчанию();
КонецПроцедуры
