
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		Подразделение = ДанныеЗаполнения.Подразделение;
		Контрагент = ДанныеЗаполнения.Контрагент;
		ПоступлениеМатериаловУслуг = ДанныеЗаполнения;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Склад 							= ПоступлениеМатериаловУслуг.Склад;
	СписокМатериалов 			= ПоступлениеМатериаловУслуг.Материалы;
	СтоимостьМатериалов 		= СписокМатериалов.Итог("Сумма");
	КоличествоМатериалов 	= СписокМатериалов.Итог("Количество");
	
	Движения.Управленческий.Записывать = Истина;
	
	Для Каждого Строка из ЭтотОбъект.Номенклатура Цикл 
		
		Для Каждого Материал Из СписокМатериалов Цикл
			
			Если ЭтотОбъект.ПоКоличеству Тогда
				
				Процент = Материал.Количество / (КоличествоМатериалов * 0.01);
				
			Иначе
				
				Процент = Материал.Сумма / (СтоимостьМатериалов * 0.01);
				
			КонецЕсли;
			
			ПроводимаяСумма 				= Строка.Стоимость * 0.01 * Процент;
			Проводка 							= Движения.Управленческий.Добавить();
			Проводка.Период 				= Дата;
			Проводка.Подразделение 	= Подразделение;
			Проводка.Сумма 				= ПроводимаяСумма;
			Проводка.СчетДт 				= ПланыСчетов.Управленческий.МатериалыНаСкладе;
			
			Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] 	= Материал.Номенклатура;
			Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склады] 				= Склад;
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] 		= Контрагент;
			
			Проводка.СчетКТ 				= ПланыСчетов.Управленческий.ВзаиморасчетыСПоставщиками;
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] 		= Контрагент;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
