Перем Склад;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеМатериаловУслуг") Тогда
			Контрагент = ДанныеЗаполнения.Контрагент;
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПеремещениеМатериалов") Тогда
			Склад = ДокументОснование.СкладПолучатель;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТЗМатериалы = ПолучитьТаблицуМатериалов();
	КоличествоМатериалов = ТЗМатериалы.Итог("Количество");
	СтоимостьМатериалов = ТЗМатериалы.Итог("Стоимость");
	
	Движения.Управленческий.Записывать = Истина;
	
	Если ПоКоличеству Тогда
			
		МассивСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаДокумента, ТЗМатериалы.ВыгрузитьКолонку("Количество"));
		
	Иначе
			
		МассивСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаДокумента, ТЗМатериалы.ВыгрузитьКолонку("Стоимость"));
			
	КонецЕсли;
		
	Счетчик = 0;
	
	Для Каждого Материал Из ТЗМатериалы Цикл
		
		Проводка = Движения.Управленческий.Добавить();
		Проводка.Период = Дата;
		Проводка.Подразделение = Подразделение;
		Проводка.Сумма = МассивСумм[Счетчик];
		Проводка.СчетДт = ПланыСчетов.Управленческий.МатериалыНаСкладе;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Материал.Номенклатура;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
		
		Проводка.СчетКТ = ПланыСчетов.Управленческий.ВзаиморасчетыСПоставщиками;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуМатериалов()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Количество");
	ТЗ.Колонки.Добавить("Стоимость");
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеМатериаловУслуг") Тогда
		
		Склад = ДокументОснование.Склад;
		
		Для каждого Строка Из ДокументОснование.Материалы Цикл
			НоваяСтрока = ТЗ.Добавить();
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
			НоваяСтрока.Количество = Строка.Количество;
			НоваяСтрока.Стоимость = Строка.Сумма;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПеремещениеМатериалов") Тогда
		
		Склад = ДокументОснование.СкладПолучатель;
		
		Для каждого Строка Из ДокументОснование.СписокНоменклатуры Цикл
			НоваяСтрока = ТЗ.Добавить();
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
			НоваяСтрока.Количество = Строка.Количество;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТЗ;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПеремещениеМатериалов") Тогда
		ПоКоличеству = Истина;
	КонецЕсли;
	
	СуммаДокумента = СписокНоменклатуры.Итог("Стоимость");
	
КонецПроцедуры
