
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПечатьАктДоставкаСборка(ТабДок, Ссылка) Экспорт
	
	Перем Инженер;
	
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0";
	Спецификация = Ссылка.Спецификация;
	ДоговорСсылка = Документы.Спецификация.ПолучитьДоговор(Спецификация);
	
	Макет = Документы.Монтаж.ПолучитьМакет("АктДоставкаСборка");
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Дата,
	|	Монтаж.Спецификация,
	|	Монтаж.Номер,
	|	Монтаж.Подразделение,
	|	Монтаж.Экспедитор,
	|	Монтаж.Подразделение.Организация.ПолноеНаименование КАК ПолноеНаименование,
	|	Монтаж.Монтажник,
	|	Монтаж.Спецификация.Автор КАК Инженер,
	|	Договор.Контрагент КАК ФИОКлиента,
	|	Договор.Офис КАК АдресОфиса,
	|	Договор.Автор КАК Дизайнер,
	|	Договор.Дата КАК ДатаДоговора,
	|	Договор.Номер КАК НомерДоговора,
	|	Договор.СуммаДокумента КАК СуммаДокумента,
	|	Монтаж.Спецификация.Изделие КАК Изделие,
	|	Договор.Спецификация.АдресМонтажа КАК АдресМонтажа,
	|	Договор.Контрагент.Телефон КАК Телефон,
	|	Договор.Контрагент.ТелефонДополнительный КАК ТелефонДополнительный,
	|	ПРЕДСТАВЛЕНИЕ(Договор.Ссылка) КАК Договор,
	|	Монтаж.Спецификация.Номер КАК НомерСпецификации
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Договор КАК Договор
	|		ПО Монтаж.Спецификация = Договор.Спецификация
	|ГДЕ
	|	Монтаж.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	// ################
	// Доставка
	
	ОбластьТело = Макет.ПолучитьОбласть("Тело");
	
	ОбластьТело.Параметры.Заполнить(Выборка);
	ОбластьТело.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=DD");
	ОбластьТело.Параметры.ДатаДоставки = Формат(Выборка.Дата, "ДЛФ=DD");
	ТабДок.Вывести(ОбластьТело);
	
КонецПроцедуры

Процедура ПечатьГрафикМонтажа(ТабДок, Ссылка, НачалоПериода, КонецПериода, Подразделение) Экспорт
	
	Макет = Документы.Монтаж.ПолучитьМакет("ГрафикМонтажа");
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
	Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
	Запрос.Параметры.Вставить("Подразделение", Подразделение);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Монтажник КАК Монтажник,
	|	Монтаж.Ссылка КАК СсылкаНаМонтаж,
	|	Монтаж.Ссылка.Дата КАК ДатаДоставки,
	|	Монтаж.Дата КАК Дата,
	|	Монтаж.Ссылка.Спецификация.Договор.Номер КАК НомерДоговора,
	|	Монтаж.Ссылка.Спецификация.Договор.Контрагент.Телефон КАК Телефон1,
	|	Монтаж.Ссылка.Экспедитор КАК Экспедитор,
	|	Монтаж.Ссылка.Спецификация.Договор.Ссылка КАК СсылкаНаДоговор,
	|	Монтаж.Спецификация.АдресМонтажа КАК АдресМонтажа,
	|	Монтаж.Спецификация.Доставка КАК Доставка,
	|	Монтаж.Спецификация.Номер КАК НомерСпецификации,
	|	Монтаж.Спецификация.ДатаМонтажа КАК ДатаМонтажа
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Монтаж.Ссылка.Проведен
	|	И Монтаж.Ссылка.Подразделение = &Подразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.ПериодСтр = ПредставлениеПериода(НачалоПериода, КонецПериода);
	Строка = Макет.ПолучитьОбласть("Строка");
	ПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ТабДок.Очистить();
	ТабДок.Вывести(Шапка);
	
	НомерСтроки = 5;
	НачалоТекДата = 5;
	ТекДата = '0001.01.01';
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекДата) Тогда
			ТекДата = НачалоДня(Выборка.ДатаМонтажа) ;
		КонецЕсли;
		
		НомерСтроки = 1 + НомерСтроки;
		
		Если НачалоДня(ТекДата) <> НачалоДня(Выборка.ДатаМонтажа) Тогда
			
			ТабДок.Вывести(ПустаяСтрока);
			ТабДок.Вывести(ПустаяСтрока);
			НомерСтроки = 2 + НомерСтроки;
			
			Область = ТабДок.Область(НачалоТекДата, 1, НомерСтроки - 2, 1);
			Область.Объединить();
			ТекДата = НачалоДня(Выборка.ДатаМонтажа);
			НачалоТекДата = НомерСтроки - 1;
			
		КонецЕсли;
		
		Строка.Параметры.Заполнить(Выборка);
		//Если Выборка.Самовывоз Тогда
		//	Строка.Параметры.Комментарий = "Самовывоз / " + Выборка.Комментарий;
		//КонецЕсли;
		
		Строка.Параметры.Дата = Формат((Выборка.ДатаМонтажа), "ДФ = дд.ММ")+" "+Формат((Выборка.ДатаМонтажа), "ДФ = дддд");
		//Строка.Параметры.ДатаВремяДоставки = Формат((Выборка.ДатаДоставки), "ДФ = дд.МММ")
		//+Символы.ПС+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1:00-%2:00", Выборка.ВремяДоставкиНачало, Выборка.ВремяДоставкиКонец);
		
		Строка.Параметры.Телефоны = Выборка.Телефон1;// + Символы.ПС + Выборка.Телефон2;
		ТабДок.Вывести(Строка);
		
	КонецЦикла;
	
	ТабДок.Вывести(ПустаяСтрока);
	ТабДок.Вывести(ПустаяСтрока);
	НомерСтроки = 2 + НомерСтроки;
	
	Область = ТабДок.Область(НачалоТекДата, 1, НомерСтроки - 1, 1);
	Область.Объединить();
	
КонецПроцедуры

Функция ПолучитьПоДоговору(ДоговорСсылка) Экспорт
	
	Результат = Документы.Монтаж.ПустаяСсылка();
	
	МассивМонтаж = ЛексСервер.НайтиПодчиненныеДокументы(ДоговорСсылка, "Документ.Монтаж", "Договор");
	Количество = МассивМонтаж.Количество();
	
	Если Количество = 0 Тогда
		Результат = Документы.Монтаж.ПустаяСсылка();
	ИначеЕсли Количество = 1 Тогда
		Результат = МассивМонтаж[0];
	ИначеЕсли Количество > 1 Тогда
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Ошибка! С %1 связано несколько Графиков монтажа. Сообщите администратору номер договора", ДоговорСсылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ДоговорСсылка);
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьПоДоговору()
