
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПечатьАктДоставкаСборка(ТабДок, Ссылка) Экспорт
	
	Перем Инженер;
	
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0";
	Спецификация = Ссылка.Спецификация;
	ДоговорСсылка = Документы.Спецификация.ПолучитьДоговор(Спецификация);
	
	Макет = Документы.Монтаж.ПолучитьМакет("АктДоставкаСборка");
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Дата,
	|	Монтаж.Спецификация,
	|	Монтаж.Номер,
	|	Монтаж.Подразделение,
	|	Монтаж.Экспедитор,
	|	Монтаж.Подразделение.Организация.ПолноеНаименование КАК ПолноеНаименование,
	|	Монтаж.Монтажник,
	|	Монтаж.Спецификация.Автор КАК Инженер,
	|	Договор.Контрагент КАК ФИОКлиента,
	|	Договор.Офис КАК АдресОфиса,
	|	Договор.Автор КАК Дизайнер,
	|	Договор.Дата КАК ДатаДоговора,
	|	Договор.Номер КАК НомерДоговора,
	|	Договор.СуммаДокумента КАК СуммаДокумента,
	|	Монтаж.Спецификация.Изделие КАК Изделие,
	|	Договор.Спецификация.АдресМонтажа КАК АдресМонтажа,
	|	Договор.Контрагент.Телефон КАК Телефон,
	|	Договор.Контрагент.ТелефонДополнительный КАК ТелефонДополнительный,
	|	ПРЕДСТАВЛЕНИЕ(Договор.Ссылка) КАК Договор,
	|	Монтаж.Спецификация.Номер КАК НомерСпецификации,
	|	Договор.Спецификация.КоличествоМетровЛДСП КАК КоличествоМетровЛДСП
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Договор КАК Договор
	|		ПО Монтаж.Спецификация = Договор.Спецификация
	|ГДЕ
	|	Монтаж.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	// ################
	// Доставка
	
	ОбластьТело = Макет.ПолучитьОбласть("Тело");
	
	ОбластьТело.Параметры.Заполнить(Выборка);
	ОбластьТело.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=DD");
	ОбластьТело.Параметры.ДатаДоставки = Формат(Выборка.Дата, "ДЛФ=DD");
	ТабДок.Вывести(ОбластьТело);
	
КонецПроцедуры

Функция ПолучитьПоДоговору(ДоговорСсылка) Экспорт
	
	Результат = Документы.Монтаж.ПустаяСсылка();
	
	МассивМонтаж = ЛексСервер.НайтиПодчиненныеДокументы(ДоговорСсылка, "Документ.Монтаж", "Договор");
	Количество = МассивМонтаж.Количество();
	
	Если Количество = 0 Тогда
		Результат = Документы.Монтаж.ПустаяСсылка();
	ИначеЕсли Количество = 1 Тогда
		Результат = МассивМонтаж[0];
	ИначеЕсли Количество > 1 Тогда
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Ошибка! С %1 связано несколько Графиков монтажа. Сообщите администратору номер договора", ДоговорСсылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ДоговорСсылка);
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьПоДоговору()
