
Процедура ОбработкаПроведения(Отказ, Режим)
	
	РеквизитыСпецификации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Спецификация, "ПакетУслуг, Контрагент, Изделие");
	
//	Если РеквизитыСпецификации.ПакетУслуг = Перечисления.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж И ПервыйМонтаж(РеквизитыСпецификации.Контрагент) Тогда
	Если РеквизитыСпецификации.ПакетУслуг = Перечисления.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж Тогда
		
		УменьшитьМонтажников(ДатаМонтажа);
		
		Если РеквизитыСпецификации.Изделие.ВидИзделия = Перечисления.ВидыИзделий.Кухня Тогда
			УменьшитьМонтажников(ДатаМонтажа + 86400);
		КонецЕсли;
		
	КонецЕсли;
	
	Движения.СвободныеМонтажники.Записывать = Истина;
	
КонецПроцедуры

Функция УменьшитьМонтажников(Период)
	
	Запись = Движения.СвободныеМонтажники.Добавить();
	Запись.Город = Спецификация.Офис.Город;
	Запись.Период = Период;
	Запись.КоличествоМонтажей = 1;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПакетУслуг = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спецификация, "ПакетУслуг");
	
	Если ПакетУслуг <> Перечисления.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж Тогда
		
		Если ЗначениеЗаполнено(Монтажник) Тогда
			
			Отказ = Истина;
			ТекстСообщения = "Спецификация к договору без монтажа. Уберите монтажника";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Монтажник");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	МонтажСсылка= Документы.Спецификация.ПолучитьМонтаж(Спецификация);
	
	Если ЗначениеЗаполнено(МонтажСсылка) И Ссылка <> МонтажСсылка Тогда
		Отказ = Истина;
		ТекстСообщения = "К " + Ссылка + " уже введен " + МонтажСсылка;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, МонтажСсылка);
	КонецЕсли;

КонецПроцедуры
