
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Режим = РежимПроведенияДокумента.Неоперативный;
	
	Движения.Управленческий.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписок Из Список Цикл
		
		Если ТекСтрокаСписок.Доход > 0 Тогда
			
			Движение = Движения.Управленческий.Добавить();
			Движение.Период = КонецМесяца(Дата);
			Движение.Подразделение = Подразделение;
			
			Движение.СчетКт = ПланыСчетов.Управленческий.ФинансовыйРезультат;
			
			Движение.СчетДт = ПланыСчетов.Управленческий.Доходы;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = ТекСтрокаСписок.Статья;
			
			Движение.Сумма =  ТекСтрокаСписок.Доход;
			
		КонецЕсли;
		
		Если ТекСтрокаСписок.Расход > 0 Тогда
			
			Движение = Движения.Управленческий.Добавить();
			Движение.Период = КонецМесяца(Дата);
			Движение.Подразделение = Подразделение;
			
			Движение.СчетКт = ПланыСчетов.Управленческий.Расходы;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = ТекСтрокаСписок.Статья;
			
			Движение.СчетДт = ПланыСчетов.Управленческий.ФинансовыйРезультат;
			
			Движение.Сумма = ТекСтрокаСписок.Расход;
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		
		Дата = КонецМесяца(ТекущаяДата());
		
	КонецЕсли;
	
КонецПроцедуры
