Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Управленческий.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписок Из Список Цикл
		
		Если ЗначениеЗаполнено(ТекСтрокаСписок.Статья) Тогда
			
			Движение = Движения.Управленческий.Добавить();
			
			Если ТекСтрокаСписок.Доход > 0 Тогда
			
				   Движение.СчетДт = ПланыСчетов.Управленческий.ФинансовыйРезультат;
				   
				   Движение.СчетКт = ПланыСчетов.Управленческий.Доходы;
				   Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = ТекСтрокаСписок.Статья;

				   Движение.Сумма =  ТекСтрокаСписок.Доход;

			Иначе			   
				   Движение.СчетДт = ПланыСчетов.Управленческий.Расходы;
				   Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = ТекСтрокаСписок.Статья;
				   
				   Движение.СчетКт = ПланыСчетов.Управленческий.ФинансовыйРезультат;
				   
				   Движение.Сумма =  ТекСтрокаСписок.Расход;	
				
			КонецЕсли; 

			Движение.Период = КонецМесяца(Период);
			Движение.Подразделение = Подразделение;
			
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры
