
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Управленческий.Записывать = Истина;
	
	Движение = Движения.Управленческий.Добавить();
	Движение.Период = Дата;
	Движение.Подразделение = Подразделение;
	
	Движение.СчетКт = ПланыСчетов.Управленческий.ФинансовыйРезультат;
	Движение.СчетДт = ПланыСчетов.Управленческий.Доходы;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = Справочники.СтатьиДоходовРасходов.ЗакрытиеДоходовНаФинРезультат;
	
	Движение.Сумма = СуммаДоходов;
	
	Движение = Движения.Управленческий.Добавить();
	Движение.Период = Дата;
	Движение.Подразделение = Подразделение;
	
	Движение.СчетКт = ПланыСчетов.Управленческий.Расходы;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = Справочники.СтатьиДоходовРасходов.ЗакрытиеРасходовНаФинРезультат;
	Движение.СчетДт = ПланыСчетов.Управленческий.ФинансовыйРезультат;
	
	Движение.Сумма = СуммаРасходов;
	
	//Для Каждого ТекСтрокаСписок Из Список Цикл
	//	
	//	Если ТекСтрокаСписок.Доход > 0 Тогда
	//		
	//		Движение = Движения.Управленческий.Добавить();
	//		Движение.Период = КонецМесяца(Дата);
	//		Движение.Подразделение = Подразделение;
	//		
	//		Движение.СчетКт = ПланыСчетов.Управленческий.ФинансовыйРезультат;
	//		
	//		Движение.СчетДт = ПланыСчетов.Управленческий.Доходы;
	//		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = ТекСтрокаСписок.Статья;
	//		
	//		Движение.Сумма = ТекСтрокаСписок.Доход;
	//		
	//	КонецЕсли;
	//	
	//	Если ТекСтрокаСписок.Расход > 0 Тогда
	//		
	//		Движение = Движения.Управленческий.Добавить();
	//		Движение.Период = КонецМесяца(Дата);
	//		Движение.Подразделение = Подразделение;
	//		
	//		Движение.СчетКт = ПланыСчетов.Управленческий.Расходы;
	//		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = ТекСтрокаСписок.Статья;
	//		
	//		Движение.СчетДт = ПланыСчетов.Управленческий.ФинансовыйРезультат;
	//		
	//		Движение.Сумма = ТекСтрокаСписок.Расход;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Дата", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗакрытиеМесяца.Ссылка
	|ИЗ
	|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
	|ГДЕ
	|	ЗакрытиеМесяца.Подразделение = &Подразделение
	|	И ЗакрытиеМесяца.Дата = &Дата
	|	И НЕ ЗакрытиеМесяца.Ссылка = &Ссылка";
	
	Отказ = НЕ Запрос.Выполнить().Пустой();
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		
		Дата = КонецМесяца(ТекущаяДата());
		
	КонецЕсли;
	
КонецПроцедуры
