
&НаКлиенте
Процедура АдресНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыАдреса = Новый Структура;
	ПараметрыАдреса.Вставить("АдресТолькоРоссийский", Истина);
	Если Объект.Адрес = "Введите адрес" Тогда
		ЗначенияПолей = "";
		Представление = "";
	Иначе
		ЗначенияПолей = УправлениеКонтактнойИнформациейКлиентСервер.ПреобразоватьСтрокуВСписокПолей(Объект.ЗначениеПоляАдрес);
		Представление = Объект.Адрес;
	КонецЕсли;
	ПараметрыАдреса.Вставить("ЗначенияПолей", ЗначенияПолей);
	ПараметрыАдреса.Вставить("Представление", Представление);
	СтруктураАдреса = ОткрытьФормуМодально("ОбщаяФорма.ВводАдреса", ПараметрыАдреса, ЭтаФорма);
	Если ТипЗнч(СтруктураАдреса) = Тип("Структура") Тогда
		Объект.Адрес = СтруктураАдреса.Представление;
		Объект.ЗначениеПоляАдрес = УправлениеКонтактнойИнформациейКлиентСервер.ПреобразоватьСписокПолейВСтроку(СтруктураАдреса.ЗначенияПолей);
	КонецЕсли;

КонецПроцедуры
