
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбАвтор = Объект.Автор;
	
	Если ОбАвтор = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда	
		ОбАвтор=ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОзнакомлен()
	
	Озн=Ложь;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сообщение", Объект.Ссылка);
	Запрос.УстановитьПараметр("Дилер", ПользователиКлиентСервер.ТекущийВнешнийПользователь());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОзнакомленСообщенияДилеру.Ознакомлен
	|ИЗ
	|	РегистрСведений.ОзнакомленСообщенияДилеру КАК ОзнакомленСообщенияДилеру
	|ГДЕ
	|	ОзнакомленСообщенияДилеру.Сообщение = &Сообщение
	|	И ОзнакомленСообщенияДилеру.Дилер = &Дилер";
	
	ВыборкаОзнакомлен = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаОзнакомлен.Количество()>0 Тогда
		Озн=Истина;
	КонецЕсли; 
	
	Возврат Озн;

КонецФункции

&НаСервере
Процедура ЗаписатьОзнакомлен()

	НоваяЗапись = РегистрыСведений.ОзнакомленСообщенияДилеру.СоздатьМенеджерЗаписи();
	НоваяЗапись.Сообщение = Объект.Ссылка;
	НоваяЗапись.Дилер = ПользователиКлиентСервер.ТекущийВнешнийПользователь();
	НоваяЗапись.Ознакомлен = Истина;
	НоваяЗапись.Записать();

КонецПроцедуры
 

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ознакомлен=ПолучитьОзнакомлен();
	Если Ознакомлен=Истина Тогда
		Элементы.Ознакомлен.Доступность=Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если Элементы.Ознакомлен.Доступность=Истина И Ознакомлен=Истина Тогда
		ЗаписатьОзнакомлен();
		Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("УправляемаяФорма") Тогда
			Оповестить("ОбновитьСписок",Объект.Ссылка);
			//ЭтаФорма.ВладелецФормы.УдалитьЭлемент(Объект.Ссылка);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры
