
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЕстьДоставка(ПараметрКоманды) Тогда
		
		ТабДок = Новый ТабличныйДокумент;
		ПечатьАктДоставкаСборка(ТабДок, ПараметрКоманды);
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Защита = Ложь;
		ТабДок.ТолькоПросмотр = Ложь;
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.Показать("Акт доставки сборки");
		
	Иначе
		
		ТекстСообщения = "Запрещено распечатывать Акт доставки без услуги доставки до клиента";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ПараметрКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПечатьАктДоставкаСборка(ТабДок, ПараметрКоманды)
	
	Документы.Спецификация.ПечатьАктДоставкаСборка(ТабДок, ПараметрКоманды);
	
КонецПроцедуры

&НаСервере
Функция ЕстьДоставка(Спецификация)
	
	ПакетУслуг = Спецификация.ПакетУслуг;
	Ответ = ПакетУслуг = Перечисления.ПакетыУслуг.ДоставкаДоКлиента ИЛИ ПакетУслуг = Перечисления.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж;
	
	Возврат Ответ;
	
КонецФункции // ПроверитьРасчетИнженера()


