
&НаКлиенте
Процедура Применить(Команда)
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		ОповеститьОВыборе(Значение);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Значение = 11;
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	Значение = 12;
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	Значение = 13;
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Команда5(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Команда6(Команда)
	Значение = 21;
КонецПроцедуры

&НаКлиенте
Процедура Команда7(Команда)
	Значение = 22;
КонецПроцедуры

&НаКлиенте
Процедура Команда8(Команда)
	Значение = 23;
КонецПроцедуры
