
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтеклянныеФасады") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасположениеПазовИРучкиНаФасадах.ИмяКартинки
		|ИЗ
		|	Справочник.РасположениеПазовИРучкиНаФасадах КАК РасположениеПазовИРучкиНаФасадах
		|ГДЕ
		|	НЕ РасположениеПазовИРучкиНаФасадах.ИспользуетсяВСтеклянныхФасадах";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИмяКартинки) Тогда
				
				Элементы[ВыборкаДетальныеЗаписи.ИмяКартинки].Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПазовНетРучкаВертикальноВЦентре(Команда)
	
	ОтправитьНазвание("ПазовНетРучкаВертикальноВЦентре");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазовНетРучкаВертикальноПоЦентруСверху(Команда)
	
	ОтправитьНазвание("ПазовНетРучкаВертикальноПоЦентруСверху");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазовНетРучкаВертикальноПоЦентруСнизу(Команда)
	
	ОтправитьНазвание("ПазовНетРучкаВертикальноПоЦентруСнизу");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазовНетРучкаГоризонтальноВЦентре(Команда)
	
	ОтправитьНазвание("ПазовНетРучкаГоризонтальноВЦентре");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазовНетРучкаГоризонтальноПоЦентруСверху(Команда)
	
	ОтправитьНазвание("ПазовНетРучкаГоризонтальноПоЦентруСверху");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазовНетРучкаГоризонтальноПоЦентруСнизу(Команда)
	
	ОтправитьНазвание("ПазовНетРучкаГоризонтальноПоЦентруСнизу");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСверзуРучкаГоризонтальноПоЦентруСнизу(Команда)
	
	ОтправитьНазвание("ПазыСверзуРучкаГоризонтальноПоЦентруСнизу");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСверзуРучкаОтсутствует(Команда)
	
	ОтправитьНазвание("ПазыСверзуРучкаОтсутствует");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаГоризонтальноПоЦентруСнизу(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаГоризонтальноПоЦентруСнизу");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаВертикальноСправаПоЦентру(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаВертикальноСправаПоЦентру");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаВертикальноСправаСверху(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаВертикальноСправаСверху");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаВертикальноСправаСнизу(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаВертикальноСправаСнизу");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаГоризонтальноПоЦентруСверху(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаГоризонтальноПоЦентруСверху");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаГоризонтальноСправаПоЦентру(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаГоризонтальноСправаПоЦентру");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаГоризонтальноСправаСверху(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаГоризонтальноСправаСверху");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаГоризонтальноСправаСнизу(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаГоризонтальноСправаСнизу");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаОтсутствует(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаОтсутствует");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНазвание(Имя)
	
	ОповеститьОВыборе(Имя);
	
КонецПроцедуры
