
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ИмяКартинки = Элементы.Список.ТекущиеДанные.ИмяКартинки;
	ЭтаФорма.АдресКартинки = БиблиотекаКартинок[ИмяКартинки];
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.ИмяКартинки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтеклянныеФасады") Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИспользуетсяВСтеклянныхФасадах");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Истина;
		ЭлементОтбора.Использование = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
