
&НаКлиенте
Процедура Заполнить(Команда)
	
	Объект.СеткаОстатков.Очистить();
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(Открытие = Ложь, НужноеЗначение = Ложь)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	Макет = Справочники.СеткаОстатков.ПолучитьМакет("Макет");
	ОбластьЯчейка = Макет.ПолучитьОбласть("Ячейка");
	ОбластьЦифра = Макет.ПолучитьОбласть("Цифра");
	ШиринаТаблицы = 0;
	ВысотаТаблицы = 0; //?(Объект.Шаг > 0, Объект.Шаг, 100);
	
	ОбластьЦифра.Параметры.Цифра = ШиринаТаблицы;
	ТабДок.Присоединить(ОбластьЦифра);
	
	Пока ШиринаТаблицы <= Объект.МаксимальнаяШирина Цикл
		
		ОбластьЦифра.Параметры.Цифра = ШиринаТаблицы;
		ТабДок.Присоединить(ОбластьЦифра);
		ШиринаТаблицы = ШиринаТаблицы + ?(Объект.Шаг > 0, Объект.Шаг, 100);
		
	КонецЦикла;
		
	Пока ВысотаТаблицы <= Объект.МаксимальнаяВысота Цикл
		
		ШиринаТаблицы = 0; //?(Объект.Шаг > 0, Объект.Шаг, 100);
		ОбластьЦифра.Параметры.Цифра = ВысотаТаблицы;
		ТабДок.Вывести(ОбластьЦифра);
		
		Пока ШиринаТаблицы <= Объект.МаксимальнаяШирина Цикл
			
			Структура = Новый Структура;
			Структура.Вставить("Высота", ВысотаТаблицы);
			Структура.Вставить("Ширина", ШиринаТаблицы);
			
			Если Открытие Тогда
				
				Отбор = Новый Структура;
				Отбор.Вставить("Высота", ВысотаТаблицы);
				Отбор.Вставить("Ширина", ШиринаТаблицы);
				Строка = Объект.СеткаОстатков.НайтиСтроки(Отбор);
				
				Если Строка.Количество() > 0 Тогда
					
					Структура.Вставить("Заполненность", Строка[0].Значение);
					
				КонецЕсли;
				
			Иначе
				
				Структура.Вставить("Заполненность", НужноеЗначение);
				
				НоваяСтрока = Объект.СеткаОстатков.Добавить();
				НоваяСтрока.Высота = ВысотаТаблицы; // - ?(Объект.Шаг > 0, Объект.Шаг, 100);
				НоваяСтрока.Ширина = ШиринаТаблицы; // - ?(Объект.Шаг > 0, Объект.Шаг, 100);
				НоваяСтрока.Значение = НужноеЗначение;
				
			КонецЕсли;
			
			Если Структура.Свойство("Заполненность") Тогда
				ОбластьЯчейка.Параметры.Заполненность = Структура.Заполненность;
				ОбластьЯчейка.Параметры.Расшифровка = Структура;
			КонецЕсли;
			ТабДок.Присоединить(ОбластьЯчейка);
			ШиринаТаблицы = ШиринаТаблицы + ?(Объект.Шаг > 0, Объект.Шаг, 100);
			
		КонецЦикла;
		
		ВысотаТаблицы = ВысотаТаблицы + ?(Объект.Шаг > 0, Объект.Шаг, 100);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокВыбор(Элемент, Область, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для Индекс1 = Область.Лево По Область.Право Цикл 
		Для Индекс2 = Область.Верх По Область.Низ Цикл 
			ВыделеннаяОбласть = ТабДок.Область(Индекс2, Индекс1, Индекс2, Индекс1); 
			ВыделеннаяОбласть.Текст = ?(ВыделеннаяОбласть.Текст = "Х", " ", "Х");
			Отбор = Новый Структура;
			Отбор.Вставить("Высота", ВыделеннаяОбласть.Расшифровка.Высота);
			Отбор.Вставить("Ширина", ВыделеннаяОбласть.Расшифровка.Ширина);
			Строка = Объект.СеткаОстатков.НайтиСтроки(Отбор);
			Если Строка.Количество() > 0 Тогда
				НовоеЗначение = НЕ ВыделеннаяОбласть.Расшифровка.Заполненность;
				Строка[0].Значение = НовоеЗначение;
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если НЕ Объект.Ссылка = Справочники.СеткаОстатков.ПустаяСсылка() Тогда
		
		ЗаполнитьНаСервере(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Объект.СеткаОстатков.Очистить();
	Модифицированность = Истина;
	ЗаполнитьНаСервере(, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	Объект.СеткаОстатков.Очистить();
	Модифицированность = Истина;
	ЗаполнитьНаСервере();
	
КонецПроцедуры
