
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Номенклатура.СписокВыбора.ЗагрузитьЗначения(Параметры.СписокНоменклатуры);
	Подразделение = Параметры.Подразделение;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Элементы.СменяющаяНоменклатура.СписокВыбора.ЗагрузитьЗначения(ПолучитьсяСписокноменклатуры(ВыбранноеЗначение, Подразделение));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьсяСписокноменклатуры(Номенклатура, Подразделение)
	
	СписокНоменклатурныхГрупп 	= Новый СписокЗначений;
	НоменклатурнаяГруппа 			= Номенклатура.НоменклатурнаяГруппа;
	ИмяГруппы 							= Справочники.НоменклатурныеГруппы.ПолучитьИмяПредопределенного(НоменклатурнаяГруппа);
	СписокНоменклатурныхГрупп.Добавить(Номенклатура.НоменклатурнаяГруппа);
	СтруктураНоменклатуры 			= ЛексСервер.ОтборНоменклатурныхГрупп(СписокНоменклатурныхГрупп, Подразделение);
	Возврат СтруктураНоменклатуры[ИмяГруппы];
	
КонецФункции // ПолучитьсяСписокноменклатуры()

&НаКлиенте
Процедура ПровестиЗамену(Команда)
	
	Режим 	= РежимДиалогаВопрос.ОКОтмена;
	Текст 	= "Вы уверены, что хотите завершить замену цвета номенклатуры?";
	Ответ 	= Вопрос(Текст, Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		
		СтруктураНоменклатур = Новый Структура;
		СтруктураНоменклатур.Вставить("СтараяНоменклатура", Номенклатура);
		СтруктураНоменклатур.Вставить("НоваяНоменклатура", СменяющаяНоменклатура);
		ОповеститьОВыборе(СтруктураНоменклатур);
		
	КонецЕсли;
	
КонецПроцедуры
