////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дополнительные отчеты и обработки"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Проверяет, является ли переданное имя формы основной формой объекта метаданных,
// полное имя которого передается в параметре ПолноеИмяОбъектаМетаданных
// Параметры
//  ПолноеИмяОбъектаМетаданных - строка - полное имя объекта метаданных
//  ИмяФормы - полное имя формы
// Возвращаемое значение
//  Истина, если форма является основной формой объекта метаданных, иначе Ложь
//
Функция ЭтоФормаОбъекта(ПолноеИмяОбъектаМетаданных, ИмяФормы) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	
	Если ОбъектМетаданных.ОсновнаяФормаОбъекта = Неопределено Тогда
		Если Метаданные.Константы.Содержит(ОбъектМетаданных)
			ИЛИ Метаданные.Отчеты.Содержит(ОбъектМетаданных)
			ИЛИ Метаданные.Обработки.Содержит(ОбъектМетаданных) Тогда
			Суффикс = ".Форма";
		Иначе
			Суффикс = ".ФормаОбъекта";
		КонецЕсли;
		Если Прав(ИмяФормы, СтрДлина(Суффикс)) = Суффикс Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ОбъектМетаданных.ОсновнаяФормаОбъекта.ПолноеИмя() = ИмяФормы Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

