Перем СуммаНач,СуммаКон,СуммаДт,СуммаКт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Счет=Параметры.Счет;
	Подразделение=Параметры.Подразделение;
	НачалоПериода=Параметры.НачалоПериода;
	КонецПериода=Параметры.КонецПериода;
	
КонецПроцедуры

&НаСервере
Функция СформироватьТабличныйДокумент()
	
	СуммаНач = 0;
	СуммаКон = 0;
	СуммаДт = 0;
	СуммаКт = 0;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДок.Защита = Истина;
	
	Макет = Отчеты.АктивПодразделения.ПолучитьМакет("МакетАктивРасшифровка");
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблШапка.АвтоМасштаб = Истина;
	ОблСтрока = Макет.ПолучитьОбласть("Строка");
	ОблСтрока2 = Макет.ПолучитьОбласть("Строка2");
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ВидСубконто = "";
	
	Для каждого Вид Из Счет.ВидыСубконто Цикл
		ВидСубконто=ВидСубконто+Вид.ВидСубконто+Символы.ПС;
	КонецЦикла; 
	
	ОблШапка.Параметры.ПредставлениеПериода = Формат(НачалоПериода, "ДЛФ=DD")+" - "+Формат(КонецПериода, "ДЛФ=DD");
	ОблШапка.Параметры.Подразделение = Подразделение;
	ОблШапка.Параметры.Счет = Счет;
	ОблШапка.Параметры.Субконто = ВидСубконто;
	ТабДок.Вывести(ОблШапка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", Счет);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УправленческийОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	УправленческийОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	УправленческийОстаткиИОбороты.СуммаОборотДт КАК СуммаОборотДт,
	|	УправленческийОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКт,
	|	УправленческийОстаткиИОбороты.Субконто1 КАК Субконто1,
	|	УправленческийОстаткиИОбороты.Субконто2 КАК Субконто2
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (&Счет), , Подразделение В (&Подразделение)) КАК УправленческийОстаткиИОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Субконто1
	|ИТОГИ
	|	СУММА(СуммаНачальныйОстаток),
	|	СУММА(СуммаКонечныйОстаток),
	|	СУММА(СуммаОборотДт),
	|	СУММА(СуммаОборотКт)
	|ПО
	|	Субконто1 ТОЛЬКО ИЕРАРХИЯ";
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТабДок.НачатьАвтоГруппировкуСтрок();
	
	Пока Выборка.Следующий() Цикл

		   СуммаНач = СуммаНач + Выборка.СуммаНачальныйОстаток;
		   СуммаКон = СуммаКон + Выборка.СуммаКонечныйОстаток;
		   СуммаДт = СуммаДт + Выборка.СуммаОборотДт;
		   СуммаКт = СуммаКт + Выборка.СуммаОборотКт;

		   СубКонПар1 = Неопределено;
		   СубКонПар2 = Неопределено;
		   
		   Если ЗначениеЗаполнено(Выборка.Субконто1) Тогда
			   СубКон1 = Выборка.Субконто1;
			   СубКонПар1 = Выборка.Субконто1;
		   Иначе
		       СубКон1 = Выборка.Субконто2;
			   СубКонПар2 = Выборка.Субконто2
		   КонецЕсли;
		   
		   Если НЕ (Выборка.СуммаОборотДт = 0 И Выборка.СуммаОборотКт = 0) Тогда
		   	   СЗ = Новый СписокЗначений;
			   СЗ.Добавить(СубКонПар1);
			   СЗ.Добавить(СубКонПар2);
			   
			   ОблСтрока.Параметры.РасПарам = СЗ;
		   Иначе
			   ОблСтрока.Параметры.РасПарам = Неопределено;
		   КонецЕсли; 
   
		   ОблСтрока.Параметры.Субконто = СубКон1;
		   ОблСтрока.Параметры.НачальныйОстаток = Выборка.СуммаНачальныйОстаток;
		   ОблСтрока.Параметры.Приход = Выборка.СуммаОборотДт;
		   ОблСтрока.Параметры.Расход = Выборка.СуммаОборотКт;
		   ОблСтрока.Параметры.КонечныйОстаток = Выборка.СуммаКонечныйОстаток;

		   ТабДок.Вывести(ОблСтрока,0);
		   
		   Выборка2=Выборка.Выбрать();
		   
		   Пока Выборка2.Следующий() Цикл
			   
		   	   Если ЗначениеЗаполнено(Выборка2.Субконто2) Тогда
				   СубКон2 = Выборка2.Субконто2;
				   СубКонПар2 = Выборка2.Субконто2;	
			   Иначе
				   СубКон2 = Выборка2.Субконто1;
				   СубКонПар1 = Выборка2.Субконто1;
			   КонецЕсли; 
			   		   
			   Если НЕ (Выборка2.СуммаОборотДт = 0 И Выборка2.СуммаОборотКт = 0) Тогда

				   СЗ = Новый СписокЗначений;
				   СЗ.Добавить(СубКонПар1);
				   СЗ.Добавить(СубКонПар2);
				   
				   ОблСтрока2.Параметры.РасПарам = СЗ;
			   Иначе
				   ОблСтрока2.Параметры.РасПарам = Неопределено;
			   КонецЕсли; 

			   ОблСтрока2.Параметры.Субконто = СубКон2;
			   ОблСтрока2.Параметры.НачальныйОстаток = Выборка2.СуммаНачальныйОстаток;
			   ОблСтрока2.Параметры.Приход = Выборка2.СуммаОборотДт;
			   ОблСтрока2.Параметры.Расход = Выборка2.СуммаОборотКт;
			   ОблСтрока2.Параметры.КонечныйОстаток = Выборка2.СуммаКонечныйОстаток;
			   
			   ТабДок.Вывести(ОблСтрока2,1);

		   КонецЦикла;

	 КонецЦикла;
	   
	 ТабДок.ЗакончитьАвтогруппировкуСтрок();  
	 
	 ОблПодвал.Параметры.НачальныйОстаток = Формат(СуммаНач, "ЧДЦ=2");
	 ОблПодвал.Параметры.Приход = Формат(СуммаДт, "ЧДЦ=2");
	 ОблПодвал.Параметры.Расход = Формат(СуммаКт, "ЧДЦ=2");
	 ОблПодвал.Параметры.КонечныйОстаток = Формат(СуммаКон, "ЧДЦ=2");
	 ТабДок.Вывести(ОблПодвал);
	 	
	Возврат ТабДок;	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТабличныйДокумент = СформироватьТабличныйДокумент();
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(0);
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)
	ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(10);
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ПараметрыРасшифровки = Новый Структура();
	ПараметрыРасшифровки.Вставить("СЗСубконто",Расшифровка);
	ПараметрыРасшифровки.Вставить("Счет",Счет);
	ПараметрыРасшифровки.Вставить("Подразделение",Подразделение);
	ПараметрыРасшифровки.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыРасшифровки.Вставить("КонецПериода",КонецПериода);
	
	
	ОткрытьФорму("Отчет.АктивПодразделения.Форма.ФормаРасшифровкиДокумент", ПараметрыРасшифровки, ЭтаФорма);
	
КонецПроцедуры


