
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// { Васильев Александр Леонидович [30.05.2015]
	// Сделать.
	// Сгруппировать материалы.
	// } Васильев Александр Леонидович [30.05.2015]
	
	Для каждого Строка Из СписокНоменклатуры Цикл
		
		Движение = Движения.РезервныйЗапасМатериалов.Добавить();
		Движение.Период = НачалоДня(Дата);
		Движение.Подразделение = Подразделение;
		Движение.Склад = Склад;
		Движение.Номенклатура = Строка.Номенклатура;
		Движение.Количество = Строка.Количество;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры
