
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ГородВладелец) Тогда
		
		Если Параметры.ГородВладелец.Наименование = "Хабаровск" Тогда 
			
			НужныйКод = 27;
			
		Иначе
			
			НужныйКод = 28;
			
		КонецЕсли;
		
		СписокНаселенныхПунктов.Параметры.УстановитьЗначениеПараметра("Код", НужныйКод);
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	СохранитьВыбор();
	
КонецПроцедуры

&НаКлиенте
Функция СохранитьВыбор()

	СтруктураНаселенногоПункта = Новый Структура;
	СтруктураНаселенногоПункта.Вставить("Наименование",Элементы.СписокНаселенныхПунктов.ТекущиеДанные.Наименование);
	СтруктураНаселенногоПункта.Вставить("КодАдресногоОбъектаВКоде", Элементы.СписокНаселенныхПунктов.ТекущиеДанные.КодАдресногоОбъектаВКоде);
	СтруктураНаселенногоПункта.Вставить("КодГородаВКоде", Элементы.СписокНаселенныхПунктов.ТекущиеДанные.КодГородаВКоде);
	СтруктураНаселенногоПункта.Вставить("КодНаселенногоПунктаВКоде", Элементы.СписокНаселенныхПунктов.ТекущиеДанные.КодНаселенногоПунктаВКоде);
	СтруктураНаселенногоПункта.Вставить("КодРайонаВКоде", Элементы.СписокНаселенныхПунктов.ТекущиеДанные.КодРайонаВКоде);
	Закрыть(СтруктураНаселенногоПункта);

КонецФункции // СохранитьВыбор()

&НаКлиенте
Процедура СписокНаселенныхПунктовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СохранитьВыбор();
	
КонецПроцедуры
