
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Подразделение", Подразделение);
	ПараметрыОтчета.Вставить("ПериодОтчета", ПериодОтчета);
	ПараметрыОтчета.Вставить("Ответственный", Ответственный);
	
	ТабДок = Отчеты.ОтчетПоВстречам.СформироватьОтчет(ПараметрыОтчета);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	СвойствоПодразделение = ПланыВидовХарактеристик.НастройкиПользователей.Подразделение;
	Отбор = Новый Структура("Пользователь, Настройка", Пользователь , СвойствоПодразделение);
	
	Подразделение = РегистрыСведений.НастройкиПользователей.Получить(Отбор).Значение;
	
	ПериодОтчета = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтаНеделя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда	
		Если Расшифровка.Ссылка <> Неопределено Тогда	
			ОткрытьЗначение(Расшифровка.Ссылка);	
		Иначе                         
			ПараметрыФормы = Новый Структура("Время, Подразделение, Ответственный", Расшифровка.Время, Расшифровка.Подразделение, Расшифровка.Ответственный);
			ОткрытьФорму("Документ.ВстречаСКлиентом.ФормаОбъекта", ПараметрыФормы);	
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры
