
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Ошибки = Неопределено;
	СуммаВыплат = 0;
	СуммаПоступлений = 0;
	
	Для каждого Строка Из ТекущийОбъект.ОбластиРаспеределения Цикл
		
		СуммаВыплат = СуммаВыплат + Строка.СуммаВыплаты;
		СуммаПоступлений = СуммаПоступлений + Строка.СуммаПоступления;
		
		Если Строка.Статья.ВидСтатьи = Перечисления.ВидыСтатейДДС.Поступление и ЗначениеЗаполнено(Строка.СуммаВыплаты) Тогда
		
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ОбластиРаспеределения["+ (Строка.НомерСтроки-1)+"].СуммаВыплаты", "Сумма выплаты должна быть пустой, если статья вида ""Поступление""");
		
		ИначеЕсли Строка.Статья.ВидСтатьи = Перечисления.ВидыСтатейДДС.Выплата и ЗначениеЗаполнено(Строка.СуммаПоступления) Тогда
		
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ОбластиРаспеределения["+ (Строка.НомерСтроки-1)+"].СуммаПоступления", "Сумма поступления должна быть пустой, если статья вида ""Выплата""");
		
		КонецЕсли;
	
	КонецЦикла;
	
	ТекущийОбъект.СуммаПоступлений = СуммаПоступлений;
	ТекущийОбъект.СуммаВыплат = СуммаВыплат;
	ТекущийОбъект.СуммаДокумента = СуммаПоступлений - СуммаВыплат;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры
