////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

&НаКлиенте
Перем ТекДанныеСтроки;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруИзделия(Изделие, Подразделение) 
	
	Структура = Новый Структура;
	Структура.Вставить("Код", Изделие.Код);	
	Структура.Вставить("ГлубинаИзделия", Изделие.ГлубинаИзделия);                           
	Структура.Вставить("ШиринаИзделия", Изделие.ШиринаИзделия);                           
	Структура.Вставить("ВысотаИзделия", Изделие.ВысотаИзделия);                           
	Структура.Вставить("ГлубинаИзделияМин", Изделие.ГлубинаИзделияМин);                           
	Структура.Вставить("ШиринаИзделияМин", Изделие.ШиринаИзделияМин);                           
	Структура.Вставить("ВысотаИзделияМин", Изделие.ВысотаИзделияМин);                            
	Структура.Вставить("ГлубинаИзделияМакс", Изделие.ГлубинаИзделияМакс);                            
	Структура.Вставить("ШиринаИзделияМакс", Изделие.ШиринаИзделияМакс);                           
	Структура.Вставить("ВысотаИзделияМакс", Изделие.ВысотаИзделияМакс);
	Структура.Вставить("Шаг", Изделие.Шаг);
	Структура.Вставить("ЯщикиКоличество", Изделие.СписокЯщики.Количество());
	
	НомерЯщика = 0;
	СписокЯщики = Изделие.СписокЯщики;
	Для Каждого Элемент Из СписокЯщики Цикл
		
		НомерЯщика = Элемент.НомерСтроки;
		
		Структура.Вставить("ТаблицаФасадов" + НомерЯщика + "Имя", Элемент.ИмяЯщика);
		Структура.Вставить("ТаблицаФасадов" + НомерЯщика + "ВидФасада", "");
		Структура.Вставить("ТаблицаФасадов" + НомерЯщика + "НомерДетали", Элемент.НомерСтроки);
		Структура.Вставить("ТаблицаФасадов" + НомерЯщика, "Ящик");
		Структура.Вставить("ТаблицаФасадов" + НомерЯщика + "КоличествоДемпфер", 0);         
		Структура.Вставить("ТаблицаФасадов" + НомерЯщика + "КоличествоМеханизмФасада", 0);              
		Структура.Вставить("ТаблицаФасадов" + НомерЯщика + "МеханизмФасада", "");         
		Структура.Вставить("ТаблицаФасадов" + НомерЯщика + "Демпфер", "");
		Структура.Вставить("ТаблицаФасадов" + НомерЯщика + "ПоложениеРучки", "");
		Структура.Вставить("ТаблицаФасадов" + НомерЯщика + "Петли", "");
		
	КонецЦикла;
	
	СписокМатериалы = Изделие.СписокМатериалы;
	Структура.Вставить("ЛДСП10", ЗначениеЗаполнено(СписокМатериалы.Найти("10 ЛДСП", "Материал")));
	Структура.Вставить("ЛДСП16", ЗначениеЗаполнено(СписокМатериалы.Найти("16 ЛДСП", "Материал")));
	Структура.Вставить("ЛДСП1010", ЗначениеЗаполнено(СписокМатериалы.Найти("10 ЛДСП+10 ЛДСП", "Материал")));
	Структура.Вставить("ЛДСП1610", ЗначениеЗаполнено(СписокМатериалы.Найти("16 ЛДСП+10 ЛДСП", "Материал")));
	Структура.Вставить("ЛДСП1616", ЗначениеЗаполнено(СписокМатериалы.Найти("16 ЛДСП+16 ЛДСП", "Материал")));
	Структура.Вставить("ДВП", ЗначениеЗаполнено(СписокМатериалы.Найти("ДВП", "Материал")));
	Структура.Вставить("Столешница", ЗначениеЗаполнено(СписокМатериалы.Найти("Столешница", "Материал")));	
	Структура.Вставить("Стекло", ЗначениеЗаполнено(СписокМатериалы.Найти("Стекло", "Материал")));
	Структура.Вставить("МДФ", ЗначениеЗаполнено(СписокМатериалы.Найти("МДФ", "Материал")));
	Структура.Вставить("Пристенок", ЗначениеЗаполнено(СписокМатериалы.Найти("Пристенок", "Материал")));
	Структура.Вставить("Мойка", Ложь);
	Структура.Вставить("Сушка", Ложь);	
	Структура.Вставить("НоменклатураСушка", Неопределено);
	Структура.Вставить("НоменклатураМойка", Неопределено);
	
	Массив = Новый Массив;
	Массив.Добавить("ФасадСтеклянный");
	Массив.Добавить("ФасадАГТ");
	Массив.Добавить("ФасадЛДСП");
	Массив.Добавить("ФасадМДФ");
	Массив.Добавить("ФасадАлюминиевый");
	Массив.Добавить("ФасадСтеклянныйЗакругленный");
	КоличествоФасадов = 0;	
	
	Для Каждого Элемент Из Массив Цикл
		ОтборФасада = Новый Структура("Материал", Элемент);
		СтрокиФасада = СписокМатериалы.НайтиСтроки(ОтборФасада);
		
		Для Каждого Строка Из СтрокиФасада Цикл
			КоличествоФасадов = КоличествоФасадов + 1;
			НомерФасада = НомерЯщика + КоличествоФасадов;
			
			Структура.Вставить("ТаблицаФасадов" + НомерФасада, "Фасад");
			Структура.Вставить("ТаблицаФасадов" + НомерФасада + "ВидФасада", Строка.Материал);              
			Структура.Вставить("ТаблицаФасадов" + НомерФасада + "НомерДетали", Строка.НомерСтроки);         
			Структура.Вставить("ТаблицаФасадов" + НомерФасада + "Имя", Строка.ИмяДетали);                   
			Структура.Вставить("ТаблицаФасадов" + НомерФасада + "КоличествоДемпфер", Строка.КоличествоДемпфер);         
			Структура.Вставить("ТаблицаФасадов" + НомерФасада + "КоличествоМеханизмФасада", Строка.КоличествоМеханизмФасада);              
			Структура.Вставить("ТаблицаФасадов" + НомерФасада + "МеханизмФасада", Строка.МеханизмФасада);         
			Структура.Вставить("ТаблицаФасадов" + НомерФасада + "Демпфер", Строка.Демпфер);
			Структура.Вставить("ТаблицаФасадов" + НомерФасада + "ПоложениеРучки", Строка.ПоложениеРучки);
			Структура.Вставить("ТаблицаФасадов" + НомерФасада + "Петли", Строка.Петли);
			
		КонецЦикла;	
	КонецЦикла;
	КоличествоТаблицаФасадов = НомерЯщика + КоличествоФасадов;
	Структура.Вставить("КоличествоТаблицаФасадов", КоличествоТаблицаФасадов);
	
	СписокДопЭлементов = Изделие.СписокДопЭлементов;
	Для Каждого Элемент Из СписокДопЭлементов Цикл
		
		НоменклатураДопЭлемента = ПолучитьДопЭлемент(Элемент.ДопЭлемент, Изделие.ШиринаИзделия, Подразделение);
		
		Если Элемент.ДопЭлемент = Справочники.НоменклатурныеГруппы.Сушка Тогда
			Структура.Вставить("Сушка", Истина);
			Структура.Вставить("НоменклатураСушка", НоменклатураДопЭлемента);
		ИначеЕсли Элемент.ДопЭлемент = Справочники.НоменклатурныеГруппы.Мойка Тогда
			Структура.Вставить("Мойка", Истина);
			Структура.Вставить("НоменклатураМойка", НоменклатураДопЭлемента);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ВыгрузитьНужнуюТаблицуВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(Детали.Выгрузить(, "Изделие, ГлубинаИзделия, ШиринаИзделия, ВысотаИзделия, АдресКартинки"));
	
КонецФункции

&НаСервере
Процедура ЗагрузитьТабличнуюЧасть(АдресТаблицы)
	
	ТЗ = ПолучитьИзВременногоХранилища(АдресТаблицы);
	
	Если ТипЗнч(ТЗ) = Тип("ТаблицаЗначений") Тогда
		
		Для Каждого Строка Из Детали Цикл
			
			Строка.НовыйИндекс = ТЗ.Получить(Детали.Индекс(Строка)).Порядок;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДопГруппы() 
	
	Кромка2 = Новый Массив;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.Кромка2_19 Цикл
		Кромка2.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.Кромка2_35 Цикл
		Кромка2.Добавить(Элемент);
	КонецЦикла;
	МассивыНоменклатурныхГрупп.Вставить("Кромка2мм", Кромка2);
	
	Кромка 	= Новый Массив;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.Кромка045_19 Цикл
		Кромка.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.Кромка2мм Цикл
		Кромка.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.КантТ Цикл
		Кромка.Добавить(Элемент);
	КонецЦикла;
	МассивыНоменклатурныхГрупп.Вставить("Кромка", Кромка);
	
	Стекло_И_Зеркало = Новый Массив;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.Стекло Цикл
		Стекло_И_Зеркало.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.СтеклоДляСкругляемогоФасада Цикл
		Стекло_И_Зеркало.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.Зеркало Цикл
		Стекло_И_Зеркало.Добавить(Элемент);
	КонецЦикла;
	МассивыНоменклатурныхГрупп.Вставить("Стекло_И_Зеркало", Стекло_И_Зеркало);
	
	КромкаКФасадам = Новый Массив;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.Кромка045_19 Цикл
		КромкаКФасадам.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.Кромка2мм Цикл
		КромкаКФасадам.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.КромкаМДФ Цикл
		КромкаКФасадам.Добавить(Элемент);
	КонецЦикла;
	МассивыНоменклатурныхГрупп.Вставить("КромкаКФасадам", КромкаКФасадам);
	
	ЛДСП = Новый Массив;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.ЛДСП16 Цикл
		ЛДСП.Добавить(Элемент);
	КонецЦикла;
	//Для каждого Элемент Из МассивыНоменклатурныхГрупп.ЛДСП10 Цикл
	//	ЛДСП.Добавить(Элемент);
	//КонецЦикла;
	МассивыНоменклатурныхГрупп.Вставить("ЛДСП", ЛДСП);
	
	ФасадыАГТ = Новый Массив;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.АГТПанель Цикл
		ФасадыАГТ.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.Стекло_И_Зеркало Цикл
		ФасадыАГТ.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.ЛДСП10 Цикл
		ФасадыАГТ.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.МДФ8 Цикл
		ФасадыАГТ.Добавить(Элемент);
	КонецЦикла;
	МассивыНоменклатурныхГрупп.Вставить("ФасадыАГТ", ФасадыАГТ);
	
	ВсеФасады = Новый Массив;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.ЛДСП16 Цикл
		ВсеФасады.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.МДФ18 Цикл
		ВсеФасады.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.ФасадыАГТ Цикл
		ВсеФасады.Добавить(Элемент);
	КонецЦикла;
	МассивыНоменклатурныхГрупп.Вставить("ВсеФасады", ВсеФасады);
	
	ВсяКромкаКФасадам = Новый Массив;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.КромкаКФасадам Цикл
		ВсяКромкаКФасадам.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.РамочныйАлюминий Цикл
		ВсяКромкаКФасадам.Добавить(Элемент);
	КонецЦикла;
	Для каждого Элемент Из МассивыНоменклатурныхГрупп.АГТПрофиль Цикл
		ВсяКромкаКФасадам.Добавить(Элемент);
	КонецЦикла;
	МассивыНоменклатурныхГрупп.Вставить("ВсяКромкаКФасадам", ВсяКромкаКФасадам);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДопЭлемент(ДопЭлемент, ШиринаИзделия, Подразделение)
	
	Если ДопЭлемент = Справочники.НоменклатурныеГруппы.Мойка Тогда
		
		Возврат Справочники.Номенклатура.МойкаКухоннаяМатовая731;
		
	Иначе
		
		Знак = ?(ДопЭлемент = Справочники.НоменклатурныеГруппы.ГазовыйЛифт, ">", "<");
		Порядок = ?(ДопЭлемент = Справочники.НоменклатурныеГруппы.ГазовыйЛифт, "", "УБЫВ");
		Ширина = ?(ДопЭлемент = Справочники.НоменклатурныеГруппы.ГазовыйЛифт, 50, ШиринаИзделия);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НоменклатурнаяГруппа", ДопЭлемент);
		Запрос.УстановитьПараметр("ШиринаДетали", Ширина);
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	спрНоменклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК спрНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПодразделений КАК НоменклатураПодразделений
		|		ПО (НоменклатураПодразделений.Номенклатура = спрНоменклатура.Ссылка)
		|ГДЕ
		|	спрНоменклатура.НоменклатурнаяГруппа = &НоменклатурнаяГруппа
		|	И спрНоменклатура.ШиринаДетали " + Знак + "= &ШиринаДетали
		|	И НоменклатураПодразделений.Подразделение = &Подразделение
		|	И НоменклатураПодразделений.Доступность
		|
		|УПОРЯДОЧИТЬ ПО
		|	спрНоменклатура.ШиринаДетали " + Порядок;
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Если Выборка.Количество() > 0 Тогда
			Возврат Выборка[0].Ссылка;
		Иначе
			Возврат Неопределено;
		КонецЕсли;                                                          
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура УстановитьПараметр(Таблица, Параметр, ТипПараметра) 
	
	Для Каждого Строка Из Таблица Цикл
		
		Если Строка.ВидЭлемента = "Фасад" И ((ТипПараметра = "НоменклатураЭлемента" ИЛИ ТипПараметра = "ТорцовкаЭлемента")
			ИЛИ (НЕ ЗначениеЗаполнено(Строка.РасположениеРучки) И ТипПараметра = "НоменклатураРучки")) Тогда
			Параметр = Неопределено;
		КонецЕсли;	
		
		Строка[ТипПараметра] = Параметр;
		
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаКлиенте
Процедура ОтобразитьКартинку() 
	Данные = Элементы.Детали.ТекущиеДанные;
	Если Данные <> Неопределено Тогда
		АдресИзделия = Данные.АдресКартинки;
		АдресВХранилище = "";
		Если ЗначениеЗаполнено(АдресИзделия) Тогда
			ИмяФайла = АдресИзделия;
			ФайлИзображения = Новый Файл(ИмяФайла);
			Если ФайлИзображения.Существует() Тогда
				ПоместитьФайл(АдресВХранилище, ИмяФайла, , Ложь);
			КонецЕсли;
		КонецЕсли;
		Изображение  = АдресВХранилище;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Детали.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресТаблицы));
	
	Подразделение = Параметры.Подразделение;
	
	Если ЗначениеЗаполнено(Детали) Тогда
		Если Параметры.Свойство("Идентификатор")  Тогда
			Элементы.Детали.ТекущаяСтрока = Параметры.Идентификатор;
		КонецЕсли;
		Для каждого Элемент Из Детали Цикл
			Если ЗначениеЗаполнено(Элемент.СтрокаТаблицаФасадов) Тогда
				Элемент.ТаблицаФасадов.Загрузить(ЗначениеИзСтрокиВнутр(Элемент.СтрокаТаблицаФасадов));	
			КонецЕсли;
			Элемент.АдресКартинки = "Изделие" + Элемент.Изделие.Код;
		КонецЦикла;
	Иначе                                                                                              
		Стр = Детали.Добавить();	
	КонецЕсли;
	
	СписокНоменклатурныхГрупп = Новый СписокЗначений;
	
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.ЛДСП16);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.ЛДСП10);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.КантТ);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Кромка045_19);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Кромка2_19);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Кромка2_35);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.ДВП);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Столешница);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.КромкаСтолешница);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Гравировка);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Зеркало);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Стекло);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.СтеклоДляСкругляемогоФасада);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Ручка);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.АГТПанель);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.АГТПрофиль);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.КромкаМДФ);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.МДФ18);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.МДФ8);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.РамочныйАлюминий);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Пристенок);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Бутылочница);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Сушка);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.ГазовыйЛифт);
	СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Мойка);
	
	МассивыНоменклатурныхГрупп = ЛексСервер.ОтборНоменклатурныхГрупп(СписокНоменклатурныхГрупп, Подразделение);
	
	ДобавитьДопГруппы();	
	
	ШапкаОсновныхНастроек = Новый Структура;
	
	ШапкаОсновныхНастроек.Вставить("НоменклатураЛДСП","");
	ШапкаОсновныхНастроек.Вставить("НоменклатураДВП","");
	ШапкаОсновныхНастроек.Вставить("КромкаЛДСП","");
	ШапкаОсновныхНастроек.Вставить("Столешница","");;
	ШапкаОсновныхНастроек.Вставить("НоменклатураДляСклеивания","");
	ШапкаОсновныхНастроек.Вставить("Ручка","");
	ШапкаОсновныхНастроек.Вставить("НоменклатураСтекло", "");
	ШапкаОсновныхНастроек.Вставить("НоменклатураМДФ","");
	ШапкаОсновныхНастроек.Вставить("Пристенок","");
	ШапкаОсновныхНастроек.Вставить("ВидФасада", "");
	ШапкаОсновныхНастроек.Вставить("НоменклатураФасада","");
	ШапкаОсновныхНастроек.Вставить("КромкаФасада","");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РабочийКаталог = ФайловыеФункцииСлужебныйКлиент.ВыбратьПутьККаталогуДанныхПользователя();
	
	Для каждого Элемент Из Детали Цикл
		Если ЗначениеЗаполнено(Элемент.Изделие) Тогда
			Элемент.АдресКартинки = РабочийКаталог + Элемент.АдресКартинки;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ДеталиНоменклатураЛДСП.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.ЛДСП);
	Элементы.ДеталиКромкаЛДСП.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.Кромка);
	Элементы.ДеталиНоменклатураДляСклеивания.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.ЛДСП);	
	Элементы.ДеталиНоменклатураДВП.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.ДВП);
	Элементы.ДеталиНоменклатураМДФ.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.МДФ18);
	Элементы.ДеталиСтолешница.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.Столешница);
	Элементы.ДеталиРучка.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.Ручка);
	Элементы.ДеталиНоменклатураСтекло.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.Стекло_И_Зеркало);
	Элементы.ДеталиПристенок.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.Пристенок);
	Элементы.ДеталиТаблицаФасадовНоменклатураРучки.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.Ручка);
	Элементы.ДеталиТаблицаФасадовНоменклатураЭлемента.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.ЛДСП);
	Элементы.ДеталиТаблицаФасадовТорцовкаЭлемента.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.Кромка);
	Элементы.ДеталиМойка.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.Мойка);
	Элементы.ДеталиСушка.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.Сушка);
	
	ОтобразитьКартинку();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ДобавитьКДокументу(Команда)
	
	Модифицированность = Ложь;
	ТаблицаДетали = ПроверитьПередСохранением();
	Если ТаблицаДетали <> Неопределено Тогда 
		ОповеститьОВыборе(ТаблицаДетали);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрИзделия(Команда)
	
	ПараметрыДляФормы = Новый Структура;
	ПараметрыДляФормы.Вставить("АдресТаблицы", ВыгрузитьНужнуюТаблицуВХранилище());
	ПараметрыДляФормы.Вставить("РабочийКаталог", РабочийКаталог);
	ПараметрыДляФормы.Вставить("НовыйПросмотр", Истина);
	ОткрытьФорму("Документ.Спецификация.Форма.ФормаИзображениеИзделий", ПараметрыДляФормы, Элементы.Детали);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ СВОЙСТВ И КАТЕГОРИЙ

&НаСервере
Функция ПроверитьПередСохранением()
	
	Отказ = Ложь;
	
	Для каждого Элемент Из Детали Цикл
		
		НомерСтроки = Элемент.ПолучитьИдентификатор() + 1;
		ОписаниеОшибки = Строка(Элемент.Изделие) + "(Номер изделия - " + НомерСтроки + ")";
		ШиринаИзделия = Элемент.ШиринаИзделия;
		
		Для Каждого Строка Из Элемент.ТаблицаФасадов Цикл
			
			Если НЕ ЗначениеЗаполнено(Строка.ВидФасада) Тогда	
				Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
				Текст = "Не выбран вид фасада у " + ОписаниеОшибки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.ТаблицаФасадов");
				Отказ = Истина;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Строка.НоменклатураФасада) Тогда
				Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
				Текст = "Не выбран фасад у " + ОписаниеОшибки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.ТаблицаФасадов");
				Отказ = Истина;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Строка.ОбрамлениеФасада) И Строка.ВидФасада <> "ФасадСтеклянный" И Строка.ВидФасада <> "ФасадСтеклянныйЗакругленный" Тогда
				Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
				Текст = "Не выбрано обрамление фасада у " + ОписаниеОшибки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.ТаблицаФасадов");
				Отказ = Истина;
			КонецЕсли;
			
			Ручка = Строка.НоменклатураРучки;
			Если НЕ ЗначениеЗаполнено(Ручка) И (Строка.ВидЭлемента = "Ящик" ИЛИ ЗначениеЗаполнено(Строка.РасположениеРучки))Тогда
				Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
				Текст = "Не выбрана ручка у " + ОписаниеОшибки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.ТаблицаФасадов");
				Отказ = Истина;
			ИначеЕсли ЗначениеЗаполнено(Ручка) И (ШиринаИзделия < Ручка.ДлинаДетали + 90) Тогда
				Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
				Текст = "Размер ручки не подходит у " + ОписаниеОшибки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.ТаблицаФасадов");
				Отказ = Истина;
			КонецЕсли;
			
			Если Строка.ВидЭлемента = "Фасад" Тогда
				
				Если ЗначениеЗаполнено(Ручка) И НЕ ЗначениеЗаполнено(Строка.РасположениеРучки) Тогда
					Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
					Текст = "Укажите расположение ручки у " + ОписаниеОшибки;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.ТаблицаФасадов");
					Отказ = Истина;	
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Строка.МеханизмФасада) И НЕ ЗначениеЗаполнено(Строка.КоличествоМеханизмФасада) Тогда
					Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
					Текст = "Укажите количество механизмов фасада у " + ОписаниеОшибки;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.ТаблицаФасадов");
					Отказ = Истина;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Строка.Демпфер) И НЕ ЗначениеЗаполнено(Строка.КоличествоДемпфер) Тогда
					Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
					Текст = "Укажите количество демпферов у " + ОписаниеОшибки;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.ТаблицаФасадов");
					Отказ = Истина;
				КонецЕсли;
				
			Иначе
				
				Если НЕ ЗначениеЗаполнено(Строка.ВыдвижнойЭлемент) Тогда
					Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
					Текст = "Укажите выдвижной элемент у " + ОписаниеОшибки;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.ТаблицаФасадов");
					Отказ = Истина;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Строка.МеханизмЭлемента) Тогда
					Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
					Текст = "Укажите механизм элемент у " + ОписаниеОшибки;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.ТаблицаФасадов");
					Отказ = Истина;	
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Строка.НоменклатураЭлемента) Тогда
					Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
					Текст = "Укажите номенклатуру элемента у " + ОписаниеОшибки;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.ТаблицаФасадов");
					Отказ = Истина;	
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Строка.ТорцовкаЭлемента) Тогда
					Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
					Текст = "Укажите торцовку элемента у " + ОписаниеОшибки;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.ТаблицаФасадов");
					Отказ = Истина;	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Элемент.Мойка) Тогда
			Если Элемент.Мойка.ШиринаДетали + 70 > Элемент.ШиринаИзделия Тогда
				Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
				Текст = "Мойка не подходит по ширине. Выберите другую у " + ОписаниеОшибки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.Мойка");
				Отказ = Истина;
			КонецЕсли;
			Если Элемент.Мойка.ГлубинаДетали + 70 > Элемент.ГлубинаИзделия Тогда
				Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
				Текст = "Мойка не подходит по глубине. Выберите другую у " + ОписаниеОшибки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.Мойка");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ДопТекстуры = ЗначениеЗаполнено(Элемент.Изделие.СписокМатериалы.Найти("10 ЛДСП+10 ЛДСП")) ИЛИ ЗначениеЗаполнено(Элемент.Изделие.СписокМатериалы.Найти("16 ЛДСП+10 ЛДСП"))
		ИЛИ ЗначениеЗаполнено(Элемент.Изделие.СписокМатериалы.Найти("16 ЛДСП+16 ЛДСП"));
		НоменклатураЛДСП = ЗначениеЗаполнено(Элемент.Изделие.СписокМатериалы.Найти("10 ЛДСП")) ИЛИ ЗначениеЗаполнено(Элемент.Изделие.СписокМатериалы.Найти("16 ЛДСП"))
		ИЛИ ДопТекстуры;
		
		Если НЕ ЗначениеЗаполнено(Элемент.Изделие) Тогда
			Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
			Текст = "Не выбрано Изделие";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.Изделие");
			Отказ = Истина;
		КонецЕсли;
		
		Если НоменклатураЛДСП Тогда
			Если НЕ ЗначениеЗаполнено(Элемент.НоменклатураЛДСП) Тогда
				Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
				Текст = "Не выбрана номенклатура ЛДСП";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.НоменклатураЛДСП");
				Отказ = Истина;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Элемент.КромкаЛДСП) Тогда
				Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
				Текст = "Не выбрана кромка ЛДСП";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.КромкаЛДСП");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;	
		
		Если ДопТекстуры И НЕ ЗначениеЗаполнено(Элемент.НоменклатураДляСклеивания) Тогда
			Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
			Текст = "Не выбрана доп. текстура";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.НоменклатураДляСклеивания");
			Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.Изделие.СписокМатериалы.Найти("Столешница")) И НЕ ЗначениеЗаполнено(Элемент.Столешница) Тогда
			Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
			Текст = "Не выбрана столешница";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.Столешница");
			Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.Изделие.СписокМатериалы.Найти("Пристенок")) И НЕ ЗначениеЗаполнено(Элемент.Пристенок) Тогда
			Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
			Текст = "Не выбран пристенок";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.Пристенок");
			Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.Изделие.СписокМатериалы.Найти("Стекло")) И НЕ ЗначениеЗаполнено(Элемент.НоменклатураСтекло) Тогда
			Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
			Текст = "Не выбрано стекло";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.НоменклатураСтекло");
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Элемент.НоменклатураДВП) И (ЗначениеЗаполнено(Элемент.Изделие.СписокМатериалы.Найти("ДВП")) ИЛИ Элемент.Ящики.Количество() > 0) Тогда
			Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
			Текст = "Не выбрана ДВП";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.НоменклатураДВП");
			Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.Изделие.СписокМатериалы.Найти("МДФ")) И НЕ ЗначениеЗаполнено(Элемент.НоменклатураМДФ) Тогда
			Элементы.Детали.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
			Текст = "Не выбрана МДФ";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.НоменклатураМДФ");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		ТЗДетали = РеквизитФормыВЗначение("Детали");
		Для Каждого Элемент Из ТЗДетали Цикл
			Элемент.СтрокаТаблицаФасадов = ЗначениеВСтрокуВнутр(Элемент.ТаблицаФасадов);
		КонецЦикла;
		ЗначениеВРеквизитФормы(ТЗДетали, "Детали");
		
		Возврат ПоместитьВоВременноеХранилище(Детали.Выгрузить());
		
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ 

&НаКлиенте
Процедура ДеталиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Детали.ТекущиеДанные;
	Если (ТекущиеДанные <> Неопределено) И (ТекДанныеСтроки <> ТекущиеДанные) Тогда
		НастройкиИзделия();
		ТекДанныеСтроки = ТекущиеДанные;
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.НоменклатураЛДСП) И ЗначениеЗаполнено(ШапкаОсновныхНастроек.НоменклатураЛДСП) Тогда			
			ТекущиеДанные.НоменклатураЛДСП = ШапкаОсновныхНастроек.НоменклатураЛДСП;		
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.НоменклатураЛДСП) Тогда
			ШапкаОсновныхНастроек.Вставить("НоменклатураЛДСП", ТекущиеДанные.НоменклатураЛДСП);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.НоменклатураДВП) И ЗначениеЗаполнено(ШапкаОсновныхНастроек.НоменклатураДВП) Тогда			
			ТекущиеДанные.НоменклатураДВП = ШапкаОсновныхНастроек.НоменклатураДВП;		
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.НоменклатураДВП) Тогда
			ШапкаОсновныхНастроек.Вставить("НоменклатураДВП", ТекущиеДанные.НоменклатураДВП);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.КромкаЛДСП) И ЗначениеЗаполнено(ШапкаОсновныхНастроек.КромкаЛДСП) Тогда			
			ТекущиеДанные.КромкаЛДСП = ШапкаОсновныхНастроек.КромкаЛДСП;		
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.КромкаЛДСП) Тогда
			ШапкаОсновныхНастроек.Вставить("КромкаЛДСП", ТекущиеДанные.КромкаЛДСП);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Столешница) И ЗначениеЗаполнено(ШапкаОсновныхНастроек.Столешница) Тогда			
			ТекущиеДанные.Столешница = ШапкаОсновныхНастроек.Столешница;		
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Столешница) Тогда
			ШапкаОсновныхНастроек.Вставить("Столешница", ТекущиеДанные.Столешница);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.НоменклатураДляСклеивания) И ЗначениеЗаполнено(ШапкаОсновныхНастроек.НоменклатураДляСклеивания) Тогда			
			ТекущиеДанные.НоменклатураДляСклеивания = ШапкаОсновныхНастроек.НоменклатураДляСклеивания;		
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.НоменклатураДляСклеивания) Тогда
			ШапкаОсновныхНастроек.Вставить("НоменклатураДляСклеивания", ТекущиеДанные.НоменклатураДляСклеивания);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Ручка) И ЗначениеЗаполнено(ШапкаОсновныхНастроек.Ручка) Тогда			
			ТекущиеДанные.Ручка = ШапкаОсновныхНастроек.Ручка;
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Ручка) Тогда
			ШапкаОсновныхНастроек.Вставить("Ручка", ТекущиеДанные.Ручка);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.НоменклатураСтекло) И ЗначениеЗаполнено(ШапкаОсновныхНастроек.НоменклатураСтекло) Тогда			
			ТекущиеДанные.НоменклатураСтекло = ШапкаОсновныхНастроек.НоменклатураСтекло;		
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.НоменклатураСтекло) Тогда
			ШапкаОсновныхНастроек.Вставить("НоменклатураСтекло", ТекущиеДанные.НоменклатураСтекло);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.НоменклатураМДФ) И ЗначениеЗаполнено(ШапкаОсновныхНастроек.НоменклатураМДФ) Тогда			
			ТекущиеДанные.НоменклатураМДФ = ШапкаОсновныхНастроек.НоменклатураМДФ;		
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.НоменклатураМДФ) Тогда
			ШапкаОсновныхНастроек.Вставить("НоменклатураМДФ", ТекущиеДанные.НоменклатураМДФ);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Пристенок) И ЗначениеЗаполнено(ШапкаОсновныхНастроек.Пристенок) Тогда			
			ТекущиеДанные.Пристенок = ШапкаОсновныхНастроек.Пристенок;		
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Пристенок) Тогда
			ШапкаОсновныхНастроек.Вставить("Пристенок", ТекущиеДанные.Пристенок);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ВидФасада) И ЗначениеЗаполнено(ШапкаОсновныхНастроек.ВидФасада) Тогда			
			ТекущиеДанные.ВидФасада = ШапкаОсновныхНастроек.ВидФасада;		
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ВидФасада) Тогда
			ШапкаОсновныхНастроек.Вставить("ВидФасада", ТекущиеДанные.ВидФасада);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.НоменклатураФасада) И ЗначениеЗаполнено(ШапкаОсновныхНастроек.НоменклатураФасада) Тогда			
			ТекущиеДанные.НоменклатураФасада = ШапкаОсновныхНастроек.НоменклатураФасада;		
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.НоменклатураФасада) Тогда
			ШапкаОсновныхНастроек.Вставить("НоменклатураФасада", ТекущиеДанные.НоменклатураФасада);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.КромкаФасада) И ЗначениеЗаполнено(ШапкаОсновныхНастроек.КромкаФасада) Тогда			
			ТекущиеДанные.КромкаФасада = ШапкаОсновныхНастроек.КромкаФасада;		
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.КромкаФасада) Тогда
			ШапкаОсновныхНастроек.Вставить("КромкаФасада", ТекущиеДанные.КромкаФасада);
		КонецЕсли;
		
		Если ТекущиеДанные.ТаблицаФасадов.Количество() > 0 Тогда
			ДеталиТаблицаФасадовПриАктивизацииСтроки(Элемент);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзделиеПриИзменении(Элемент)
	
	НастройкиИзделия();
	Если ЗначениеЗаполнено(СтруктураИзделия) Тогда
		Элементы.Детали.ТекущиеДанные.ГлубинаИзделия = СтруктураИзделия.ГлубинаИзделия;
		Элементы.Детали.ТекущиеДанные.ШиринаИзделия = СтруктураИзделия.ШиринаИзделия;
		Элементы.Детали.ТекущиеДанные.ВысотаИзделия = СтруктураИзделия.ВысотаИзделия;
		Элементы.Детали.ТекущиеДанные.Шаг = СтруктураИзделия.Шаг;
		Элементы.Детали.ТекущиеДанные.Мойка = СтруктураИзделия.НоменклатураМойка;
		Элементы.Детали.ТекущиеДанные.Сушка = СтруктураИзделия.НоменклатураСушка;
		
		ТаблицаФасадов = Элементы.Детали.ТекущиеДанные.ТаблицаФасадов;
		ТаблицаФасадов.Очистить();
		Для Индекс = 1 По СтруктураИзделия.КоличествоТаблицаФасадов Цикл
			Строка = Элементы.Детали.ТекущиеДанные.ТаблицаФасадов.Добавить();
			Строка.ИмяФасада = СтруктураИзделия["ТаблицаФасадов" + Индекс +  "Имя"];
			Строка.ВидФасада = СтруктураИзделия["ТаблицаФасадов" + Индекс +  "ВидФасада"];
			Строка.РасположениеРучки = СтруктураИзделия["ТаблицаФасадов" + Индекс +  "ПоложениеРучки"];
			Строка.МеханизмФасада = СтруктураИзделия["ТаблицаФасадов" + Индекс +  "МеханизмФасада"];
			Строка.Демпфер = СтруктураИзделия["ТаблицаФасадов" + Индекс +  "Демпфер"];
			Строка.КоличествоМеханизмФасада = СтруктураИзделия["ТаблицаФасадов" + Индекс +  "КоличествоМеханизмФасада"];
			Строка.КоличествоДемпфер = СтруктураИзделия["ТаблицаФасадов" + Индекс +  "КоличествоДемпфер"];
			Строка.ВидЭлемента = СтруктураИзделия["ТаблицаФасадов" + Индекс];
			Строка.НомерСтроки = Индекс;
			Строка.НомерДетали = СтруктураИзделия["ТаблицаФасадов" + Индекс + "НомерДетали"];
			
			Если ЗначениеЗаполнено(ШапкаОсновныхНастроек.ВидФасада) Тогда
				Строка.ВидФасада = ШапкаОсновныхНастроек.ВидФасада;
			КонецЕсли;
			Если ЗначениеЗаполнено(ШапкаОсновныхНастроек.НоменклатураФасада) Тогда
				Строка.НоменклатураФасада = ШапкаОсновныхНастроек.НоменклатураФасада;
			КонецЕсли;
			Если ЗначениеЗаполнено(ШапкаОсновныхНастроек.КромкаФасада) Тогда
				Строка.ОбрамлениеФасада = ШапкаОсновныхНастроек.КромкаФасада;
			КонецЕсли;
			
			Если Строка.ВидЭлемента = "Ящик" Тогда
				Если ЗначениеЗаполнено(ШапкаОсновныхНастроек.НоменклатураЛДСП) Тогда
					Строка.НоменклатураЭлемента = ШапкаОсновныхНастроек.НоменклатураЛДСП;
				КонецЕсли;
				Если ЗначениеЗаполнено(ШапкаОсновныхНастроек.КромкаЛДСП) Тогда
					Строка.ТорцовкаЭлемента = ШапкаОсновныхНастроек.КромкаЛДСП;
				КонецЕсли;	
			КонецЕсли;	
			
		КонецЦикла;
		
		Ручка = Элементы.Детали.ТекущиеДанные.Ручка;
		УстановитьПараметр(ТаблицаФасадов, Ручка, "НоменклатураРучки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиИзделия() 
	Если Элементы.Детали.ТекущиеДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(Элементы.Детали.ТекущиеДанные.Изделие) Тогда
			СтруктураИзделия = ПолучитьСтруктуруИзделия(Элементы.Детали.ТекущиеДанные.Изделие, Подразделение);
			
			Элементы.Детали.ТекущиеДанные.АдресКартинки = РабочийКаталог + "Изделие" + СтруктураИзделия.Код;
			
			Элементы.ГлубинаИзделия.Подсказка = Строка(СтруктураИзделия.ГлубинаИзделияМин) + " - " + Строка(СтруктураИзделия.ГлубинаИзделияМакс);
			Элементы.ГлубинаИзделия.МаксимальноеЗначение = СтруктураИзделия.ГлубинаИзделияМакс;
			Элементы.ГлубинаИзделия.МинимальноеЗначение = СтруктураИзделия.ГлубинаИзделияМин;
			Элементы.ШиринаИзделия.Подсказка = Строка(СтруктураИзделия.ШиринаИзделияМин) + " - " + Строка(СтруктураИзделия.ШиринаИзделияМакс);
			Если СтруктураИзделия.Шаг > 0 Тогда
				Элементы.ШиринаИзделия.Подсказка = Элементы.ШиринаИзделия.Подсказка + " (шаг: " + Строка(СтруктураИзделия.Шаг) + ")";
			КонецЕсли;	
			Элементы.ШиринаИзделия.МаксимальноеЗначение = СтруктураИзделия.ШиринаИзделияМакс;
			Элементы.ШиринаИзделия.МинимальноеЗначение = СтруктураИзделия.ШиринаИзделияМин;
			Элементы.ВысотаИзделия.Подсказка = Строка(СтруктураИзделия.ВысотаИзделияМин) + " - " + Строка(СтруктураИзделия.ВысотаИзделияМакс);
			Элементы.ВысотаИзделия.МаксимальноеЗначение = СтруктураИзделия.ВысотаИзделияМакс;
			Элементы.ВысотаИзделия.МинимальноеЗначение = СтруктураИзделия.ВысотаИзделияМин;
			
			ЕстьЛДСП = СтруктураИзделия.ЛДСП10 ИЛИ СтруктураИзделия.ЛДСП16 ИЛИ СтруктураИзделия.ЛДСП1010 ИЛИ
			СтруктураИзделия.ЛДСП1610 ИЛИ СтруктураИзделия.ЛДСП1616 ИЛИ СтруктураИзделия.ЯщикиКоличество > 0;
			НастройкиФасадов = СтруктураИзделия.КоличествоТаблицаФасадов > 0;
			
			Элементы.ДеталиНоменклатураЛДСП.Доступность = ЕстьЛДСП;
			Элементы.ДеталиКромкаЛДСП.Доступность = ЕстьЛДСП;
			Элементы.ДеталиНоменклатураДляСклеивания.Доступность = СтруктураИзделия.ЛДСП1010 ИЛИ СтруктураИзделия.ЛДСП1610 ИЛИ СтруктураИзделия.ЛДСП1616;
			Элементы.ДеталиНоменклатураМДФ.Доступность = СтруктураИзделия.МДФ;
			Элементы.ДеталиНоменклатураСтекло.Доступность = СтруктураИзделия.Стекло;
			Элементы.ДеталиНоменклатураДВП.Доступность = СтруктураИзделия.ДВП ИЛИ СтруктураИзделия.ЯщикиКоличество > 0;
			Элементы.ДеталиРучка.Доступность = НастройкиФасадов;
			Элементы.ДеталиПристенок.Доступность = СтруктураИзделия.Пристенок;
			Элементы.ДеталиВидФасада.Доступность = НастройкиФасадов;
			Элементы.ДеталиНоменклатураФасада.Доступность = НастройкиФасадов;
			Элементы.ДеталиКромкаФасада.Доступность = НастройкиФасадов;
			Элементы.ДеталиМойка.Доступность = СтруктураИзделия.Мойка;
			Элементы.ДеталиСушка.Доступность = СтруктураИзделия.Сушка;		
			ПриИзмененииВидФасада(Элементы.Детали.ТекущиеДанные.ВидФасада);
		КонецЕсли;
		ОтобразитьКартинку();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШиринаИзделияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Детали.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.Шаг > 0 Тогда
			Если ТекущиеДанные.ШиринаИзделия % ТекущиеДанные.Шаг <> 0 Тогда
				ТекущиеДанные.ШиринаИзделия = СтруктураИзделия.ШиринаИзделия;
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Соблюдайте шаг %1 ", ТекущиеДанные.Шаг);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.Детали.ТекущиеДанные.ШиринаИзделия");
			Иначе
				Если ЗначениеЗаполнено(ТекущиеДанные.Сушка) Тогда
					ТекущиеДанные.Сушка = ПолучитьДопЭлемент(ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Сушка"), ТекущиеДанные.ШиринаИзделия, Подразделение);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЗагрузитьТабличнуюЧасть(ВыбранноеЗначение);
	
	Детали.Сортировать("НовыйИндекс Возр");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиНоменклатураЛДСППриИзменении(Элемент)
	
	НоменклатураЛДСП = Элементы.Детали.ТекущиеДанные.НоменклатураЛДСП;
	ШапкаОсновныхНастроек.Вставить("НоменклатураЛДСП", НоменклатураЛДСП);
	
	УстановитьПараметр(Элементы.Детали.ТекущиеДанные.ТаблицаФасадов, НоменклатураЛДСП, "НоменклатураЭлемента");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиКромкаЛДСППриИзменении(Элемент)
	
	КромкаЛДСП = Элементы.Детали.ТекущиеДанные.КромкаЛДСП;
	ШапкаОсновныхНастроек.Вставить("КромкаЛДСП", КромкаЛДСП);
	
	УстановитьПараметр(Элементы.Детали.ТекущиеДанные.ТаблицаФасадов, КромкаЛДСП, "ТорцовкаЭлемента");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиСтолешницаПриИзменении(Элемент)
	ШапкаОсновныхНастроек.Вставить("Столешница", Элементы.Детали.ТекущиеДанные.Столешница);
КонецПроцедуры

&НаКлиенте
Процедура ДеталиНоменклатураСтеклоПриИзменении(Элемент)
	ШапкаОсновныхНастроек.Вставить("НоменклатураСтекло", Элементы.Детали.ТекущиеДанные.НоменклатураСтекло);
КонецПроцедуры

&НаКлиенте
Процедура ДеталиНоменклатураМДФПриИзменении(Элемент)
	ШапкаОсновныхНастроек.Вставить("НоменклатураМДФ", Элементы.Детали.ТекущиеДанные.НоменклатураМДФ);
КонецПроцедуры

&НаКлиенте
Процедура ДеталиНоменклатураДВППриИзменении(Элемент)
	ШапкаОсновныхНастроек.Вставить("НоменклатураДВП", Элементы.Детали.ТекущиеДанные.НоменклатураДВП);
КонецПроцедуры

&НаКлиенте
Процедура ДеталиРучкаПриИзменении(Элемент)
	
	Ручка = Элементы.Детали.ТекущиеДанные.Ручка;
	ШапкаОсновныхНастроек.Вставить("Ручка", Ручка);
	
	УстановитьПараметр(Элементы.Детали.ТекущиеДанные.ТаблицаФасадов, Ручка, "НоменклатураРучки");	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиНоменклатураДляСклеиванияПриИзменении(Элемент)
	ШапкаОсновныхНастроек.Вставить("НоменклатураДляСклеивания", Элементы.Детали.ТекущиеДанные.НоменклатураДляСклеивания);
КонецПроцедуры

&НаКлиенте
Процедура ДеталиПристенокПриИзменении(Элемент)
	ШапкаОсновныхНастроек.Вставить("Пристенок", Элементы.Детали.ТекущиеДанные.Пристенок);
КонецПроцедуры

&НаКлиенте
Процедура ДеталиВидФасадаПриИзменении(Элемент)
	
	ВидФасада = Элементы.Детали.ТекущиеДанные.ВидФасада;
	ШапкаОсновныхНастроек.Вставить("ВидФасада", ВидФасада);	
	
	Элементы.ДеталиНоменклатураФасада.СписокВыбора.Очистить();
	Элементы.ДеталиКромкаФасада.СписокВыбора.Очистить();
	ПриИзмененииВидФасада(ВидФасада);
	
	УстановитьПараметр(Элементы.Детали.ТекущиеДанные.ТаблицаФасадов, Элементы.Детали.ТекущиеДанные.ВидФасада, "ВидФасада");
	
	Элементы.Детали.ТекущиеДанные.НоменклатураФасада = Неопределено;
	ДеталиНоменклатураФасадаПриИзменении(Элемент);
	Элементы.Детали.ТекущиеДанные.КромкаФасада = Неопределено;
	ДеталиКромкаФасадаПриИзменении(Элемент);
	
	ДеталиТаблицаФасадовПриАктивизацииСтроки(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВидФасада(ВидФасада) 
	
	Если ВидФасада = "ФасадАГТ" Тогда
		Элементы.ДеталиНоменклатураФасада.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.ФасадыАГТ);
		Элементы.ДеталиКромкаФасада.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.АГТПрофиль);
	ИначеЕсли ВидФасада = "ФасадЛДСП" Тогда
		Элементы.ДеталиНоменклатураФасада.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.ЛДСП16);
		Элементы.ДеталиКромкаФасада.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.КромкаКФасадам);
	ИначеЕсли ВидФасада = "ФасадМДФ" Тогда
		Элементы.ДеталиНоменклатураФасада.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.МДФ18);
		Элементы.ДеталиКромкаФасада.СписокВыбора.ЗагрузитьЗначения(МассивыНоменклатурныхГрупп.КромкаМДФ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиНоменклатураФасадаПриИзменении(Элемент)
	
	ШапкаОсновныхНастроек.Вставить("НоменклатураФасада", Элементы.Детали.ТекущиеДанные.НоменклатураФасада);
	
	УстановитьПараметр(Элементы.Детали.ТекущиеДанные.ТаблицаФасадов, Элементы.Детали.ТекущиеДанные.НоменклатураФасада, "НоменклатураФасада");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиКромкаФасадаПриИзменении(Элемент)
	
	ШапкаОсновныхНастроек.Вставить("КромкаФасада", Элементы.Детали.ТекущиеДанные.КромкаФасада);
	
	УстановитьПараметр(Элементы.Детали.ТекущиеДанные.ТаблицаФасадов, Элементы.Детали.ТекущиеДанные.КромкаФасада, "ОбрамлениеФасада");
	
КонецПроцедуры

/////////////////////////////////////////////////НОВЫЕ ФАСАДЫ///////////////////////////////////////////////////////

&НаКлиенте
Процедура ДеталиТаблицаФасадовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Детали.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.ТаблицаФасадов.Количество() > 0 Тогда
			ЗагрузитьЗначениеВыбораФасада();
			ДеталиТаблицаФасадовВыдвижнойЭлементПриИзменении(Элемент);
			
			ДанныеТаблицаФасадов = Элементы.ДеталиТаблицаФасадов.ТекущиеДанные;
			Если ДанныеТаблицаФасадов <> Неопределено Тогда
				ЭтоЯщик = ДанныеТаблицаФасадов.ВидЭлемента = "Ящик";
				
				Элементы.ДеталиТаблицаФасадовРасположениеРучки.ТолькоПросмотр = ЭтоЯщик;
				Элементы.ДеталиТаблицаФасадовМеханизмФасада.ТолькоПросмотр = ЭтоЯщик;
				Элементы.ДеталиТаблицаФасадовКоличествоДемпфер.ТолькоПросмотр = ЭтоЯщик;
				Элементы.ДеталиТаблицаФасадовДемпфер.ТолькоПросмотр = ЭтоЯщик;
				Элементы.ДеталиТаблицаФасадовКоличествоМеханизмФасада.ТолькоПросмотр = ЭтоЯщик;
				Элементы.ДеталиТаблицаФасадовВыдвижнойЭлемент.ТолькоПросмотр = НЕ ЭтоЯщик;
				Элементы.ДеталиТаблицаФасадовНоменклатураЭлемента.ТолькоПросмотр = НЕ ЭтоЯщик;
				Элементы.ДеталиТаблицаФасадовТорцовкаЭлемента.ТолькоПросмотр = НЕ ЭтоЯщик;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиТаблицаФасадовВидФасадаПриИзменении(Элемент)
	
	ДанныеТаблицаФасадов = Элементы.ДеталиТаблицаФасадов.ТекущиеДанные;
	ДанныеТаблицаФасадов.НоменклатураФасада = Неопределено;
	ДанныеТаблицаФасадов.ОбрамлениеФасада = Неопределено;
	ЗагрузитьЗначениеВыбораФасада();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗначениеВыбораФасада() 
	
	ДанныеТаблицаФасадов = Элементы.ДеталиТаблицаФасадов.ТекущиеДанные;
	Если ДанныеТаблицаФасадов <> Неопределено Тогда
		Элементы.ДеталиТаблицаФасадовНоменклатураФасада.СписокВыбора.Очистить();
		Элементы.ДеталиТаблицаФасадовОбрамлениеФасада.СписокВыбора.Очистить();
		
		МассивНоменклатураФасада = Новый Массив;
		МассивОбрамлениеФасада = Новый Массив;
		
		Если ДанныеТаблицаФасадов.ВидФасада = "ФасадАГТ" Тогда
			МассивНоменклатураФасада = МассивыНоменклатурныхГрупп.ФасадыАГТ;
			МассивОбрамлениеФасада = МассивыНоменклатурныхГрупп.АГТПрофиль;
		ИначеЕсли ДанныеТаблицаФасадов.ВидФасада = "ФасадСтеклянный" Тогда
			МассивНоменклатураФасада = МассивыНоменклатурныхГрупп.Стекло_И_Зеркало;
		ИначеЕсли ДанныеТаблицаФасадов.ВидФасада = "ФасадЛДСП" Тогда
			МассивНоменклатураФасада = МассивыНоменклатурныхГрупп.ЛДСП16;
			МассивОбрамлениеФасада = МассивыНоменклатурныхГрупп.КромкаКФасадам;
		ИначеЕсли ДанныеТаблицаФасадов.ВидФасада = "ФасадМДФ" Тогда
			МассивНоменклатураФасада = МассивыНоменклатурныхГрупп.МДФ18;
			МассивОбрамлениеФасада = МассивыНоменклатурныхГрупп.КромкаМДФ;
		ИначеЕсли ДанныеТаблицаФасадов.ВидФасада = "ФасадАлюминиевый" Тогда
			МассивНоменклатураФасада = МассивыНоменклатурныхГрупп.Стекло_И_Зеркало;
			МассивОбрамлениеФасада = МассивыНоменклатурныхГрупп.РамочныйАлюминий;
		ИначеЕсли ДанныеТаблицаФасадов.ВидФасада = "ФасадСтеклянныйЗакругленный" Тогда
			МассивНоменклатураФасада = МассивыНоменклатурныхГрупп.Стекло_И_Зеркало;
		КонецЕсли;
		
		Элементы.ДеталиТаблицаФасадовНоменклатураФасада.СписокВыбора.ЗагрузитьЗначения(МассивНоменклатураФасада);
		Элементы.ДеталиТаблицаФасадовОбрамлениеФасада.СписокВыбора.ЗагрузитьЗначения(МассивОбрамлениеФасада);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиТаблицаФасадовВыдвижнойЭлементПриИзменении(Элемент)
	
	ДанныеТаблицаФасадов = Элементы.ДеталиТаблицаФасадов.ТекущиеДанные;
	Если ДанныеТаблицаФасадов <> Неопределено Тогда
		Элементы.ДеталиТаблицаФасадовМеханизмЭлемента.ТолькоПросмотр = НЕ ЗначениеЗаполнено(ДанныеТаблицаФасадов.ВыдвижнойЭлемент);
		Если ДанныеТаблицаФасадов.ВыдвижнойЭлемент = ПредопределенноеЗначение("Перечисление.ВидыЯщика.Обычный") Тогда
			Если ДанныеТаблицаФасадов.МеханизмЭлемента = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Тандембокс") 
				ИЛИ ДанныеТаблицаФасадов.МеханизмЭлемента = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Метабокс") Тогда
				ДанныеТаблицаФасадов.МеханизмЭлемента = Неопределено;
			КонецЕсли;
		ИначеЕсли ДанныеТаблицаФасадов.ВыдвижнойЭлемент = ПредопределенноеЗначение("Перечисление.ВидыЯщика.Тандембокс") Тогда
			ДанныеТаблицаФасадов.МеханизмЭлемента = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Тандембокс");	
			Элементы.ДеталиТаблицаФасадовМеханизмЭлемента.ТолькоПросмотр = Истина;
		ИначеЕсли ДанныеТаблицаФасадов.ВыдвижнойЭлемент = ПредопределенноеЗначение("Перечисление.ВидыЯщика.Метабокс") Тогда	
			ДанныеТаблицаФасадов.МеханизмЭлемента =	ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Метабокс");	
			Элементы.ДеталиТаблицаФасадовМеханизмЭлемента.ТолькоПросмотр = Истина;
		Иначе
			ДанныеТаблицаФасадов.МеханизмЭлемента = Неопределено;
			Элементы.ДеталиТаблицаФасадовМеханизмЭлемента.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиТабличныеЧастиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
