
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Управленческий.Записывать = Истина;
	
	Для Каждого Строка Из СписокДоговоров Цикл
		
		Если Строка.ОбщаяОценка = Перечисления.Оценки.Претензия Тогда
			
			// { Васильев Александр Леонидович [24.09.2014]
			// Совсем не корректный способ.
			// Во-первых в транзакции, а во-вторых
			// вполне возможна служебка созданная
			// без обзвона по договору и не сформируется.
			// } Васильев Александр Леонидович [24.09.2014]
			
			Если НЕ ЗначениеЗаполнено(Документы.СлужебнаяЗаписка.НайтиПоРеквизиту("Документ", Строка.Договор)) Тогда
				
				Замерщик = ОпределитьЗамерщика(Строка.Договор);
				
				НовыйДокумент = Документы.СлужебнаяЗаписка.СоздатьДокумент();
				НовыйДокумент.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.ПретензияЗаявление;
				НовыйДокумент.Проблема = Строка.ОбщийКомментарий;
				НовыйДокумент.Адресат = Константы.ГенеральныйДиректор.Получить();
				НовыйДокумент.Тема = "Претензия к " + Строка.Договор + " (" + Строка.Адрес + ") Замерщик: " + Замерщик;
				НовыйДокумент.Документ = Строка.Договор;
				НовыйДокумент.Дата = ТекущаяДата();
				НовыйДокумент.Автор = Автор;
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// { Васильев Александр Леонидович [24.09.2014]
	// переделать на функцию
	// ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю();
	// } Васильев Александр Леонидович [24.09.2014]
	
	Для Каждого Строка Из СписокДоговоров Цикл
		Индекс = Строка.НомерСтроки - 1;
		НомерСтроки = Строка.НомерСтроки;
		
		Если (НЕ ЗначениеЗаполнено(Строка.ОценкаЗамер) И ЗначениеЗаполнено(Строка.КомментарийЗамер)) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + НомерСтроки + " не заполнена оценка замер";
			Сообщение.Поле = "СписокДоговоров[" + Индекс + "].ОценкаЗамер";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Если (НЕ ЗначениеЗаполнено(Строка.ОценкаДизайн) И ЗначениеЗаполнено(Строка.КомментарийДизайн)) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + НомерСтроки + " не заполнена оценка дизайн";
			Сообщение.Поле = "СписокДоговоров[" + Индекс + "].ОценкаДизайн";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Если (НЕ ЗначениеЗаполнено(Строка.ОценкаДоставка) И ЗначениеЗаполнено(Строка.КомментарийДоставка)) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + НомерСтроки + " не заполнена оценка доставка";
			Сообщение.Поле = "СписокДоговоров[" + Индекс + "].ОценкаДоставка";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Если (НЕ ЗначениеЗаполнено(Строка.ОценкаМонтаж) И ЗначениеЗаполнено(Строка.КомментарийМонтаж)) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + НомерСтроки + " не заполнена оценка монтаж";
			Сообщение.Поле = "СписокДоговоров[" + Индекс + "].ОценкаМонтаж";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Функция ОпределитьЗамерщика(Договор)
	
	ЗамерДокумента = Договор.Спецификация.ДокументОснование;
	
	Если ТипЗнч(ЗамерДокумента) = Тип("ДокументСсылка.Замер") Тогда
		
		Возврат ЗамерДокумента.Замерщик;
		
	КонецЕсли;
	
КонецФункции