
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Подразделение <> Объект.ПодразделениеПолучатель И ЗначениеЗаполнено(Объект.ДатаПоступления) И Объект.Дата > Объект.ДатаПоступления Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = "Дата поступления не может быть меньше даты перемещения";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДатаПоступления"); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПолучательПриИзменении(Элемент)
	
	Если Объект.Подразделение = Объект.ПодразделениеПолучатель Тогда
		Элементы.ДатаПоступления.Доступность = Ложь;
	Иначе
		Элементы.ДатаПоступления.Доступность = Истина;
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Если Объект.Подразделение = Объект.ПодразделениеПолучатель Тогда
		Элементы.ДатаПоступления.Доступность = Ложь;
	Иначе
		Элементы.ДатаПоступления.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Подразделение = Объект.ПодразделениеПолучатель Тогда
		Элементы.ДатаПоступления.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры


