
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивСсылок = Новый Массив;
	
	Для каждого СпецификацияСсылка Из ПараметрКоманды Цикл
		
		МассивСсылок.Добавить(СпецификацияСсылка);
		
	КонецЦикла;
	
	Массив = ОбновитьРаскройНаСервере(МассивСсылок);
	
	Для Каждого Элемент Из Массив Цикл
		
		НашаСпецификация = Элемент.Спецификация;
		
		Если ЗначениеЗаполнено(Элемент.СтрокаКривогоПила) Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ХранимыйФайл", "КривойПил");
			ПараметрыФормы.Вставить("Спецификация", НашаСпецификация);
			ПараметрыФормы.Вставить("СтрокаКривогоПила", Элемент.СтрокаКривогоПила);
			
			Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
			
			Элемент.РисунокКривогоПила = Значение;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.СтрокаРаскрой) Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ХранимыйФайл", "НовыйРаскрой");
			ПараметрыФормы.Вставить("Спецификация", НашаСпецификация);
			ПараметрыФормы.Вставить("СтрокаНовогоРаскрояЛДСП", Элемент.СтрокаРаскрой);
			ПараметрыФормы.Вставить("ВидОтображения", "1");
			
			Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
			
			Элемент.РисунокРаскроя = Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписатьРаскрой(Массив);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьРаскройНаСервере(МассивСсылок)
	
	Массив = Новый Массив;
	
	Для Каждого Элемент Из МассивСсылок Цикл
		
		Структура = РегистрыСведений.РаскройДеталей.ПолучитьСтрокуРаскроя(Элемент);
		
		СтруктураПередачи = Новый Структура;
		СтруктураПередачи.Вставить("СтрокаКривогоПила", Структура.СтрокаКривогоПила);
		СтруктураПередачи.Вставить("ТекущаяСтрокаРаскроя", Структура.ДанныеДляРаскроя);
		СтруктураПередачи.Вставить("ТаблицаДеталей", Структура.ТаблицаДеталей);
		СтруктураПередачи.Вставить("СтрокаРаскрой", Структура.ДанныеДляРаскроя);
		СтруктураПередачи.Вставить("АлгоритмРаскроя", Структура.АлгоритмРаскроя);
		СтруктураПередачи.Вставить("Спецификация", Элемент);
		СтруктураПередачи.Вставить("РисунокКривогоПила", "");
		СтруктураПередачи.Вставить("РисунокРаскроя", "");
		
		Массив.Добавить(СтруктураПередачи);
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Функция ЗаписатьРаскрой(Массив)
	
	Для Каждого Элемент Из Массив Цикл
		
		НаборЗаписей = РегистрыСведений.РаскройДеталей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Элемент.Спецификация);
		
		НаборЗаписей.Прочитать();
		Запись = НаборЗаписей[0];
		
		Запись.РисунокРаскроя = Элемент.РисунокРаскроя;
		Запись.РисунокКривогоПила = Элемент.РисунокКривогоПила;
		Запись.СтрокаКривогоПила = Элемент.СтрокаКривогоПила;
		Запись.ТекущаяСтрокаРаскроя = Элемент.ТекущаяСтрокаРаскроя;
		Запись.ТаблицаДеталей = Элемент.ТаблицаДеталей;
		Запись.СтрокаРаскрой = Элемент.СтрокаРаскрой;
		Запись.АлгоритмРаскроя = Элемент.АлгоритмРаскроя;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецФункции