
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Для каждого СпецификацияСсылка Из ПараметрКоманды Цикл

		Элемент = ОбновитьРаскройНаСервере(СпецификацияСсылка);
		
		НашаСпецификация = Элемент.Спецификация;
		ВидОтображения = ПолучитьВидОтображенияФлэш(НашаСпецификация);
			
		Если ЗначениеЗаполнено(Элемент.СтрокаКривогоПилаФРС) Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ХранимыйФайл", "КривойПил");
			ПараметрыФормы.Вставить("Спецификация", НашаСпецификация);
			ПараметрыФормы.Вставить("СтрокаКривогоПила", Элемент.СтрокаКривогоПилаФРС);
			ПараметрыФормы.Вставить("ВидОтображения", ВидОтображения);
			
			Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
			
			Элемент.РисунокКривогоПилаФРС = Значение;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.СтрокаКривогоПилаСтеколка) Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ХранимыйФайл", "КривойПил");
			ПараметрыФормы.Вставить("Спецификация", НашаСпецификация);
			ПараметрыФормы.Вставить("СтрокаКривогоПила", Элемент.СтрокаКривогоПилаСтеколка);
			ПараметрыФормы.Вставить("ВидОтображения", ВидОтображения);
			
			Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
			
			Элемент.РисунокКривогоПилаСтеколка = Значение;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.СтрокаРаскрой) Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ХранимыйФайл", "НовыйРаскрой");
			ПараметрыФормы.Вставить("Спецификация", НашаСпецификация);
			ПараметрыФормы.Вставить("СтрокаНовогоРаскрояЛДСП", Элемент.СтрокаРаскрой);
			ПараметрыФормы.Вставить("ВидОтображения", "1");
			
			Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
			
			Элемент.РисунокРаскроя = Значение;
			
		КонецЕсли;
		
		ЗаписатьРаскрой(Элемент);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОтображенияФлэш(Спецификация) Экспорт
	
	ВидОтображения = "2";
	
	Проведен = Спецификация.Проведен;
	Статус = Документы.Спецификация.ПолучитьСтатусСпецификации(Спецификация);
	
	Если Спецификация.Дилерский И НЕ (Проведен И (Статус <> Перечисления.СтатусыСпецификации.Сохранен)) Тогда	
		ВидОтображения = "3";
	КонецЕсли;
	
	Возврат ВидОтображения;
	
КонецФункции

&НаСервере
Функция ОбновитьРаскройНаСервере(Элемент)

	Структура = РегистрыСведений.РаскройДеталей.СформироватьРаскрой(Элемент);
	
	СтруктураПередачи = Новый Структура;
	СтруктураПередачи.Вставить("СтрокаКривогоПилаФРС", Структура.СтрокаКривогоПилаФРС);
	СтруктураПередачи.Вставить("СтрокаКривогоПилаСтеколка", Структура.СтрокаКривогоПилаСтеколка);
	СтруктураПередачи.Вставить("ТекущаяСтрокаРаскроя", Структура.ДанныеДляРаскроя);
	СтруктураПередачи.Вставить("СтрокаРаскрой", Структура.ДанныеДляРаскроя);
	СтруктураПередачи.Вставить("ТаблицаДеталей", Структура.ТаблицаДеталей);
	СтруктураПередачи.Вставить("ТаблицаДеталей", Структура.ТаблицаДеталей);
	
	Попытка
		СтруктураПередачи.Вставить("ЛучшийПроцентОтхода", Структура.ЛучшийПроцентОтхода);
		СтруктураПередачи.Вставить("ВремяФормирования", Структура.ВремяФормирования);
	Исключение
		
	КонецПопытки;
	
	СтруктураПередачи.Вставить("АлгоритмРаскроя", Структура.АлгоритмРаскроя);
	СтруктураПередачи.Вставить("Спецификация", Элемент);
	СтруктураПередачи.Вставить("РисунокКривогоПилаФРС", "");
	СтруктураПередачи.Вставить("РисунокКривогоПилаСтеколка", "");
	СтруктураПередачи.Вставить("РисунокРаскроя", "");
	
	Возврат СтруктураПередачи;
	
КонецФункции

&НаСервере
Функция ЗаписатьРаскрой(Элемент)
	
	НаборЗаписей = РегистрыСведений.РаскройДеталей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Элемент.Спецификация);
	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 1 Тогда
		Запись = НаборЗаписей[0];
	Иначе
		Запись = НаборЗаписей.Добавить();
		Запись.Объект = Элемент.Спецификация;
	КонецЕсли;
	
	Запись.СтрокаРаскрой = Элемент.СтрокаРаскрой;
	Запись.ТекущаяСтрокаРаскроя = Элемент.ТекущаяСтрокаРаскроя;	
	Запись.РисунокРаскроя = Элемент.РисунокРаскроя;
	
	Запись.РисунокКривогоПилаФРС = Элемент.РисунокКривогоПилаФРС;
	Запись.РисунокКривогоПилаСтеколка = Элемент.РисунокКривогоПилаСтеколка;
	
	Запись.СтрокаКривогоПилаФРС = Элемент.СтрокаКривогоПилаФРС;
	Запись.СтрокаКривогоПилаСтеколка = Элемент.СтрокаКривогоПилаСтеколка;
	
	Попытка
		Запись.ИдеальныйПроцентОтхода = Элемент.ЛучшийПроцентОтхода;
		Запись.ВремяФормирования = Элемент.ВремяФормирования;
	Исключение
		
	КонецПопытки;
	
	Запись.ТаблицаДеталей = Элемент.ТаблицаДеталей;
	Запись.АлгоритмРаскроя = Элемент.АлгоритмРаскроя;
	
	НаборЗаписей.Записать();
	
КонецФункции