
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.Спецификация.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Спецификация", "СчетНаОплатуПокупателю", ПараметрКоманды, ПараметрыВыполненияКоманды, Неопределено);
		
КонецПроцедуры
