
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СделатьПроверкуДокументов(ПараметрКоманды);
	
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет документов для печати!";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Спецификация", "СчетНаОплатуПокупателю", ПараметрКоманды, ПараметрыВыполненияКоманды, Неопределено);
		
КонецПроцедуры

&НаСервере
Процедура СделатьПроверкуДокументов(СписокДокументов )
	
	СтруктураОбязательныхРеквизитов = Новый Структура("ЮридическоеЛицо,ЮридическийАдрес,ИНН,КПП");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спецификация.Ссылка КАК Ссылка,
	|	Спецификация.Контрагент
	|ПОМЕСТИТЬ ВТ_СписокДокументов
	|ИЗ
	|	Документ.Спецификация КАК Спецификация
	|ГДЕ
	|	Спецификация.Ссылка В(&СписокДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписокДокументов.Контрагент.Ссылка КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_СписокДокументов.Контрагент) КАК КонтрагентПредставление
	|ИЗ
	|	ВТ_СписокДокументов КАК ВТ_СписокДокументов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СписокДокументов.Контрагент";
	
	ВыборкаКонтрагентов = Запрос.Выполнить().Выбрать();
	
	Ошибки = Неопределено;
	ИсключаемыеКонтрагенты = Новый СписокЗначений;
	
	Пока ВыборкаКонтрагентов.Следующий() Цикл
		
		ТекстОшибкиДоп = "";
		ДополнительнаяСтрока = "";
		
		Контрагент = ВыборкаКонтрагентов.Контрагент;
		
		Для каждого Реквизит Из СтруктураОбязательныхРеквизитов Цикл
			
			ИмяРеквизита =  СокрЛП(Реквизит.Ключ);
			ЗаполненныйРеквизит = Контрагент.Метаданные().Реквизиты.Найти(ИмяРеквизита);
			
			Если ЗаполненныйРеквизит <> Неопределено  И НЕ ЗначениеЗаполнено(Контрагент[ИмяРеквизита]) Тогда
				
				Если ИмяРеквизита = "ЮридическоеЛицо" Тогда
					ДополнительнаяСтрока = "Счет на оплату печатается только для юр.лиц!";
				Иначе
					ТекстОшибкиДоп =  ТекстОшибкиДоп +   ?(ТекстОшибкиДоп<>"",", ","") + ИмяРеквизита;
				КонецЕсли;
				
				ИсключаемыеКонтрагенты.Добавить(Контрагент);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТекстОшибкиДоп <> "" Тогда
			ТекстОшибки = "Контрагент:  " + ВыборкаКонтрагентов.КонтрагентПредставление +". " + ДополнительнаяСтрока
			+ " Не заполнены реквизиты: " + ТекстОшибкиДоп;
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , ТекстОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	//документы
	Запрос.УстановитьПараметр("ИсключаемыеКонтрагенты",ИсключаемыеКонтрагенты);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(СписокДокументов.Ссылка)  КАК СсылкаПредставление
		|ИЗ
		|	ВТ_СписокДокументов КАК СписокДокументов
		|ГДЕ
		|	СписокДокументов.Ссылка.Контрагент В(&ИсключаемыеКонтрагенты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокДокументов.Ссылка
		|ИЗ
		|	ВТ_СписокДокументов КАК СписокДокументов
		|ГДЕ
		|	НЕ СписокДокументов.Ссылка.Контрагент В (&ИсключаемыеКонтрагенты)";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ВыборкаОтвергнутыхДокументов = РезультатЗапроса[0].Выбрать();
		
		Пока ВыборкаОтвергнутыхДокументов.Следующий() Цикл
			ТекстОшибки = "Исключены из печати документы: " + ВыборкаОтвергнутыхДокументов.СсылкаПредставление ;
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , ТекстОшибки);
		КонецЦикла;
		
		ДокументыОстались =  РезультатЗапроса[1].Выгрузить();
		
		СписокДокументов = ДокументыОстались.ВыгрузитьКолонку("Ссылка");
		
		Если Ошибки<>Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		КонецЕсли;
	
КонецПроцедуры // СделатьПроверкуДокументов()
