/// ОБРАБОТЧИКИ СОБЫТИЙ /////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Закрытие=Ложь;
	ВыборНоменклатуры.Параметры.УстановитьЗначениеПараметра("ТипНоменклатуры", Справочники.Номенклатура.ПустаяСсылка());
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНоменклатурыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.КаталогНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекстЗапроса="ВЫБРАТЬ
		             |	Номенклатура.Наименование,
		             |	Номенклатура.ЕдиницаИзмерения,
		             |	Номенклатура.ЭтоГруппа
		             |ИЗ
		             |	Справочник.Номенклатура КАК Номенклатура
		             |ГДЕ
		             |	Номенклатура.ЭтоГруппа = ЛОЖЬ
		             |	И Номенклатура.Родитель = &ТипНоменклатуры";
					 
		ВыборНоменклатурыУстановитьТекстЗапроса(ТекстЗапроса);
								   
		ГруппаНоменклатуры = ТекущиеДанные.Ссылка;
		ВыборНоменклатуры.Параметры.УстановитьЗначениеПараметра("ТипНоменклатуры", ГруппаНоменклатуры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ПоказатьФормуВводаКоличества(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПослеУдаления(Элемент)
	ВыбранныеОбновитьСтроки();
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ПолучитьДанныеПоиска(Текст);
	Элементы.ВыборНоменклатуры.Обновить();
	СтрокаПоиска=Текст;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)

	Если Выбранные.Количество()>0 И (НЕ ЭтаФорма.Закрытие)  Тогда
		
		КодДиалога = Вопрос("Выбранные элементы не перенесены в документ. Перенести?", РежимДиалогаВопрос.ДаНетОтмена, 0);
		
		Если КодДиалога=КодВозвратаДиалога.Отмена Тогда
			Отказ=Истина;	 
		КонецЕсли;
		Если КодДиалога=КодВозвратаДиалога.Да Тогда
			ЭтаФорма.Закрытие=Истина;
			ОповеститьОВыборе(Выбранные);
			Выбранные.Очистить();
		КонецЕсли;
		  	
	 КонецЕсли;
КонецПроцедуры


/// ДОПОЛНИТЕЛЬНЫЕ ФУНКЦИИ /////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПоказатьФормуВводаКоличества(Ссылка)
	
	Пар = Новый Структура("ВыбранныйЭлементСсылка",Ссылка);
	ОткрытьФорму("Документ.Спецификация.Форма.ФормаВводаКоличества", Пар, ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеОбновитьСтроки()

	НомСтроки=1;
	Для каждого Ном Из Выбранные Цикл
	
		Ном.Номер=НомСтроки;
		НомСтроки=НомСтроки+1;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеДобавитьЭлемент(Кол, Элем, СсылкаЕдиницаИзмерения) Экспорт
	
	ФлагСуществования=0;
	Для каждого Ном Из Выбранные Цикл
		
		Если Ном.Номенклатура=Элем Тогда
		
			Ном.Количество=Ном.Количество+Кол;
			ФлагСуществования=1;
			Прервать;
		
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ФлагСуществования=0 Тогда
		НоваяСтрока = Выбранные.Вставить(0);
		НоваяСтрока.Номенклатура = Элем;
		НоваяСтрока.Количество = Кол;
		НоваяСтрока.ЕдиницаИзмерения = СсылкаЕдиницаИзмерения;
		ВыбранныеОбновитьСтроки();
		Элементы.Выбранные.ТекущаяСтрока=НоваяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПоиска(Текст)
	
	МассивСтрок=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Текст," ",Истина);

	ТекстЗапроса="ВЫБРАТЬ
	             |	Номенклатура.Наименование,
	             |	Номенклатура.ЕдиницаИзмерения,
	             |	Номенклатура.ЭтоГруппа
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.ЭтоГруппа = ЛОЖЬ";
	Инд=0;
	Для каждого Стр Из МассивСтрок Цикл
	
		ТекстЗапроса=ТекстЗапроса+" И Номенклатура.Наименование ПОДОБНО &Пар"+Инд;
	    Инд=Инд+1;
	КонецЦикла; 			 
	
	ВыборНоменклатурыУстановитьТекстЗапроса(ТекстЗапроса);
	
	Инд2=0;
	Пока Инд2<Инд Цикл
	
	   ВыборНоменклатуры.Параметры.УстановитьЗначениеПараметра("Пар"+Инд2, "%"+МассивСтрок[Инд2]+"%");
	   Инд2=Инд2+1;
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Процедура ВыборНоменклатурыУстановитьТекстЗапроса(Текст)

	ВыборНоменклатуры.ТекстЗапроса=Текст;	

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ЭтаФорма.Закрытие=Истина;
	ОповеститьОВыборе(Выбранные);
	Выбранные.Очистить();
КонецПроцедуры
