&НаКлиенте
Перем РабочийКаталог;

/// ОБРАБОТЧИКИ СОБЫТИЙ /////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Закрытие=Ложь;
	Производство=Параметры.Производство;
	ВыборНоменклатуры.Параметры.УстановитьЗначениеПараметра("ТипНоменклатуры", Справочники.Номенклатура.ПустаяСсылка());
	ВыборНоменклатуры.Параметры.УстановитьЗначениеПараметра("Производство", Производство);
	
	
	Для каждого Элем Из Параметры.Комплектация Цикл
	
		НоваяСтрока = Выбранные.Добавить();
		НоваяСтрока.Номенклатура = Элем.Номенклатура;
		НоваяСтрока.Количество = Элем.Количество;
		НоваяСтрока.Кратность=Элем.Номенклатура.Кратность;
		Если Элем.НомерИзделия<>0 Тогда
			НоваяСтрока.НомерИзделия=Элем.НомерИзделия;
		КонецЕсли; 
		НоваяСтрока.ЕдиницаИзмерения = Элем.ЕдиницаИзмерения;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РабочийКаталог = ФайловыеФункцииСлужебныйКлиент.ВыбратьПутьККаталогуДанныхПользователя();
	ВыбранныеОбновитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНоменклатурыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.КаталогНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
			 
		ТекстЗапроса="ВЫБРАТЬ
					|	НоменклатураПодразделений.Номенклатура,
					|	НоменклатураПодразделений.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
					|	НоменклатураПодразделений.Номенклатура.Кратность КАК Кратность
					|ИЗ
					|	РегистрСведений.НоменклатураПодразделений КАК НоменклатураПодразделений
					|ГДЕ
					|	НоменклатураПодразделений.Номенклатура.Родитель = &ТипНоменклатуры
					|	И НоменклатураПодразделений.Подразделение = &Производство
					|	И НоменклатураПодразделений.Номенклатура.ЭтоГруппа = ЛОЖЬ
					|	И НоменклатураПодразделений.Доступность = ИСТИНА
					|   И НоменклатураПодразделений.Номенклатура.Базовый = ИСТИНА
					|   И НоменклатураПодразделений.Номенклатура.МатериалЗаказчика = ЛОЖЬ";
					 	 
		ВыборНоменклатурыУстановитьТекстЗапроса(ТекстЗапроса);
								   
		ГруппаНоменклатуры = ТекущиеДанные.Ссылка;
		ВыборНоменклатуры.Параметры.УстановитьЗначениеПараметра("ТипНоменклатуры", ГруппаНоменклатуры);
		ВыборНоменклатуры.Параметры.УстановитьЗначениеПараметра("Производство", Производство);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ПоказатьФормуВводаКоличества(Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПослеУдаления(Элемент)
	ВыбранныеОбновитьСтроки();
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ПолучитьДанныеПоиска(Текст);
	Элементы.ВыборНоменклатуры.Обновить();
	СтрокаПоиска=Текст;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)

	Если Выбранные.Количество()>0 И (НЕ ЭтаФорма.Закрытие)  Тогда
		
		КодДиалога = Вопрос("Выбранные элементы не перенесены в документ. Перенести?", РежимДиалогаВопрос.ДаНетОтмена, 0);
		
		Если КодДиалога=КодВозвратаДиалога.Отмена Тогда
			Отказ=Истина;	 
		КонецЕсли;
		Если КодДиалога=КодВозвратаДиалога.Да Тогда
			ЭтаФорма.Закрытие=Истина;
			ОповеститьОВыборе(ПолучитьАдресХранилища());
			Выбранные.Очистить();
		КонецЕсли;
		  	
	 КонецЕсли;
 КонецПроцедуры
 
&НаКлиенте
Процедура ВыборНоменклатурыПриАктивизацииСтроки(Элемент)
	
	Элементы.ВыборНоменклатуры.ТекущаяСтрока=Неопределено;
	ПоказатьКартинку(Элементы.ВыборНоменклатуры.ТекущиеДанные);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПриАктивизацииСтроки(Элемент)
	Элементы.Выбранные.ТекущаяСтрока=Неопределено;
	ПоказатьКартинку(Элементы.Выбранные.ТекущиеДанные);
КонецПроцедуры


/// ДОПОЛНИТЕЛЬНЫЕ ФУНКЦИИ /////////////////////////////////////////////////////////////////////
&НаСервере
Функция ПолучитьАдресХранилища()
	
	Возврат ПоместитьВоВременноеХранилище(Выбранные.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ПоказатьФормуВводаКоличества(Ссылка)
	
	Пар = Новый Структура("ВыбранныйЭлементСсылка",Ссылка);
	ОткрытьФорму("Документ.Спецификация.Форма.ФормаВводаКоличества", Пар, ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеОбновитьСтроки()

	НомСтроки=1;
	Для каждого Ном Из Выбранные Цикл
	
		Ном.Номер=НомСтроки;
		НомСтроки=НомСтроки+1;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеДобавитьЭлемент(Кол, Элем, ЕдиницаИзмерения, Кратность) Экспорт
	
	ФлагСуществования=0;
	Для каждого Ном Из Выбранные Цикл
		
		Если Ном.Номенклатура=Элем Тогда
		
			Ном.Количество=Ном.Количество+Кол;
			ФлагСуществования=1;
			Прервать;
		
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ФлагСуществования=0 Тогда
		НоваяСтрока = Выбранные.Вставить(0);
		НоваяСтрока.Номенклатура = Элем;
		НоваяСтрока.Количество = Кол;
		НоваяСтрока.ЕдиницаИзмерения = ЕдиницаИзмерения;
		НоваяСтрока.Кратность=Кратность;
		ВыбранныеОбновитьСтроки();
		Элементы.Выбранные.ТекущаяСтрока=НоваяСтрока.ПолучитьИдентификатор();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПоиска(Текст)
	
	МассивСтрок=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Текст," ",Истина);

	ТекстЗапроса="ВЫБРАТЬ
					|	НоменклатураПодразделений.Номенклатура,
					|	НоменклатураПодразделений.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
					|	НоменклатураПодразделений.Номенклатура.Кратность КАК Кратность
					|ИЗ
					|	РегистрСведений.НоменклатураПодразделений КАК НоменклатураПодразделений
					|ГДЕ
					|	НоменклатураПодразделений.Подразделение = &Производство
					|	И НоменклатураПодразделений.Номенклатура.ЭтоГруппа = ЛОЖЬ
					|	И НоменклатураПодразделений.Доступность = ИСТИНА
					|   И НоменклатураПодразделений.Номенклатура.Базовый = ИСТИНА
					|   И НоменклатураПодразделений.Номенклатура.МатериалЗаказчика = ЛОЖЬ";
	Инд=0;
	Для каждого Стр Из МассивСтрок Цикл
	
		ТекстЗапроса=ТекстЗапроса+" И НоменклатураПодразделений.Номенклатура.Наименование ПОДОБНО &Пар"+Инд;
	    Инд=Инд+1;
	КонецЦикла; 			 
	
	ВыборНоменклатурыУстановитьТекстЗапроса(ТекстЗапроса);
	
	Инд2=0;
	Пока Инд2<Инд Цикл
	
	   ВыборНоменклатуры.Параметры.УстановитьЗначениеПараметра("Пар"+Инд2, "%"+МассивСтрок[Инд2]+"%");
	   Инд2=Инд2+1;
    КонецЦикла;
   
   ВыборНоменклатуры.Параметры.УстановитьЗначениеПараметра("Производство", Производство);

КонецПроцедуры

&НаСервере
Процедура ВыборНоменклатурыУстановитьТекстЗапроса(Текст)

	ВыборНоменклатуры.ТекстЗапроса=Текст;	

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ЭтаФорма.Закрытие=Истина;
	ОповеститьОВыборе(ПолучитьАдресХранилища());
	Выбранные.Очистить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКодНоменклатуры(Ссылка)
	
	Возврат Ссылка.Код;

КонецФункции

&НаКлиенте
Процедура ПоказатьКартинку(Элемент)
	
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;      	
	
	Попытка
		Код=ПолучитьКодНоменклатуры(Элемент.Номенклатура);
		Код = СокрЛП(Код);
		ПутьКИзображению = РабочийКаталог + Код + ".jpg";
		ФайлНаДиске = Новый Файл(ПутьКИзображению);
		
		Если ФайлНаДиске.Существует() Тогда
			Изображение = "<html><head><META HTTP-EQUIV=""Pragma"" CONTENT=""no-cache""></head><body bottommargin=""0"" topmargin=""0"" leftmargin=""0"" rightmargin=""0""><img src="""+ПутьКИзображению+""" height=100% /></body></html>";
		Иначе
			Изображение = "";
		КонецЕсли;
		
	Исключение;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеКоличествоПриИзменении(Элемент)
	
	Кратн=Элементы.Выбранные.ТекущиеДанные.Кратность;
	
	Если Кратн<>0 Тогда
		Кол=Элементы.Выбранные.ТекущиеДанные.Количество;
		Кол = Кратн*Цел(Кол/Кратн);
		Элементы.Выбранные.ТекущиеДанные.Количество=Кол;
	КонецЕсли;
	
КонецПроцедуры
