&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыборНоменклатуры.Параметры.УстановитьЗначениеПараметра("ТипНоменклатуры", Справочники.Номенклатура.ПустаяСсылка());
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНоменклатурыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.КаталогНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ГруппаНоменклатуры = ТекущиеДанные.Ссылка;
		ВыборНоменклатуры.Параметры.УстановитьЗначениеПараметра("ТипНоменклатуры", ГруппаНоменклатуры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ПоказатьФормуВводаКоличества(ВыбраннаяСтрока.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуВводаКоличества(Ссылка)
	
	
КонецПроцедуры;

