
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Режим = РежимДиалогаВопрос.ДаНет;
	Текст = "Виновный будет изменен." + Символы.ПС + "Продолжить?" ;
	
	Если Вопрос(Текст, Режим, 0) = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Сотрудник = ОткрытьФормуМодально("Справочник.ФизическиеЛица.ФормаВыбора", , ПараметрыВыполненияКоманды.Источник);
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		УстановитьВиновного(ПараметрКоманды, Сотрудник);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьВиновного(Спецификация, Сотрудник)
	
	ДокументСпецификация = Спецификация.ПолучитьОбъект();
	ДокументСпецификация.Виновный = Сотрудник;
	РежимЗаписи = ?(ДокументСпецификация.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
	ДокументСпецификация.Записать(РежимЗаписи);
		
КонецПроцедуры
