
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ФормироватьРаскрой = Истина;
	
	Если ФормироватьРаскрой Тогда
		
		Массив = ОбновитьРаскройНаСервере(ПараметрКоманды);
		
		Для Каждого Элемент Из Массив Цикл
			
			НашНарядЗадание = Элемент.НарядЗадание;
			
			Если ЗначениеЗаполнено(Элемент.СтрокаКривогоПила) Тогда
				
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("ХранимыйФайл", "КривойПил");
				ПараметрыФормы.Вставить("Спецификация", НашНарядЗадание);
				ПараметрыФормы.Вставить("СтрокаКривогоПила", Элемент.СтрокаКривогоПила);
				
				Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
				
				Элемент.РисунокКривогоПила = Значение;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Элемент.СтрокаРаскрой) Тогда
				
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("ХранимыйФайл", "НовыйРаскрой");
				ПараметрыФормы.Вставить("Спецификация", НашНарядЗадание);
				ПараметрыФормы.Вставить("СтрокаНовогоРаскрояЛДСП", Элемент.СтрокаРаскрой);
				ПараметрыФормы.Вставить("ВидОтображения", "1");
				
				Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
				
				Элемент.РисунокРаскроя = Значение;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗаписатьРаскрой(Массив);
		
	КонецЕсли;
	
	ХранимыйФайлРаскрой = "НовыйРаскрой";
	ХранимыйФайлКривойПил = "КривойПил";
	
	МассивСсылок = Новый Массив;
	
	МассивСсылок.Добавить(ПараметрКоманды);
	
	МассивСтрок = ОпределительРаскроя(МассивСсылок);
	
	Для каждого Определитель Из МассивСтрок Цикл
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СпецификацияСсылка", Определитель.Ссылка);
		
		//Если есть детали ЛДСП открываем флэш "раскрой"
		Если ЗначениеЗаполнено(Определитель.СтрокаНовогоРаскрояЛДСП) Тогда
			
			ПараметрыФормы.Вставить("Спецификация", Определитель.Ссылка);
			ПараметрыФормы.Вставить("ХранимыйФайл", ХранимыйФайлРаскрой);
			ПараметрыФормы.Вставить("СтрокаНовогоРаскрояЛДСП", Определитель.СтрокаНовогоРаскрояЛДСП);
			ПараметрыФормы.Вставить("ВидОтображения", "2");
			ОткрытьФорму("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы,, Истина);
			
		КонецЕсли;
		
		// Если есть детали ЛДСП или стекла с кривым пилом открываем флэш для "кривого пила"
		Если ЗначениеЗаполнено(Определитель.СтрокаКривогоПила) Тогда
			
			ПараметрыФормы.Вставить("Спецификация", Определитель.Ссылка);
			ПараметрыФормы.Вставить("ХранимыйФайл", ХранимыйФайлКривойПил);
			ПараметрыФормы.Вставить("СтрокаКривогоПила", Определитель.СтрокаКривогоПила);
			
			РисунокКривогоПила = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
			
			ЗаписатьРисункиКривойПил(РисунокКривогоПила, Определитель.Ссылка);
			
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Спецификация", "КриволинейныеДетали", ПараметрКоманды, ПараметрыВыполненияКоманды, Неопределено);
	
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Функция ОбновитьРаскройНаСервере(НарядЗадание)
	
	Массив = Новый Массив;
	Структура = РегистрыСведений.РаскройДеталей.СформироватьРаскрой(НарядЗадание);
	
	СтруктураПередачи = Новый Структура;
	СтруктураПередачи.Вставить("СтрокаКривогоПила", Структура.СтрокаКривогоПила);
	СтруктураПередачи.Вставить("ТекущаяСтрокаРаскроя", Структура.ДанныеДляРаскроя);
	СтруктураПередачи.Вставить("СтрокаРаскрой", Структура.ДанныеДляРаскроя);
	СтруктураПередачи.Вставить("ТаблицаДеталей", Структура.ТаблицаДеталей);
	СтруктураПередачи.Вставить("ТаблицаДеталей", Структура.ТаблицаДеталей);
	
	Попытка
		СтруктураПередачи.Вставить("ЛучшийПроцентОтхода", Структура.ЛучшийПроцентОтхода);
		СтруктураПередачи.Вставить("ВремяФормирования", Структура.ВремяФормирования);
	Исключение
		
	КонецПопытки;
	
	СтруктураПередачи.Вставить("АлгоритмРаскроя", Структура.АлгоритмРаскроя);
	СтруктураПередачи.Вставить("НарядЗадание", НарядЗадание);
	СтруктураПередачи.Вставить("РисунокКривогоПила", "");
	СтруктураПередачи.Вставить("РисунокРаскроя", "");
	
	Массив.Добавить(СтруктураПередачи);
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Функция ЗаписатьРаскрой(Массив)
	
	Для Каждого Элемент Из Массив Цикл
		
		НаборЗаписей = РегистрыСведений.РаскройДеталей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Элемент.НарядЗадание);
		
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 1 Тогда
			Запись = НаборЗаписей[0];
		Иначе
			Запись = НаборЗаписей.Добавить();
			Запись.Объект = Элемент.НарядЗадание;
		КонецЕсли;
		
		Запись.СтрокаРаскрой = Элемент.СтрокаРаскрой;
		Запись.ТекущаяСтрокаРаскроя = Элемент.ТекущаяСтрокаРаскроя;	
		Запись.РисунокРаскроя = Элемент.РисунокРаскроя;
		Запись.РисунокКривогоПила = Элемент.РисунокКривогоПила;
		Запись.СтрокаКривогоПила = Элемент.СтрокаКривогоПила;
		
		// { Васильев Александр Леонидович [09.08.2015]
		// Сделать одинаковый формат возврата структуры
		// } Васильев Александр Леонидович [09.08.2015]
		
		Попытка
			Запись.ИдеальныйПроцентОтхода = Элемент.ЛучшийПроцентОтхода;
			Запись.ВремяФормирования = Элемент.ВремяФормирования;
		Исключение
			
		КонецПопытки;
		
		Запись.ТаблицаДеталей = Элемент.ТаблицаДеталей;
		Запись.АлгоритмРаскроя = Элемент.АлгоритмРаскроя;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ЗаписатьРисункиКривойПил(РисунокКривогоПила, СпецификацияСсылка)
	
	НаборЗаписей = РегистрыСведений.РаскройДеталей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(СпецификацияСсылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей[0];
	
	Если Запись <> Неопределено Тогда
		
		Запись.РисунокКривогоПила = РисунокКривогоПила;	
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ОпределительРаскроя(МассивСсылок)
	
	МассивСтрок = Новый Массив;
	
	Для каждого Ссылка Из МассивСсылок Цикл
		
		Структура = Новый Структура;
		Структура.Вставить("Ссылка", Ссылка);
		Структура.Вставить("СтрокаНовогоРаскрояЛДСП", "");
		Структура.Вставить("СтрокаКривогоПила", "");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Спецификация", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(РаскройДеталей.Объект КАК Документ.Спецификация) КАК Ссылка,
		|	РаскройДеталей.СтрокаРаскрой КАК Раскрой,
		|	РаскройДеталей.СтрокаКривогоПила КАК СтрокаКривогоПила
		|ИЗ
		|	РегистрСведений.РаскройДеталей КАК РаскройДеталей
		|ГДЕ
		|	РаскройДеталей.Объект= &Спецификация";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Раскрой) Тогда
				Структура.Вставить("СтрокаНовогоРаскрояЛДСП", Выборка.Раскрой);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.СтрокаКривогоПила) Тогда
				Структура.Вставить("СтрокаКривогоПила", Выборка.СтрокаКривогоПила);
			КонецЕсли;
			
		КонецЦикла;
		
		МассивСтрок.Добавить(Структура);
		
	КонецЦикла;
	
	Возврат МассивСтрок;
	
КонецФункции
