
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ХранимыйФайлРаскрой = "НовыйРаскрой";
	ХранимыйФайлКривойПил = "КривойПил";
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ФиксированныйКомплект", Ложь);
	ПараметрыПечати.Вставить("ПереопределитьПользовательскиеНастройкиКоличества", Истина);
	
	СписокСпецификаций = ПолучитьСписокСпецификаций(ПараметрКоманды);
	
	Для Каждого Спец Из СписокСпецификаций Цикл
		
		ЕстьНеноменклатурный = ПроверитьНеноменклатурныйМатериал(Спец);
		
		Если ЕстьНеноменклатурный Тогда
			
			 ПараметрыРаскрой = ОбновитьРаскройНаСервере(Спец);
			 ПолучитьИЗаписатьРаскрой(ПараметрыРаскрой);
			
			 УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Спецификация", "Раскрой", Спец, ПараметрыВыполненияКоманды.Источник, ПараметрыПечати);
			
		КонецЕсли;
		
	КонецЦикла;
	
	МассивСсылок = Новый Массив;
	
	МассивСсылок.Добавить(ПараметрКоманды);
	
	МассивСтрок = ОпределительРаскроя(МассивСсылок);
	
	Для каждого Определитель Из МассивСтрок Цикл
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СпецификацияСсылка", Определитель.Ссылка);
		
		//Если есть детали ЛДСП открываем флэш "раскрой"
		Если ЗначениеЗаполнено(Определитель.СтрокаНовогоРаскрояЛДСП) Тогда
			
			ПараметрыФормы.Вставить("Спецификация", Определитель.Ссылка);
			ПараметрыФормы.Вставить("ХранимыйФайл", ХранимыйФайлРаскрой);
			ПараметрыФормы.Вставить("СтрокаНовогоРаскрояЛДСП", Определитель.СтрокаНовогоРаскрояЛДСП);
			ПараметрыФормы.Вставить("ВидОтображения", "2");
			ОткрытьФорму("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы,, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция ОпределительРаскроя(МассивСсылок)
	
	МассивСтрок = Новый Массив;
	
	Для каждого Ссылка Из МассивСсылок Цикл
		
		Структура = Новый Структура;
		Структура.Вставить("Ссылка", Ссылка);
		Структура.Вставить("СтрокаНовогоРаскрояЛДСП", "");
		Структура.Вставить("СтрокаКривогоПилаФРС", "");
		Структура.Вставить("СтрокаКривогоПилаСтеколка", "");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НарядЗадание", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(РаскройДеталей.Объект КАК Документ.НарядЗадание) КАК Ссылка,
		|	РаскройДеталей.СтрокаРаскрой КАК Раскрой,
		|	РаскройДеталей.СтрокаКривогоПилаФРС КАК СтрокаКривогоПилаФРС,
		|	РаскройДеталей.СтрокаКривогоПилаСтеколка КАК СтрокаКривогоПилаСтеколка
		|ИЗ
		|	РегистрСведений.РаскройДеталей КАК РаскройДеталей
		|ГДЕ
		|	РаскройДеталей.Объект = &НарядЗадание";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Раскрой) Тогда
				Структура.Вставить("СтрокаНовогоРаскрояЛДСП", Выборка.Раскрой);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.СтрокаКривогоПилаФРС) Тогда
				Структура.Вставить("СтрокаКривогоПилаФРС", Выборка.СтрокаКривогоПилаФРС);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.СтрокаКривогоПилаСтеколка) Тогда
				Структура.Вставить("СтрокаКривогоПилаСтеколка", Выборка.СтрокаКривогоПилаСтеколка);
			КонецЕсли;
			
		КонецЦикла;
		
		МассивСтрок.Добавить(Структура);
		
	КонецЦикла;
	
	Возврат МассивСтрок;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокСпецификаций(Наряд)
	
	Мас = Новый Массив();
	
	Для Каждого Строка ИЗ Наряд.СписокСпецификаций Цикл
		
		Мас.Добавить(Строка.Спецификация);
		
	КонецЦикла;
	
	Возврат Мас;
	
КонецФункции

&НаСервере
Функция ОбновитьРаскройНаСервере(Элемент)
	
	Возврат Документы.Спецификация.ОбновитьРаскройНаСервере(Элемент);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьИЗаписатьРаскрой(Элемент)
	
	НашаСпецификация = Элемент.Спецификация;	
	ВидОтображения = "1";
	
	Если ЗначениеЗаполнено(Элемент.СтрокаРаскрой) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ХранимыйФайл", "НовыйРаскрой");
		ПараметрыФормы.Вставить("Спецификация", НашаСпецификация);
		ПараметрыФормы.Вставить("СтрокаНовогоРаскрояЛДСП", Элемент.СтрокаРаскрой);
		ПараметрыФормы.Вставить("ВидОтображения", ВидОтображения);
		
		Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
		
		Элемент.РисунокРаскроя = Значение;
		
	КонецЕсли;
	
	ЗаписатьРаскрой(Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРаскрой(Элемент)
	
	Документы.Спецификация.ЗаписатьРаскрой(Элемент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОтображенияРаскрой(Спецификация) Экспорт
	
	Возврат Документы.Спецификация.ПолучитьВидОтображенияРаскрой(Спецификация);
	
КонецФункции

&НаСервере
Функция ПроверитьНеноменклатурныйМатериал(Спецификация)
	
	ЕстьНоменклатурный = Ложь;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпецификацияСписокНоменклатуры.Номенклатура
	|ИЗ
	|	Документ.Спецификация.СписокНоменклатуры КАК СпецификацияСписокНоменклатуры
	|ГДЕ
	|	СпецификацияСписокНоменклатуры.Номенклатура.Неноменклатурный
	|	И СпецификацияСписокНоменклатуры.Номенклатура.НоменклатурнаяГруппа.ВидМатериала = ЗНАЧЕНИЕ(Перечисление.ВидыМатериалов.Листовой)
	|	И СпецификацияСписокНоменклатуры.Ссылка = &Спецификация";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		 ЕстьНоменклатурный = Истина;
	КонецЕсли;
	 
	Возврат ЕстьНоменклатурный;
	
КонецФункции

