
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ХранимыйФайлРаскрой = "НовыйРаскрой";
	ХранимыйФайлКривойПил = "КривойПил";
	
	МассивСсылок = Новый Массив;
	
	МассивСсылок.Добавить(ПараметрКоманды);
	
	МассивСтрок = ОпределительРаскроя(МассивСсылок);
	
	Для каждого Определитель Из МассивСтрок Цикл
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СпецификацияСсылка", Определитель.Ссылка);
		
		//Если есть детали ЛДСП открываем флэш "раскрой"
		Если ЗначениеЗаполнено(Определитель.СтрокаНовогоРаскрояЛДСП) Тогда
			
			ПараметрыФормы.Вставить("Спецификация", Определитель.Ссылка);
			ПараметрыФормы.Вставить("ХранимыйФайл", ХранимыйФайлРаскрой);
			ПараметрыФормы.Вставить("СтрокаНовогоРаскрояЛДСП", Определитель.СтрокаНовогоРаскрояЛДСП);
			ПараметрыФормы.Вставить("ВидОтображения", "2");
			ОткрытьФорму("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы,, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Функция ОпределительРаскроя(МассивСсылок)
	
	МассивСтрок = Новый Массив;
	
	Для каждого Ссылка Из МассивСсылок Цикл
		
		Структура = Новый Структура;
		Структура.Вставить("Ссылка", Ссылка);
		Структура.Вставить("СтрокаНовогоРаскрояЛДСП", "");
		Структура.Вставить("СтрокаКривогоПилаФРС", "");
		Структура.Вставить("СтрокаКривогоПилаСтеколка", "");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НарядЗадание", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(РаскройДеталей.Объект КАК Документ.НарядЗадание) КАК Ссылка,
		|	РаскройДеталей.СтрокаРаскрой КАК Раскрой,
		|	РаскройДеталей.СтрокаКривогоПилаФРС КАК СтрокаКривогоПилаФРС,
		|	РаскройДеталей.СтрокаКривогоПилаСтеколка КАК СтрокаКривогоПилаСтеколка
		|ИЗ
		|	РегистрСведений.РаскройДеталей КАК РаскройДеталей
		|ГДЕ
		|	РаскройДеталей.Объект = &НарядЗадание";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Раскрой) Тогда
				Структура.Вставить("СтрокаНовогоРаскрояЛДСП", Выборка.Раскрой);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.СтрокаКривогоПилаФРС) Тогда
				Структура.Вставить("СтрокаКривогоПилаФРС", Выборка.СтрокаКривогоПилаФРС);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.СтрокаКривогоПилаСтеколка) Тогда
				Структура.Вставить("СтрокаКривогоПилаСтеколка", Выборка.СтрокаКривогоПилаСтеколка);
			КонецЕсли;
			
		КонецЦикла;
		
		МассивСтрок.Добавить(Структура);
		
	КонецЦикла;
	
	Возврат МассивСтрок;
	
КонецФункции
