
//Процедура ПередЗаписью(Отказ)
//	
//	// dmn 2012_01_21
//	// проверить правильность заполнения шкал скидок
//	// толково не получается, ерунда какая-то выходит
//	
//	Для каждого Шкала Из ШкалаСкидок Цикл
//		
//		Отказ = Шкала.НачальнаяСумма > Шкала.КонечнаяСумма;
//		Если Отказ Тогда
//			СообщитьОбОшибке(Шкала.НомерСтроки-1);
//			Продолжить;
//		КонецЕсли;
//		
//		Для каждого Сравнить Из ШкалаСкидок Цикл
//			Если Шкала = Сравнить Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			Если (Шкала.НачальнаяСумма >= Сравнить.НачальнаяСумма И 	Шкала.НачальнаяСумма <= Сравнить.КонечнаяСумма)
//				ИЛИ (Шкала.КонечнаяСумма >= Сравнить.НачальнаяСумма И Шкала.НачальнаяСумма <= Сравнить.КонечнаяСумма) Тогда
//				СообщитьОбОшибке(Шкала.НомерСтроки-1);
//				Отказ = Истина;
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//	КонецЦикла;
//	
//КонецПроцедуры

//Процедура СообщитьОбОшибке(НомерСтроки)

//	Сообщение = Новый СообщениеПользователю;
//	Сообщение.Текст = "Проверьте правильность заполнения шкалы";
//	Сообщение.Поле = "ШкалаСкидок["+ НомерСтроки +"].НомерСтроки";
//	Сообщение.УстановитьДанные(ЭтотОбъект);
//	Сообщение.Сообщить();

//КонецПроцедуры
