Перем НоваяНоменклатура;

Процедура ПередЗаписью(Отказ)
	
	Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
		Базовый = Истина;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа И Базовый Тогда
		КоэффициентБазовых = 1;
	КонецЕсли;
	
	НоваяНоменклатура = ЭтоНовый();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ошибки = Неопределено;
	
	Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал И НЕ Базовый И БазоваяНоменклатура.Пустая() Тогда
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "БазоваяНоменклатура", "Заполните базовую номенклатуру");
		
	КонецЕсли;
	
	Если НЕ ЭтоГруппа 
		И (НоменклатурнаяГруппа.ПринадлежитЭлементу(Справочники.НоменклатурныеГруппы.Кромка)
		ИЛИ НоменклатурнаяГруппа.ПринадлежитЭлементу(Справочники.НоменклатурныеГруппы.Кант)) Тогда
		
		Сообщить("Этакромка");
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НоваяНоменклатура И НЕ ЭтоГруппа И НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.Гравировка Тогда
		
		ДоступностьПодразделению = РегистрыСведений.НоменклатураПодразделений;
		НаборПодразделение = ДоступностьПодразделению.СоздатьНаборЗаписей();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВидПодразделения", Перечисления.ВидыПодразделений.Производство);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подразделения.Ссылка
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.ВидПодразделения = &ВидПодразделения";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = НаборПодразделение.Добавить();
			НоваяСтрока.Номенклатура = Ссылка;
			НоваяСтрока.Подразделение = Выборка.Ссылка;
			НоваяСтрока.Доступность = Истина;
		КонецЦикла;
		
		НаборПодразделение.Записать(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры
