
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОсновныеСредства.Записать();
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("ТЧОсновныеСредства", ОсновныеСредства.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеОСОсновныеСредства.НомерСтроки,
	|	ПеремещениеОСОсновныеСредства.ОС,
	|	ПеремещениеОСОсновныеСредства.МОЛОтправитель,
	|	ПеремещениеОСОсновныеСредства.МОЛПолучатель
	|ПОМЕСТИТЬ тчДок
	|ИЗ
	|	&ТЧОсновныеСредства КАК ПеремещениеОСОсновныеСредства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчДок.НомерСтроки,
	|	тчДок.ОС,
	|	тчДок.МОЛОтправитель,
	|	тчДок.МОЛПолучатель,
	|	ЕСТЬNULL(СостояниеОССрезПоследних.МОЛ, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК МОЛОстаток,
	|	СостояниеОССрезПоследних.НачислятьАмортизацию,
	|	СостояниеОССрезПоследних.СрокАмортизации,
	|	СостояниеОССрезПоследних.Стоимость,
	|	СостояниеОССрезПоследних.Регистратор
	|ИЗ
	|	тчДок КАК тчДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредства.СрезПоследних(
	|				&МоментВремени,
	|				ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						т.ОС
	|					ИЗ
	|						тчДок КАК т)) КАК СостояниеОССрезПоследних
	|		ПО тчДок.ОС = СостояниеОССрезПоследних.ОсновноеСредство";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.МОЛОтправитель <> Выборка.МОЛОстаток Тогда
			С = Новый СообщениеПользователю;
			С.Текст = "У МОЛа " + Выборка.МОЛОтправитель + " нет в подотчете " + Выборка.ОС;
			С.УстановитьДанные(ЭтотОбъект);
			С.Поле = "ОсновныеСредства[" + (Выборка.НомерСтроки-1) + "].ОС";
			С.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		//littox Литус Антон - 30.10.2014
		//Тут просто изменяем МОЛ у существующей записи
		//Вопрос в том, насколько это правильно
		//30.10.2014 - littox Литус Антон
		
		НаборЗаписейОС = РегистрыСведений.ОсновныеСредства.СоздатьНаборЗаписей();
		НаборЗаписейОС.Отбор.Регистратор.Значение = Выборка.Регистратор;
		НаборЗаписейОС.Прочитать();
		
		Для каждого Запись Из НаборЗаписейОС Цикл
		
			Запись.МОЛ = Выборка.МОЛПолучатель;
		
		КонецЦикла;
		НаборЗаписейОС.Записать();
		
		//littox Литус Антон - 01.11.2014
		//Так не получается, т.к. если поменять сначала мол 1, а потом вернуть с мол1 на того что стоял изначально,
		// то не дает записать в регистр т.к. совпдают ключи
		//01.11.2014 - littox Литус Антон
		
		//Проводки = Движения.ОсновныеСредства.Добавить();
		//Проводки.Период = Дата;
		//Проводки.ОсновноеСредство = Выборка.ОС;
		//Проводки.МОЛ = Выборка.МОЛПолучатель;
		//Проводки.НачислятьАмортизацию = Выборка.НачислятьАмортизацию;
		//Проводки.СрокАмортизации = Выборка.СрокАмортизации;
		//Проводки.Стоимость = Выборка.Стоимость;

	КонецЦикла;
	
	//Если НЕ Отказ Тогда
	//	Движения.СостояниеОС.Записывать = Истина;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры
