
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.СостояниеОС.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеОСОсновныеСредства.НомерСтроки,
	|	ПеремещениеОСОсновныеСредства.ОС,
	|	ПеремещениеОСОсновныеСредства.МОЛОтправитель,
	|	ПеремещениеОСОсновныеСредства.МОЛПолучатель
	|ПОМЕСТИТЬ тчДок
	|ИЗ
	|	Документ.ПеремещениеОС.ОсновныеСредства КАК ПеремещениеОСОсновныеСредства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчДок.НомерСтроки,
	|	тчДок.ОС,
	|	тчДок.МОЛОтправитель,
	|	тчДок.МОЛПолучатель,
	|	ЕСТЬNULL(СостояниеОССрезПоследних.МОЛ, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК МОЛОстаток,
	|	СостояниеОССрезПоследних.НачислятьАмортизацию,
	|	СостояниеОССрезПоследних.ПринятоКУчету,
	|	СостояниеОССрезПоследних.СрокАмортизации,
	|	СостояниеОССрезПоследних.ПервоначальнаяСтоимость,
	|	ОсновныеСредстваОстатки.СуммаОстаток
	|ИЗ
	|	тчДок КАК тчДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеОС.СрезПоследних(
	|				&МоментВремени,
	|				ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						т.ОС
	|					ИЗ
	|						тчДок КАК т)) КАК СостояниеОССрезПоследних
	|		ПО тчДок.ОС = СостояниеОССрезПоследних.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОсновныеСредства.Остатки(
	|				&МоментВремени,
	|				ОсновноеСредство В
	|						(ВЫБРАТЬ
	|							т.ОС
	|						ИЗ
	|							тчДок КАК т)
	|					И Подразделение = &Подразделение) КАК ОсновныеСредстваОстатки
	|		ПО тчДок.ОС = ОсновныеСредстваОстатки.ОсновноеСредство";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.МОЛОтправитель <> Выборка.МОЛОстаток Тогда
			С = Новый СообщениеПользователю;
			С.Текст = "У МОЛа " + Выборка.МОЛОтправитель + " нет в подотчете " + Выборка.ОС;
			С.УстановитьДанные(ЭтотОбъект);
			С.Поле = "ОсновныеСредства[" + (Выборка.НомерСтроки-1) + "].ОС";
			С.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		
		// dmn 2011_12_05
		// движения по периодическому регистру сведений СостояниеОС
		
		Проводки = Движения.СостояниеОС.Добавить();
		Проводки.Период = Дата;
		Проводки.ОсновноеСредство = Выборка.ОС;
		Проводки.МОЛ = Выборка.МОЛПолучатель;
		Проводки.НачислятьАмортизацию = Выборка.НачислятьАмортизацию;
		Проводки.СрокАмортизации = Выборка.СрокАмортизации;
		Проводки.ПринятоКУчету = Выборка.ПринятоКУчету;
		Проводки.ПервоначальнаяСтоимость = Выборка.ПервоначальнаяСтоимость;
		
		// перемещение на другое подразделение
		Если Подразделение <> ПодразделениеПолучатель Тогда
			// перекинуть остаточную стоимость и амортизацию
			// так же толкнуть взаиморасчеты
			
			// списываем сумму ОС
			Проводки = Движения.ОсновныеСредства.ДобавитьРасход();
			Проводки.Период = Дата;
			Проводки.Подразделение = Подразделение;
			Проводки.ОсновноеСредство = Выборка.ОС;
			Проводки.Сумма = Выборка.СуммаОстаток;
			
			// приходуем суммы ОС
			Проводки = Движения.ОсновныеСредства.ДобавитьПриход();
			Проводки.Период = Дата;
			Проводки.Подразделение = ПодразделениеПолучатель;
			Проводки.ОсновноеСредство = Выборка.ОС;
			Проводки.Сумма = Выборка.СуммаОстаток;
			
			// взаиморасчеты
			Проводки = Движения.ВнутренниеВзаиморасчеты.ДобавитьПриход();
			Проводки.Период = Дата;
			Проводки.Подразделение1 = Подразделение;
			Проводки.Подразделение2 = ПодразделениеПолучатель;
			Проводки.Сумма = Выборка.СуммаОстаток;
			
			Проводки = Движения.ВнутренниеВзаиморасчеты.ДобавитьРасход();
			Проводки.Период = Дата;
			Проводки.Подразделение1 = ПодразделениеПолучатель;
			Проводки.Подразделение2 = Подразделение;
			Проводки.Сумма = Выборка.СуммаОстаток;
			
		КонецЕсли;

	КонецЦикла;
	
	//Если НЕ Отказ Тогда
	//	Движения.СостояниеОС.Записывать = Истина;
	//КонецЕсли;
	
КонецПроцедуры