// Здесь будем формировать файл в формет PTX для конвертера CadLink станка Holzma
// Описание формата файла:
// http://esupport.cabnetware.com/Help/NcCenter21Help/Menu_Bar/Utilities/Machine_Catalog/NC_Links/Saw_Links/Holzma.htm

#Область Общего_назначения

Функция Сформировать(фнПараметры) Экспорт
	
	ТекстФайла = СформироватьТекстФайла(фнПараметры);
	
КонецФункции

Функция СформироватьСтрокуИзМассива(фнМассив, Разделитель)
	
	Результат = "";
	
	Для каждого Элемент Из фнМассив Цикл
		
		Если ТипЗнч(Элемент) = Тип("Число") Тогда
			
			ЭлементСтрокой = Формат(Элемент, "ЧРД = . ; ЧГ = ")
			
		Иначе
			
			ЭлементСтрокой = Элемент;
			
		КонецЕсли;
		
		
		Результат = Результат + ЭлементСтрокой + Разделитель;
		
	КонецЦикла;
	
	ДлинаРазделителя = СтрДлина(Разделитель);
	ДлинаРезультата = СтрДлина(Результат);
	Результат = Лев(Результат, ДлинаРезультата - ДлинаРазделителя);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Формирование_текста_файла

Функция СформироватьТекстФайла(фнПараметры)
	
	Текст = Новый ТекстовыйДокумент;
	
	Текст.ДобавитьСтроку(HEADER());
	Текст.ДобавитьСтроку("");
	
	Текст.ДобавитьСтроку(JOBS(фнПараметры));
	Текст.ДобавитьСтроку("");
	
КонецФункции

Функция HEADER()
	
	// В примере выглядит так:
	//HEADER,1.08,,0,0,1
	
	//HEADER – VERSION,  TITLE,  UNITS,  ORIGIN,  TRIM_TYPE 
	
	// Я так понял, с которого угла формируется раскрой, будем пробовать.
	
	//	ORIGIN - This field indicates the origin for the VECTOR drawing records.  The origin for the CUT records is assumed to be 0 (top left).
	//0 = top to bottom - left to right
	//1 =  top to bottom – right to left
	//2 = bottom to top – left to right
	//3 = bottom to top – right to left
	
	// TRIM_TYPE -- подрезка деталей, не понял что где, будем смотреть
	
	Массив = Новый Массив;
	
	Массив.Добавить("HEADER");
	Массив.Добавить("1.08");
	Массив.Добавить(); // TITLE Сюда можно будет наряд выписать
	Массив.Добавить(0); // UNITS
	Массив.Добавить(0); // ORIGIN
	Массив.Добавить(1); // TRIM_TYPE
	
	Результат = СформироватьСтрокуИзМассива(Массив, ", ");
	
	Возврат Результат;
	
КонецФункции

Функция JOBS(фнПараметры)
	
	// В этом разделе перечислим спецификации.
	
	// В примере выглядит так:
	//JOBS,1,SHkaf DSP buk 16,,,,,1,SHkaf DSP buk 16,SHkaf DSP buk 16,90,21.1
	
	
	
	
КонецФункции

#КонецОбласти
