
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Строка Из СписокДоговоров Цикл
		
		Если Строка.ОбщаяОценка = Перечисления.Оценки.Претензия Тогда
			
			Если НЕ ЗначениеЗаполнено(Документы.СлужебнаяЗаписка.НайтиПоРеквизиту("Документ", Строка.Договор)) Тогда
				
				НовыйДокумент = Документы.СлужебнаяЗаписка.СоздатьДокумент();
				НовыйДокумент.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.ПретензияЗаявление;
				НовыйДокумент.Проблема = Строка.ОбщийКомментарий;
				НовыйДокумент.Адресат = Константы.ГенеральныйДиректор.Получить();
				НовыйДокумент.Тема = "Претензия к " + Строка.Договор;
				НовыйДокумент.Документ = Строка.Договор;
				НовыйДокумент.Дата = ТекущаяДата();
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры
