
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Строка Из СписокДоговоров Цикл
		
		Если Строка.ОбщаяОценка = Перечисления.Оценки.Претензия Тогда
			
			Если НЕ ЗначениеЗаполнено(Документы.СлужебнаяЗаписка.НайтиПоРеквизиту("Документ", Строка.Договор)) Тогда
				
				НовыйДокумент = Документы.СлужебнаяЗаписка.СоздатьДокумент();
				НовыйДокумент.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.ПретензияЗаявление;
				НовыйДокумент.Проблема = Строка.ОбщийКомментарий;
				НовыйДокумент.Адресат = Константы.ГенеральныйДиректор.Получить();
				НовыйДокумент.Тема = "Претензия к " + Строка.Договор;
				НовыйДокумент.Документ = Строка.Договор;
				НовыйДокумент.Дата = ТекущаяДата();
				НовыйДокумент.Автор = Автор;
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого Строка Из СписокДоговоров Цикл
		Индекс = Строка.НомерСтроки - 1;
		НомерСтроки = Строка.НомерСтроки;
		
		Если (НЕ ЗначениеЗаполнено(Строка.ОценкаЗамер) И ЗначениеЗаполнено(Строка.КомментарийЗамер)) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + НомерСтроки + " не заполнена оценка замер";
			Сообщение.Поле = "СписокДоговоров[" + Индекс + "].ОценкаЗамер";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;	
		
		Если (НЕ ЗначениеЗаполнено(Строка.ОценкаДизайн) И ЗначениеЗаполнено(Строка.КомментарийДизайн)) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + НомерСтроки + " не заполнена оценка дизайн";
			Сообщение.Поле = "СписокДоговоров[" + Индекс + "].ОценкаДизайн";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;	
		
		Если (НЕ ЗначениеЗаполнено(Строка.ОценкаДоставка) И ЗначениеЗаполнено(Строка.КомментарийДоставка)) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + НомерСтроки + " не заполнена оценка доставка";
			Сообщение.Поле = "СписокДоговоров[" + Индекс + "].ОценкаДоставка";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;		
		
		Если (НЕ ЗначениеЗаполнено(Строка.ОценкаМонтаж) И ЗначениеЗаполнено(Строка.КомментарийМонтаж)) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + НомерСтроки + " не заполнена оценка монтаж";
			Сообщение.Поле = "СписокДоговоров[" + Индекс + "].ОценкаМонтаж";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;		
КонецПроцедуры
