
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Для Каждого Строка Из СписокДоговоров Цикл
		//	
		//	Если Строка.ОбщаяОценка Тогда
		//		
		//		НовыйДокумент = Документы.СлужебнаяЗаписка.СоздатьДокумент();
		//		НовыйДокумент.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.ПретензияЗаявление;
		//		НовыйДокумент.Проблема = Строка.ОбщийКомментарий;
		//		НовыйДокумент.Адресат = Константы.ГенеральныйДиректор.Получить();
		//		НовыйДокумент.Тема = "Претензия по " + Строка.Договор;
		//		НовыйДокумент.Документ = Строка.Договор;
		//		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		//		
		//	КонецЕсли;
	//КонецЦикла;	
КонецПроцедуры
