
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьДопСоглашение)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьДопСоглашение(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьДопСоглашение(ТабДок, ПараметрКоманды)
	Документы.ДополнительноеСоглашение.ПечатьДопСоглашение(ТабДок, ПараметрКоманды);
КонецПроцедуры
