///////////////////////////////////////////////////////////////////////////////////
// ОчередьЗаданийПовтИсп: Работа с неразделенными регламентными заданиями.
//
///////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает список методов разрешенных к вызову через механизм очереди заданий
//
// Возвращаемое значение:
//  Массив - имена методов, разрешенных к вызову через механизм очереди заданий
//
Функция ПолучитьРазрешенныеМетоды() Экспорт
	
	РазрешенныеМетоды = Новый Массив;
	СтандартныеПодсистемыПереопределяемый.ПолучитьРазрешенныеМетодыОчередиЗаданий(РазрешенныеМетоды);
	ОчередьЗаданийПереопределяемый.ПолучитьРазрешенныеМетодыОчередиЗаданий(РазрешенныеМетоды);
	
	Для каждого МетаданныеРегламентногоЗадания Из Метаданные.РегламентныеЗадания Цикл
		РазрешенныеМетоды.Добавить(МетаданныеРегламентногоЗадания.ИмяМетода);
	КонецЦикла;
	
	Результат = Новый Массив;
	Для каждого ИмяМетода Из РазрешенныеМетоды Цикл
		Результат.Добавить(ВРег(ИмяМетода));
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции
