////////////////////////////////////////////////////////////////////////////////
// Подсистема "Информационный центр".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Определяет массив полезных ссылок для вывода на форме информационного центра на рабочем столе.
//
// Параметры:
//	МассивСсылок - массив - массив ссылок.
//
// Любая ссылка это структура с полями, которые указаны в функции 
//	НовоеОписаниеПолезнойСсылки() общего модуля ИнформационныйЦентрСервер.
//
// Пример для добавления ссылки:
//		
//  ОписаниеСсылки = ИнформационныйЦентрСервер.НовоеОписаниеСсылки();
//  ОписаниеСсылки.Имя			= НСтр("ru = 'БУХ 1С'");
//  ОписаниеСсылки.Адрес		= "http://v8.1c.ru/cnt.jsp/:tk_buh8:/http://buh.ru/";
//  ОписаниеСсылки.Пояснение	= НСтр("ru = 'Новости бухучета и налогообложения'");
//  МассивСсылок.Добавить(ОписаниеСсылки);
//
//  ОписаниеСсылки = ИнформационныйЦентрСервер.НовоеОписаниеСсылки();
//  ОписаниеСсылки.Имя			= НСтр("ru = 'Законодательство'");
//  ОписаниеСсылки.Адрес		= "http://v8.1c.ru/cnt.jsp/:tk_buh8:/http://v8.1c.ru/lawmonitor/";
//  ОписаниеСсылки.Пояснение	= НСтр("ru = 'Изменение законодательства в 1С'");
//  МассивСсылок.Добавить(ОписаниеСсылки);
//
// Пример для удаления ссылки:
//	
//	МассивСсылок.Удалить(0);
//
Процедура ОпределитьМассивПолезныхСсылок(МассивСсылок) Экспорт
	
КонецПроцедуры

// Определяет массив полезных статей для вывода на форме информационного центра на рабочем столе.
//
// Параметры:
//	МассивСтатей - массив - массив ссылок.
//
// Любая ссылка это Структура с полями:
//	Имя - Строка - наименование ссылки.
//	Адрес - Строка - адрес ресурса.
//
// Пример:
//
//  ОписаниеСтатьи = ИнформационныйЦентрСервер.НовоеОписаниеСтатьи();
//  ОписаниеСтатьи.Имя		= НСтр("ru = 'Ввод начальных остатков'");
//  ОписаниеСтатьи.Адрес	= "http://its.1c.ru/bmk/bp20/enterprise_initial_data";
//  МассивСтатей.Добавить(ОписаниеСтатьи);
//
//  ОписаниеСтатьи = ИнформационныйЦентрСервер.НовоеОписаниеСтатьи();
//  ОписаниеСтатьи.Имя		= НСтр("ru = 'Закрытие месяца'");
//  ОписаниеСтатьи.Адрес	= "http://its.1c.ru/bmk/bp20/enterprise_month_finishing";
//  МассивСтатей.Добавить(ОписаниеСтатьи);
//
Процедура ОпределитьМассивСтатей(МассивСтатей) Экспорт
	
	
	
КонецПроцедуры

// Определяет основную страницу сайта для публикации приложений через сеть Интернет.
//
// Параметры:
//	СсылкаСайтаДляПубликацииПриложенийЧерезИнтернет - Структура.
//		Поля Структуры указаны в функции ИнформационныйЦентрСервер.НовоеОписаниеСсылкиСайтаДляПубликацииПриложенийЧерезИнтернет. 
//
Процедура ОпределитьСсылкуДляПубликацииПриложенийЧерезИнтернет(СсылкаСайтаДляПубликацииПриложенийЧерезИнтернет) Экспорт
	
КонецПроцедуры

// Определяет ссылку для перехода к приложениям абонента.
//
// Параметры:
//	СсылкаНаПриложения - Строка - адрес.
//
Процедура ОпределитьАдресСсылкиДляПереходаКПриложениямАбонента(СсылкаНаПриложения) Экспорт 
	
КонецПроцедуры

// Определяет отображать или нет Новости в модели сервиса в форме "ИнформационныйЦентр".
//
// Параметры:
//	ВидимостьНовостейВМоделиСервиса - Булево - Истина, если отображать, Ложь - иначе.
//
Процедура ОпределитьВидимостьНовостейВМоделиСервиса(ВидимостьНовостейВМоделиСервиса) Экспорт
	
КонецПроцедуры

// Определяет отображать или нет Поиск информации в форме "ИнформационныйЦентр".
//
// Параметры:
//	ВидимостьПоискаИнформации - Булево - Истина, если отображать, Ложь - иначе.
//
Процедура ОпределитьВидимостьПоискаИнформации(ВидимостьПоискаИнформации) Экспорт 
	
КонецПроцедуры

// Определяет ссылку поиска информации.
// Например сайт ИТС.
//
// Параметры:
//	СсылкаПоискаИнформации - Строка - адрес.
//
// Примечание:
// 	Структура должна быть следующая:
//		Если к адресу ссылки добавить строку поиска, и перейти по данному адресу, то
//		в результате мы должны перейти форму результатов поиска.
//
Процедура ОпределитьСсылкуПоискаИнформации(СсылкаПоискаИнформации) Экспорт
	
КонецПроцедуры
