
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КоличествоДней = 7;
	ВвестиЧисло(КоличествоДней, "На сколько дней вперёд?", 2, 0);
	
	Если ПараметрКоманды <> Неопределено И ПараметрКоманды.Количество() > 0 Тогда
		
		ВыбранноеПодразделение = Неопределено;//ПолучитьПодразделениеПользователя();
		Пока ВыбранноеПодразделение = Неопределено Цикл
			ВыбранноеПодразделение = ОткрытьФормуМодально("Справочник.Подразделения.ФормаВыбора");//.Подразделения.Форма.ФормаВыбораОтбор");
		КонецЦикла;
		
		НачалоПериода = ЛексСервер.ЗначениеРеквизитаОбъекта(ПараметрКоманды[0], "Дата");
		КонецПериода = НачалоПериода + (КоличествоДней+1) * 86400 - 1;
		
		ТабДок = Новый ТабличныйДокумент;
		ПечатьГрафикВывоза(ТабДок, ПараметрКоманды, НачалоПериода, КонецПериода, ВыбранноеПодразделение);
		
		ТабДок.АвтоМасштаб = Истина;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Защита = Ложь;
		ТабДок.ТолькоПросмотр = Ложь;
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.Показать("График вывоза");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПечатьГрафикВывоза(ТабДок, ПараметрКоманды, НачалоПериода, КонецПериода, ВыбранноеПодразделение)
	
	Документы.Монтаж.ПечатьГрафикВывоза(ТабДок, ПараметрКоманды, НачалоПериода, КонецПериода, ВыбранноеПодразделение);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПодразделениеПользователя()

	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;//ОбщегоНазначения.пПолучитьПараметрСеанса("ТекущийПользователь");
	Подразделение = ТекПользователь.ФизическоеЛицо.Подразделение;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Результат = Подразделение;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПолучитьПодразделениеПользователя()