#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Групповое изменение объектов

// Возвращает список реквизитов, которые не нужно редактировать
// с помощью обработки группового изменения объектов
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ЗагружаетсяИзИнтернета");
	Результат.Добавить("Наценка");
	Результат.Добавить("ОсновнаяВалюта");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли