
Процедура ПечатьПлан(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьПлан)
	Макет = Документы.ПланРуководителя.ПолучитьМакет("ПечатьПлан");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланРуководителяСписокСтатей.Родитель КАК Родитель,
	|	ПланРуководителяСписокСтатей.Статья,
	|	ПланРуководителяСписокСтатей.Сумма КАК Сумма,
	|	ПланРуководителяСписокСтатей.Дата,
	|	ПланРуководителяСписокСтатей.Родитель.Код КАК Код,
	|	ПланРуководителяСписокСтатей.Статья.Код,
	|	ПланРуководителяСписокСтатей.Комментарий,
	|	ПланРуководителяСписокСтатей.Ссылка.Подразделение КАК Подразделение,
	|	ПланРуководителяСписокСтатей.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПланРуководителя.СписокСтатей КАК ПланРуководителяСписокСтатей
	|ГДЕ
	|	ПланРуководителяСписокСтатей.Ссылка В(&Ссылка)
	|ИТОГИ
	|	СУММА(Сумма),
	|	МАКСИМУМ(Код),
	|	МАКСИМУМ(Подразделение)
	|ПО
	|	Ссылка,
	|	Родитель";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокСтатейШапка = Макет.ПолучитьОбласть("СписокСтатейШапка");
	ОбластьСписокСтатей = Макет.ПолучитьОбласть("СписокСтатей");
	ОбластьСтатьи = Макет.ПолучитьОбласть("Статьи");
	ОбластьИтого = Макет.ПолучитьОбласть("Итоги");
	ТабДок.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		ОбластьШапка.Параметры.Подразделение = Выборка.Подразделение;
		ТабДок.Вывести(ОбластьШапка);
		ТабДок.Вывести(ОбластьСписокСтатейШапка);
		ВыборкаРодитель = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРодитель.Следующий() Цикл
			ОбластьСписокСтатей.Параметры.Заполнить(ВыборкаРодитель);
			ТабДок.Вывести(ОбластьСписокСтатей);
			ТабДок.НачатьГруппуСтрок();
			ВыборкаСписокСтатей = ВыборкаРодитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСписокСтатей.Следующий() Цикл
				ОбластьСтатьи.Параметры.Заполнить(ВыборкаСписокСтатей);
				ТабДок.Вывести(ОбластьСтатьи);
			КонецЦикла;
			ТабДок.ЗакончитьГруппуСтрок();
		КонецЦикла;
		ОбластьИтого.Параметры.Итого = Выборка.Сумма;
		ТабДок.Вывести(ОбластьИтого);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

