
//Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	
//	Дата = НачалоМесяца(Дата);
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	Запрос.УстановитьПараметр("Подразделение", Подразделение);
//	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
//	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ ПЕРВЫЕ 1
//	|	ПланРуководителя.Ссылка
//	|ИЗ
//	|	Документ.ПланРуководителя КАК ПланРуководителя
//	|ГДЕ
//	|	ПланРуководителя.Ссылка <> &Ссылка
//	|	И ПланРуководителя.Дата МЕЖДУ &НачалоПериода И &КонецПериода
//	|	И ПланРуководителя.Подразделение = &Подразделение";
//	
//	Результат = Запрос.Выполнить();
//	
//	Если НЕ Результат.Пустой() Тогда
//		Отказ = Истина;
//		ТекстСообщения = "В этом месяце уже есть план руководителя подразделения " + Подразделение;
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Дата");
//	КонецЕсли;		
//	
//	УдалитьСтрокиТаблицы(Новый Структура("Родитель", Справочники.Статьи.ПустаяСсылка()));
//	УдалитьСтрокиТаблицы(Новый Структура("Статья", Справочники.Статьи.ПустаяСсылка()));
//	
//КонецПроцедуры

//Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//	
//	Движения.ОборотыПоСтатьям.Записывать = Истина;
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ПланРуководителяСписокСтатей.Статья,
//	|	СУММА(ПланРуководителяСписокСтатей.Сумма) КАК Сумма
//	|ИЗ
//	|	Документ.ПланРуководителя.СписокСтатей КАК ПланРуководителяСписокСтатей
//	|ГДЕ
//	|	ПланРуководителяСписокСтатей.Ссылка = &Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ПланРуководителяСписокСтатей.Статья";
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		
//		Запись = Движения.ОборотыПоСтатьям.Добавить();
//		Запись.Период = Дата;
//		Запись.Подразделение = Подразделение;
//		Запись.Статья = Выборка.Статья;
//		Запись.План = Выборка.Сумма;
//		
//	КонецЦикла;
//	
//КонецПроцедуры

//Функция УдалитьСтрокиТаблицы(Отбор)

//	МассивСтрок = СписокСтатей.НайтиСтроки(Отбор);
//	Для каждого Строка Из МассивСтрок Цикл
//		СписокСтатей.Удалить(Строка);
//	КонецЦикла;

//КонецФункции // УдалитьСтрокиТаблицы()
