&НаКлиенте
Процедура ФормулаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("Формула, ИмяПеременной", Элемент.ТекстРедактирования, Элемент.Имя);
	Форма = ПолучитьФорму("Справочник.СхемыЯщиков.Форма.ФормаДляФормул", ПараметрыФормы, Элемент);
	Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ВидНаправляющихНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ПолучитьФорму("Справочник.НоменклатурныеГруппы.ФормаВыбора",,Элемент);
   
    Отбор = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
    Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
    Отбор.ПравоеЗначение = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Направляющие");
    Отбор.Использование = Истина;
	
	ФормаВыбора.Открыть();
   
КонецПроцедуры
