
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = Новый Структура;
	Договор = ПолучитьДоговор(ПараметрКоманды);
	
	Если ЗначениеЗаполнено(Договор) Тогда
		
		ПараметрыОткрытия.Вставить("Договор", Договор);
		Форма = ПолучитьФорму("Обработка.ПомощникВводаДополнительногоСоглашения.Форма.Форма",ПараметрыОткрытия, ПараметрыВыполненияКоманды.Источник.ИмяФормы);
		Форма.Открыть();
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "К данной спецификации нет договора";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция Получитьдоговор(Спецификация)
	
	Возврат Документы.Спецификация.ПолучитьДоговор(Спецификация);
	
КонецФункции // Получитьдоговор()
