
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбАвтор = Объект.Автор;
	
	Если ОбАвтор = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда	
		ОбАвтор=ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)	
	УдалитьОзнакомленные();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура УдалитьОзнакомленные()
	
	Записи = РегистрыСведений.ОзнакомленСообщенияДилеру.СоздатьНаборЗаписей();
	Записи.Отбор.Сообщение.Установить(Объект.Ссылка);
	Записи.Прочитать();

	Для Каждого Зап Из Записи Цикл
	    Записи.Удалить(Зап);
	КонецЦикла;

	Записи.Записать();
	
КонецПроцедуры
