
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Функция ПолучитьДокументЗаПериод(Подразделение, Дата, ТолькоПроведенные) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Документы.ПлановыйЛимит.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПлановыйЛимит.Ссылка,
	|	ПлановыйЛимит.Проведен
	|ИЗ
	|	Документ.ПлановыйЛимит КАК ПлановыйЛимит
	|ГДЕ
	|	ПлановыйЛимит.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|	И ПлановыйЛимит.Проведен
	|	И ПлановыйЛимит.Подразделение = &Подразделение";
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если ТолькоПроведенные Тогда
			Если Выборка.Проведен Тогда
				Результат = Выборка.Ссылка;
			КонецЕсли;
		Иначе
			Результат = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

