
&НаКлиенте
Процедура Подобрать(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыФормы.Вставить("АдресТаблицы", ПолучитьАдресТаблицы(Объект.СписокНоменклатуры));
	
	ОткрытьФорму("Документ.РасходОбрезков.Форма.ФормаПодбора", ПараметрыФормы, Элементы.СписокНоменклатуры);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицы(Знач фТаблица)
	
	Возврат ПоместитьВоВременноеХранилище(фТаблица.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Сообщить("Оп, мизантроп!");
	
КонецПроцедуры
