
&НаКлиенте
Процедура Подобрать(Команда)
	
	ПараметрыФомы = Новый Структура;
	ПараметрыФомы.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыФомы.Вставить("АдресТаблицыОбрезков", ПолучитьАдресТаблицы("СписокНоменклатуры"));
	ОткрытьФорму("РегистрНакопления.ОбрезкиЛистовойМатериал.Форма.ФормаПодбора", ПараметрыФомы, Элементы.СписокНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьХлыстовой(Команда)
	
	ПараметрыФомы = Новый Структура;
	ПараметрыФомы.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыФомы.Вставить("АдресТаблицыОбрезков", ПолучитьАдресТаблицы("СписокХлыстовойНоменклатуры"));
	ОткрытьФорму("РегистрНакопления.ОбрезкиХлыстовойМатериал.Форма.ФормаПодбора", ПараметрыФомы, Элементы.СписокХлыстовойНоменклатуры);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицы(ИмяТаблицы)
	
	Таблица = Объект[ИмяТаблицы].Выгрузить();
	АдресТаблицы = ПоместитьВоВременноеХранилище(Таблица);
	
	Возврат АдресТаблицы;
	
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("АдресХранилища") 
		И ЭтоАдресВременногоХранилища(ВыбранноеЗначение.АдресХранилища) Тогда
		ЗагрузитьТаблицуНаСервере(ВыбранноеЗначение.АдресХранилища, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьТаблицуНаСервере(фАдресТаблицы, Хлыстовой)
	
	Если Хлыстовой Тогда
		Объект.СписокХлыстовойНоменклатуры.Загрузить(ПолучитьИзВременногоХранилища(фАдресТаблицы));
	Иначе
		Объект.СписокНоменклатуры.Загрузить(ПолучитьИзВременногоХранилища(фАдресТаблицы));
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СписокХлыстовойНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("АдресХранилища") 
		И ЭтоАдресВременногоХранилища(ВыбранноеЗначение.АдресХранилища) Тогда
		ЗагрузитьТаблицуНаСервере(ВыбранноеЗначение.АдресХранилища, Истина);
	КонецЕсли;
	
КонецПроцедуры
