
&НаКлиенте
Процедура Подобрать(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыФормы.Вставить("АдресТаблицы", ПолучитьАдресТаблицы(Объект.СписокНоменклатуры));
	
	ОткрытьФорму("Документ.РасходОбрезков.Форма.ФормаПодбора", ПараметрыФормы, Элементы.СписокНоменклатуры);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресТаблицы(Знач фТаблица)
	
	Возврат ПоместитьВоВременноеХранилище(фТаблица.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") 
		И ВыбранноеЗначение.Свойство("АдресТаблицы") 
		И ЭтоАдресВременногоХранилища(ВыбранноеЗначение.АдресТаблицы) Тогда
		
		ЗагрузитьТаблицуНаСервере(ВыбранноеЗначение.АдресТаблицы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьТаблицуНаСервере(фАдресТаблицы)
	
	Объект.СписокНоменклатуры.Загрузить(ПолучитьИзВременногоХранилища(фАдресТаблицы));
	
КонецФункции
