#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Настройка Из ЭтотОбъект Цикл
		
		Если Настройка.ПерсональнаяУчетнаяЗапись Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОтветственныйЗаВедениеПапок"));
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОтветственныйЗаОбработкуПисем"));
			Продолжить;
		КонецЕсли;
		
		Если Не Настройка.ОтветственныйЗаВедениеПапок.Пустая() Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОтветственныйЗаВедениеПапок"));
		КонецЕсли;
		
		Если Не Настройка.ОтветственныйЗаОбработкуПисем.Пустая() Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОтветственныйЗаОбработкуПисем"));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли