
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// RonEXI edit
	//Для каждого Строка Из СписокДолжностей Цикл
	//	
	//	Проводка = Движения.ШтатноеРасписание.Добавить();
	//	Проводка.Период = Дата;
	//	Проводка.Подразделение = Подразделение;
	//	ЗаполнитьЗначенияСвойств(Проводка, Строка);
	//	
	//КонецЦикла;
	//
	//Движения.ШтатноеРасписание.Записывать = Истина;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	Дата = НачалоМесяца(Дата);
	
КонецПроцедуры
