
&НаКлиенте
Процедура Перенести(Команда)
	ОповеститьОВыборе(Формула);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = Параметры.ИмяПеременной; 
	Формула = Параметры.Формула;
	
	ЗаполнитьПеременные();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПеременные()
	
	СтруктураПеременных = Новый Массив;
	
	Эл = Новый Массив;
	Эл.Добавить("ШиринаИзделия");
	Эл.Добавить("ВысотаИзделия");
	Эл.Добавить("ГлубинаИзделия");
	
	Раздел = Новый Массив;
	Раздел.Добавить("Изделие");
	Раздел.Добавить(Эл);
	
	СтруктураПеременных.Добавить(Раздел);
		
	Эл = Новый Массив;
	Эл.Добавить("ПрипускСверху");
	Эл.Добавить("ПрипускСлева");
	Эл.Добавить("ПрипускСправа");
	Эл.Добавить("ПрипускСнизу");
	
	Раздел = Новый Массив;
	Раздел.Добавить("Припуск");
	Раздел.Добавить(Эл);
	
	СтруктураПеременных.Добавить(Раздел);
	
	Эл = Новый Массив;
	Эл.Добавить("ЗавалПол");
	Эл.Добавить("ЗавалЛевый");
	Эл.Добавить("ЗавалПравый");
	Эл.Добавить("ЗавалПотолок");
	Эл.Добавить("ЗавалСтенка");
	
	Раздел = Новый Массив;
	Раздел.Добавить("Завал");
	Раздел.Добавить(Эл);
	
	СтруктураПеременных.Добавить(Раздел);

	
 

//Столешница - высота столешницы задается в форме каталога (26, 38, 40).

//Европаз - деталь зависит от значения европаза (8, 16).

//Отскек{НомерОтсека}  - Ширина отсека. Например: Отсек1.

//ВысотаПроема - Высота проема двери шкафа по каталогу.

//ШиринаПроема - Ширина проема двери шкафа по каталогу.

//ВысотаПотолок - Высота потолка шкафа по каталогу.

//ВысотаПол - Высота пола шкафа купе по каталогу. 

//ШиринаПравый - Ширина правого элемента шкафа по каталогу. 

//ШиринаЛевый - Ширина левого элемента шкафа по каталогу.

//Раздвижная - Вид двери(Да или нет). 

//Распашная - Вид двери(Да или нет).

//РадиусЛ - Радиус справа. 

//РадиусП - Радиус слева.

//ГлубинаМатериала - Тольщина основного материала. 

//ГлубинаМатериалаДоп - Тольщина доп материала.


	Для Каждого Эл Из СтруктураПеременных Цикл
		
		Если ТипЗнч(Эл)=Тип("Массив") Тогда
			
			СтрокаСправ = СписокПеременных.ПолучитьЭлементы().Добавить();
			СтрокаСправ.Переменная = Эл[0];
			СтрокаСправ.Активность = Ложь;
			
			Для Каждого Эл2 Из Эл[1] Цикл
				
				СтрокаРеквизит = СтрокаСправ.ПолучитьЭлементы ().Добавить();
			    СтрокаРеквизит.Переменная = Эл2;
				СтрокаСправ.Активность = Истина;
				
			КонецЦикла;	
			
		Иначе
			
			СтрокаСправ = СписокПеременных.ПолучитьЭлементы().Добавить();
			СтрокаСправ.Переменная = Эл;
			СтрокаСправ.Активность = Истина;
			
		КонецЕсли;
		
	КонецЦикла;	
			
КонецПроцедуры


&НаКлиенте
Процедура СписокФормул(Команда)
	
	ОткрытьФорму("Справочник.ФормулыКаталога.ФормаСписка");
	
КонецПроцедуры
