&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		
		Период.Вариант = ВариантСтандартногоПериода.ЭтотГод;
		
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	
	ПараметрыОтчета.Вставить("Период", Период);
	ПараметрыОтчета.Вставить("Сотрудник", Сотрудник);
	ПараметрыОтчета.Вставить("БезЗавершенных", БезЗавершенных);
	ПараметрыОтчета.Вставить("ВидОтчета", ВидОтчета);
	
	СформироватьНаСервере(ТабДок, ПараметрыОтчета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьНаСервере(ТабДок, ПараметрыОтчета)
	
	ТабДок.Очистить();
	ТабДок = Отчеты.ПорученияДетально.СформироватьОтчет(ПараметрыОтчета);	
	ТабДок.НижнийКолонтитул.ТекстВЦентре = "[&НомерСтраницы]/[&СтраницВсего]" ;
	ТабДок.НижнийКолонтитул.Выводить = Истина;
	ТабДок.РазмерКолонтитулаСнизу = 10;
	
КонецПроцедуры

