&НаКлиенте
Процедура Сформировать(Команда)
	
	//Если НЕ ЗначениеЗаполнено(Период) Тогда
	//	
	//	Период.Вариант = ВариантСтандартногоПериода.ЭтотГод;
	//	
	//КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	
	ПараметрыОтчета.Вставить("Период", Период);
	ПараметрыОтчета.Вставить("Адресат", Адресат);
	ПараметрыОтчета.Вставить("ВидСЗ", ВидСЗ);
	
	СформироватьНаСервере(ТабДок, ПараметрыОтчета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьНаСервере(ТабДок, ПараметрыОтчета)
	
	ТабДок.Очистить();
	ТабДок = Отчеты.ПорученияДетально.СформироватьОтчет(ПараметрыОтчета);	
	ТабДок.НижнийКолонтитул.ТекстВЦентре = "[&НомерСтраницы]/[&СтраницВсего]" ;
	ТабДок.НижнийКолонтитул.Выводить = Истина;
	ТабДок.РазмерКолонтитулаСнизу = 10;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидСЗ = "Все";
	
КонецПроцедуры

