
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ФормироватьРаскрой = Истина;
	
	Если ФормироватьРаскрой Тогда
		
		Состояние("Формирование раскроя, это может занят длительное время");
		Элемент = ОбновитьРаскройНаСервере(ПараметрКоманды);
		
		НашНарядЗадание = Элемент.НарядЗадание;
			
		Если ЗначениеЗаполнено(Элемент.СтрокаКривогоПилаФРС) Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ХранимыйФайл", "КривойПил");
			ПараметрыФормы.Вставить("Спецификация", НашНарядЗадание);
			ПараметрыФормы.Вставить("СтрокаКривогоПила", Элемент.СтрокаКривогоПилаФРС);
			
			Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
			
			Элемент.РисунокКривогоПилаФРС = Значение;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.СтрокаКривогоПилаСтеколка) Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ХранимыйФайл", "КривойПил");
			ПараметрыФормы.Вставить("Спецификация", НашНарядЗадание);
			ПараметрыФормы.Вставить("СтрокаКривогоПила", Элемент.СтрокаКривогоПилаСтеколка);
			
			Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
			
			Элемент.РисунокКривогоПилаСтеколка = Значение;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.СтрокаРаскрой) Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ХранимыйФайл", "НовыйРаскрой");
			ПараметрыФормы.Вставить("Спецификация", НашНарядЗадание);
			ПараметрыФормы.Вставить("СтрокаНовогоРаскрояЛДСП", Элемент.СтрокаРаскрой);
			ПараметрыФормы.Вставить("ВидОтображения", "1");
			
			Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
			
			Элемент.РисунокРаскроя = Значение;
			
		КонецЕсли;
		
		ЗаписатьРаскрой(Элемент);
		
		Если ПараметрыВыполненияКоманды.Источник.ВладелецФормы <> Неопределено Тогда
			ПараметрыВыполненияКоманды.Источник.Прочитать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьРаскройНаСервере(НарядЗадание)
	
	Структура = РегистрыСведений.РаскройДеталей.СформироватьРаскрой(НарядЗадание);
	
	СтруктураПередачи = Новый Структура;
	СтруктураПередачи.Вставить("СтрокаКривогоПилаФРС", Структура.СтрокаКривогоПилаФРС);
	СтруктураПередачи.Вставить("СтрокаКривогоПилаСтеколка", Структура.СтрокаКривогоПилаСтеколка);
	СтруктураПередачи.Вставить("ТекущаяСтрокаРаскроя", Структура.ДанныеДляРаскроя);
	СтруктураПередачи.Вставить("СтрокаРаскрой", Структура.ДанныеДляРаскроя);
	СтруктураПередачи.Вставить("ТаблицаДеталей", Структура.ТаблицаДеталей);
	
	Попытка
		СтруктураПередачи.Вставить("ЛучшийПроцентОтхода", Структура.ЛучшийПроцентОтхода);
		СтруктураПередачи.Вставить("ВремяФормирования", Структура.ВремяФормирования);
	Исключение
		
	КонецПопытки;
	
	СтруктураПередачи.Вставить("АлгоритмРаскроя", Структура.АлгоритмРаскроя);
	СтруктураПередачи.Вставить("НарядЗадание", НарядЗадание);
	СтруктураПередачи.Вставить("РисунокКривогоПилаФРС", "");
	СтруктураПередачи.Вставить("РисунокКривогоПилаСтеколка", "");
	СтруктураПередачи.Вставить("РисунокРаскроя", "");
	ОбъектНарядЗадание = НарядЗадание.ПолучитьОбъект();
	ОбъектНарядЗадание.СписокЛистовНоменклатуры.Загрузить(Структура.ТаблицаЛистовНоменклатуры);
	ОбъектНарядЗадание.ДополнительныеСвойства.Вставить("НеОчищатьСтрокуРаскроя", Истина);
	ОбъектНарядЗадание.Записать();
	
	Возврат СтруктураПередачи;
	
КонецФункции

&НаСервере
Функция ЗаписатьРаскрой(Элемент)
	
	НаборЗаписей = РегистрыСведений.РаскройДеталей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Элемент.НарядЗадание);
	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 1 Тогда
		Запись = НаборЗаписей[0];
	Иначе
		Запись = НаборЗаписей.Добавить();
		Запись.Объект = Элемент.НарядЗадание;
	КонецЕсли;
	
	Запись.СтрокаРаскрой = Элемент.СтрокаРаскрой;
	Запись.ТекущаяСтрокаРаскроя = Элемент.ТекущаяСтрокаРаскроя;	
	Запись.РисунокРаскроя = Элемент.РисунокРаскроя;
	
	Запись.РисунокКривогоПилаФРС = Элемент.РисунокКривогоПилаФРС;
	Запись.РисунокКривогоПилаСтеколка = Элемент.РисунокКривогоПилаСтеколка;
	
	Запись.СтрокаКривогоПилаФРС = Элемент.СтрокаКривогоПилаФРС;
	Запись.СтрокаКривогоПилаСтеколка = Элемент.СтрокаКривогоПилаСтеколка;
	
	Попытка
		Запись.ИдеальныйПроцентОтхода = Элемент.ЛучшийПроцентОтхода;
		Запись.ВремяФормирования = Элемент.ВремяФормирования;
	Исключение
		
	КонецПопытки;
	
	Запись.ТаблицаДеталей = Элемент.ТаблицаДеталей;
	Запись.АлгоритмРаскроя = Элемент.АлгоритмРаскроя;
	
	НаборЗаписей.Записать();
	
КонецФункции

