
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПриходныйОрдер)
	ТабДок = Новый ТабличныйДокумент;
	ПриходныйОрдер(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПриходныйОрдер(ТабДок, ПараметрКоманды)
	Документы.АвансовыйОтчет.ПриходныйОрдер(ТабДок, ПараметрКоманды);
КонецПроцедуры
