////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)	
	НашаЗаметка = ЕстьЗеметка(ПараметрКоманды);
	Если ЗначениеЗаполнено(НашаЗаметка) Тогда
		ПараметрыФормы = Новый Структура("Ключ", НашаЗаметка);
	Иначе
		ПараметрыФормы = Новый Структура("Предмет", ПараметрКоманды);
		ПараметрыФормы.Вставить("Напоминать",Ложь);
	КонецЕсли;	
	ОткрытьФорму("Справочник.Заметки.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

&НаСервере
Функция ЕстьЗеметка(Предмет) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Предмет", Предмет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заметки.Ссылка
	|ИЗ
	|	Справочник.Заметки КАК Заметки
	|ГДЕ
	|	Заметки.Предмет = &Предмет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат Выборка[0].Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции
