
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьКомплектации)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьКомплектации(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьКомплектации(ТабДок, ПараметрКоманды)
	Документы.Комплектация.ПечатьКомплектации(ТабДок, ПараметрКоманды);
КонецПроцедуры
