
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.НастройкиНоменклатуры.Записывать = Истина;
	
	Для каждого Строка Из СписокНоменклатуры Цикл
		
		Если Строка.Номенклатура.Базовый Тогда
		
			Движение = Движения.НастройкиНоменклатуры.Добавить();
			Движение.Период = Дата;
			Движение.Подразделение = Подразделение;
			ЗаполнитьЗначенияСвойств(Движение, Строка);
			
		Иначе
			
			Сообщить("Позиция не записана: "+Строка.НомерСтроки+". "+Строка.Номенклатура+". Номенклатура не базовая.");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеМатериаловУслуг") Тогда
		
		Док = ДанныеЗаполнения;
		Подразделение = Док.Подразделение; 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("тз", Док.Материалы.Выгрузить());
		Запрос.УстановитьПараметр("Подразделение", Док.Подразделение);
		Запрос.УстановитьПараметр("Контрагент", Док.Контрагент);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тзСписокНоменклатуры.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	тзСписокНоменклатуры.Цена КАК Цена
		|ПОМЕСТИТЬ втСписокНоменклатуры
		|ИЗ
		|	&тз КАК тзСписокНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Список.Номенклатура.Базовый
		|			ТОГДА Список.Номенклатура
		|		ИНАЧЕ Список.Номенклатура.БазоваяНоменклатура
		|	КОНЕЦ КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА Список.Номенклатура.Базовый
		|			ТОГДА Список.Цена
		|		ИНАЧЕ Список.Цена / Список.Номенклатура.КоэффициентБазовых
		|	КОНЕЦ КАК ПлановаяЗакупочная,
		|	ЕСТЬNULL(Данные.АдресХранения, """") КАК АдресХранения,
		|	ЕСТЬNULL(Данные.ДнейНаИзготовление, 0) КАК ДнейНаИзготовление,
		|	ЕСТЬNULL(Данные.ЗакупОптом, ЛОЖЬ) КАК ЗакупОптом,
		|	ЕСТЬNULL(Данные.МожетПредоставитьЗаказчик, ЛОЖЬ) КАК МожетПредоставитьЗаказчик,
		|	ЕСТЬNULL(Данные.ОкруглятьДоЛистов, ЛОЖЬ) КАК ОкруглятьДоЛистов,
		|	ЕСТЬNULL(Данные.ОсновнаяПоСкладу, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК ОсновнаяПоСкладу,
		|	ЕСТЬNULL(Данные.ПодЗаказ, ЛОЖЬ) КАК ПодЗаказ,
		|	&Контрагент КАК Поставщик,
		|	ЕСТЬNULL(Данные.Розничная, 0) КАК Розничная
		|ИЗ
		|	втСписокНоменклатуры КАК Список
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(, Подразделение = &Подразделение) КАК Данные
		|		ПО (Список.Номенклатура = Данные.Номенклатура
		|				ИЛИ Список.Номенклатура.БазоваяНоменклатура = Данные.Номенклатура)"; 
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр ИЗ ТЗ Цикл
			
			НоваяСтрока = СписокНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр); 
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
