
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Если открыли данную форму из формы документа, то там надо поменять текст
	Если НЕ ВладелецФормы = Неопределено Тогда
		
		Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") Тогда 
			
			ЗакрыватьПриВыборе = Ложь;
			ОповеститьОВыборе(Объект.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	//
	//ПользовательИнженер = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Инженер) ИЛИ УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.ИнженерТехнолог);
	//ПользовательАдминистратор = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Администратор);
	//ПользовательДизайнер = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.ДизайнерКонсультант);
	//ПользовательДилер = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Дилер);
	//
	//ДоступныСтатусы = ПользовательАдминистратор ИЛИ ПользовательИнженер;
	//
	//ДизайнеруВПроизводство = (Объект.Изделие = Справочники.Изделия.Детали) И ПользовательДизайнер;
	//
	//КомандыИзменитьСтатус = ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.Статусы.ПодчиненныеЭлементы;
	//
	//КомандыИзменитьСтатус.ФормаНаПроверкуИнженеру.Доступность = НЕ ПользовательДилер;
	//КомандыИзменитьСтатус.ФормаЕстьЗамечания.Доступность = ДоступныСтатусы;
	//КомандыИзменитьСтатус.ФормаПроверена.Доступность = ДоступныСтатусы;
	
КонецПроцедуры
