
&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ПараметрыОтчета = Новый Структура;
	
	ПараметрыОтчета.Вставить("Дата", ТекущаяДата() - 86400);
	
	ТабДок = Отчеты.ДиагностикаБизнеса.СформироватьОтчет(ПараметрыОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Расшифровка.Свойство("Спецификация") Тогда
		
		ОткрытьЗначение(Расшифровка.Спецификация);
		
	ИначеЕсли Расшифровка.Свойство("Договор") Тогда
		
		ОткрытьЗначение(Расшифровка.Договор);
		
	ИначеЕсли Расшифровка.Свойство("Служебка") Тогда
		
		ОткрытьЗначение(Расшифровка.Служебка);
		
	ИначеЕсли Расшифровка.Свойство("Ссылка") И Расшифровка.Свойство("Текст") Тогда	
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", Расшифровка);
		
		ОткрытьФорму("Документ.СлужебнаяЗаписка.ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

