
&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ПараметрыОтчета = Новый Структура;
	
	ПараметрыОтчета.Вставить("Дата", ТекущаяДата() - 86400);
	
	ТабДок = Отчеты.ДиагностикаБизнеса.СформироватьОтчет(ПараметрыОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Расшифровка);
	
	ОткрытьФорму("Документ.СлужебнаяЗаписка.ФормаОбъекта", ПараметрыФормы); 
	
	ТабДокОбработкаРасшифровкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТабДокОбработкаРасшифровкиНаСервере()
	
	
	
КонецПроцедуры
