
Функция ПолучитьПриходМатериаловЗаказчика(СсылкаСпецификация) Экспорт
	
	МассивДокументов = ЛексСервер.НайтиПодчиненныеДокументы(СсылкаСпецификация, "Документ.ПриходМатериаловЗаказчика", "Спецификация");
	Если МассивДокументов.Количество() = 1 Тогда
		Возврат МассивДокументов[0];
	ИначеЕсли МассивДокументов.Количество() = 0 Тогда
		Возврат Документы.Договор.ПустаяСсылка();
	Иначе
		ВызватьИсключение "Ошибка 795: Нарушена связь ""Спецификации"" и документа ""Приход материалов заказчика""";
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ЗаполнитьМатериалыЗаказчика(Таблица, Спецификация) Экспорт
	
	Таблица.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпецификацияСписокНоменклатуры.Номенклатура,
		|	СпецификацияСписокНоменклатуры.Количество
		|ИЗ
		|	Документ.Спецификация.СписокНоменклатуры КАК СпецификацияСписокНоменклатуры
		|ГДЕ
		|	СпецификацияСписокНоменклатуры.ПредоставитЗаказчик
		|	И СпецификацияСписокНоменклатуры.Ссылка = &Спецификация";
		
		Запрос.УстановитьПараметр("Спецификация", Спецификация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество;
			
		КонецЦикла;
	
КонецПроцедуры // ЗаполнитьМатериалыЗаказчика()

