
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Спецификация") Тогда
		
		Подразделение = ДанныеЗаполнения.Производство;
		Спецификация = ДанныеЗаполнения;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	ПриходМатериаловЗаказчикаСсылка = Документы.ПриходМатериаловЗаказчика.ПолучитьПриходМатериаловЗаказчика(Спецификация);
	
	Если ЗначениеЗаполнено(ПриходМатериаловЗаказчикаСсылка) И Ссылка <> ПриходМатериаловЗаказчикаСсылка Тогда
		
		Отказ = Истина;
		ТекстСообщения = "К " + Спецификация + " уже введена " + ПриходМатериаловЗаказчикаСсылка;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ПриходМатериаловЗаказчикаСсылка);
		
	КонецЕсли;
	
КонецПроцедуры
