
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборНомГруппы = "Текстура";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборНоменклатуры(ОтборНомГруппы);
КонецПроцедуры

&НаКлиенте
Процедура ОтборНомГруппыПриИзменении(Элемент)
	УстановитьОтборНоменклатуры(ОтборНомГруппы);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборНоменклатуры(Значение)
	
	ПараметрыОтбора = Новый Структура;
    ПараметрыОтбора.Вставить("ПолеВыбора", Значение);
    Элементы.НоменклатурныеГруппы.ОтборСтрок = Новый ФиксированнаяСтруктура(ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатурныеГруппыГруппаПриИзменении(Элемент)
	Элементы.НоменклатурныеГруппы.ТекущиеДанные.ПолеВыбора = ОтборНомГруппы;
КонецПроцедуры

&НаКлиенте
Процедура ФормулаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("Формула, ИмяПеременной, Режим", Элемент.ТекстРедактирования, Элемент.Имя, "ВидДетали");
	Форма = ПолучитьФорму("ОбщаяФорма.РедакторФомул", ПараметрыФормы, Элемент);
	Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	Форма.Открыть();
	
КонецПроцедуры
