
Функция СформироватьОтчет(ПараметрыОтчета) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
	Макет = Отчеты.ОтчетСтаршегоДизайнера.ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаЗамеры = Макет.ПолучитьОбласть("ШапкаЗамеры");
	ОбластьСтрокаЗамеры = Макет.ПолучитьОбласть("СтрокаЗамеры");
	ОбластьШапкаМонтаж = Макет.ПолучитьОбласть("ШапкаМонтаж");
	ОбластьСтрокаМонтаж = Макет.ПолучитьОбласть("СтрокаМонтаж");

	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регион", ПараметрыОтчета.Подразделение.Регион);
	Запрос.УстановитьПараметр("СтаршийДизайнер", ПараметрыОтчета.СтаршийДизайнер);
	
	# Область Запрос
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	докЗамер.АдресЗамера КАК Адрес,
	|	докЗамер.Замерщик.Фамилия + "" "" + ПОДСТРОКА(докЗамер.Замерщик.Имя, 1, 1) + "". "" + ПОДСТРОКА(докЗамер.Замерщик.Отчество, 1, 1) + ""."" КАК Замерщик,
	|	докЗамер.Офис КАК Офис,
	|	докЗамер.Автор.ФизическоеЛицо.Фамилия + "" "" + ПОДСТРОКА(докЗамер.Автор.ФизическоеЛицо.Имя, 1, 1) + "". "" + ПОДСТРОКА(докЗамер.Автор.ФизическоеЛицо.Отчество, 1, 1) + ""."" КАК Автор,
	|	докЗамер.Ссылка КАК Предмет,
	|	докЗамер.Дата КАК ДатаЗамера,
	|	Встречи.Встреча.Дата КАК ДатаВстречи,
	|	Встречи.Встреча.Ответственный.Фамилия + "" "" + ПОДСТРОКА(Встречи.Встреча.Ответственный.Имя, 1, 1) + "". "" + ПОДСТРОКА(Встречи.Встреча.Ответственный.Отчество, 1, 1) + ""."" КАК Дизайнер,
	|	NULL КАК Статус,
	|	NULL КАК ДатаМонтажа,
	|	""Замер"" КАК Вид,
	|	NULL КАК Изделие,
	|	NULL КАК Монтажник,
	|	ВЫБОР
	|		КОГДА НаличиеЗаметокПоПредмету.ЕстьЗаметка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НаличиеЗаметокПоПредмету.ЕстьЗаметка
	|	КОНЕЦ КАК Заметка
	|ИЗ
	|	Документ.Замер КАК докЗамер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктивностьЗамеров КАК АктивностьЗамеров
	|		ПО (АктивностьЗамеров.Замер = докЗамер.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Замер.Ссылка КАК Ссылка,
	|			МИНИМУМ(ВстречаСКлиентом.Ссылка) КАК Встреча
	|		ИЗ
	|			Документ.Замер КАК Замер
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВстречаСКлиентом КАК ВстречаСКлиентом
	|				ПО (ВстречаСКлиентом.Основание = Замер.Ссылка)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Замер.Ссылка) КАК Встречи
	|		ПО докЗамер.Ссылка = Встречи.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеЗаметокПоПредмету КАК НаличиеЗаметокПоПредмету
	|		ПО (докЗамер.Ссылка = (ВЫРАЗИТЬ(НаличиеЗаметокПоПредмету.Предмет КАК Документ.Замер)))
	|ГДЕ
	|	АктивностьЗамеров.Статус
	|	И докЗамер.Подразделение.Регион = &Регион
	|	И ВЫБОР
	|			КОГДА &СтаршийДизайнер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА докЗамер.Замерщик = &СтаршийДизайнер
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	докСпецификация.АдресМонтажа,
	|	ВЫБОР
	|		КОГДА докСпецификация.ДокументОснование ССЫЛКА Документ.Замер
	|			ТОГДА ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Замерщик.Фамилия + "" "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Замерщик.Имя, 1, 1) + "". "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Замерщик.Отчество, 1, 1) + "".""
	|		КОГДА докСпецификация.ДокументОснование = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫРАЗИТЬ(докСпецификация.Автор КАК Справочник.Пользователи).ФизическоеЛицо.Руководитель.Фамилия + "" "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.Автор КАК Справочник.Пользователи).ФизическоеЛицо.Руководитель.Имя, 1, 1) + "". "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.Автор КАК Справочник.Пользователи).ФизическоеЛицо.Руководитель.Отчество, 1, 1) + "".""
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	докСпецификация.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СтатусСпецификацииСрезПоследних.Статус,
	|	докСпецификация.ДатаМонтажа,
	|	""Монтаж"",
	|	докСпецификация.Изделие,
	|	докСпецификация.Монтажник.Фамилия + "" "" + ПОДСТРОКА(докСпецификация.Монтажник.Имя, 1, 1) + "". "" + ПОДСТРОКА(докСпецификация.Монтажник.Отчество, 1, 1) + ""."",
	|	ВЫБОР
	|		КОГДА НаличиеЗаметокПоПредмету.ЕстьЗаметка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НаличиеЗаметокПоПредмету.ЕстьЗаметка
	|	КОНЕЦ
	|ИЗ
	|	Документ.Спецификация КАК докСпецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусСпецификации.СрезПоследних КАК СтатусСпецификацииСрезПоследних
	|		ПО (СтатусСпецификацииСрезПоследних.Спецификация = докСпецификация.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеЗаметокПоПредмету КАК НаличиеЗаметокПоПредмету
	|		ПО (докСпецификация.Ссылка = (ВЫРАЗИТЬ(НаличиеЗаметокПоПредмету.Предмет КАК Документ.Спецификация)))
	|ГДЕ
	|	докСпецификация.Подразделение.Регион = &Регион
	|	И ВЫБОР
	|			КОГДА &СтаршийДизайнер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Замерщик = &СтаршийДизайнер
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И докСпецификация.Проведен
	|	И СтатусСпецификацииСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификации.Установлен)
	|	И докСпецификация.ПакетУслуг = ЗНАЧЕНИЕ(Перечисление.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж)
	|	И докСпецификация.ДатаМонтажа <> ДАТАВРЕМЯ(1, 1, 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вид,
	|	ДатаЗамера,
	|	ДатаМонтажа
	|ИТОГИ ПО
	|	Замерщик,
	|	Вид";
	
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 	
	Пока Выборка.Следующий() Цикл	
		
		ТабДок.Вывести(ОбластьПустаяСтрока);		
		ОбластьШапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьШапка);
				
		ВыборкаПоСотрудникам = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСотрудникам.Следующий() Цикл
						
			
			ЭтоЗамеры = ВыборкаПоСотрудникам.Вид = "Замер";
			
			ТабДок.Вывести(ОбластьПустаяСтрока);
			
			ТабДок.Вывести(?(ЭтоЗамеры, ОбластьШапкаЗамеры, ОбластьШапкаМонтаж));
			
			ВыборкаПоДокумента = ВыборкаПоСотрудникам.Выбрать();		
			
			Пока ВыборкаПоДокумента.Следующий() Цикл
				
				Если ЭтоЗамеры Тогда 
					
					ОбластьСтрокаЗамеры.Параметры.Заполнить(ВыборкаПоДокумента);
					ОбластьСтрокаЗамеры.Параметры.РасшифровкаАдрес = Новый Структура("РасшифровкаАдрес", ВыборкаПоДокумента.Предмет);
					
					Если ВыборкаПоДокумента.Заметка Тогда
						ОбластьСтрокаЗамеры.Параметры.РасшифровкаЗаметка = Новый Структура("Заметка, Предмет", ВыборкаПоДокумента.Заметка, ВыборкаПоДокумента.Предмет);
					Иначе
						ОбластьСтрокаЗамеры.Параметры.РасшифровкаЗаметка = Неопределено;
					КонецЕсли;
					
					Если НачалоДня(ВыборкаПоДокумента.ДатаЗамера) = НачалоДня(ТекущаяДата()) Тогда
						ОбластьСтрокаЗамеры.Области.СтрокаЗамеры.Шрифт = Новый Шрифт(,9,Истина);
					Иначе
						
						Если ЗначениеЗаполнено(ВыборкаПоДокумента.ДатаВстречи) Тогда
							
							Если НачалоДня(ВыборкаПоДокумента.ДатаВстречи) = НачалоДня(ТекущаяДата()) Тогда
								ОбластьСтрокаЗамеры.Области.СтрокаЗамеры.Шрифт = Новый Шрифт(,9,Истина,Истина);
							ИначеЕсли НачалоДня(ВыборкаПоДокумента.ДатаВстречи) < НачалоДня(ТекущаяДата()) Тогда
								ОбластьСтрокаЗамеры.Области.СтрокаЗамеры.ЦветТекста = Новый Цвет(252,0,0);
							КонецЕсли;
							
						Иначе
							ОбластьСтрокаЗамеры.Области.СтрокаЗамеры.ЦветТекста = Новый Цвет(252,0,0);	
						КонецЕсли;
												
					КонецЕсли;
										
					ТабДок.Вывести(ОбластьСтрокаЗамеры);
					
					ОбластьСтрокаЗамеры.Области.СтрокаЗамеры.ЦветТекста = Новый Цвет(0,0,0);
					ОбластьСтрокаЗамеры.Области.СтрокаЗамеры.Шрифт = Новый Шрифт(,8,Ложь,Ложь);
					
				Иначе
					
					ОбластьСтрокаМонтаж.Параметры.Заполнить(ВыборкаПоДокумента);
					ОбластьСтрокаМонтаж.Параметры.РасшифровкаАдрес = Новый Структура("РасшифровкаАдрес", ВыборкаПоДокумента.Предмет);
					
					Если ЗначениеЗаполнено(ВыборкаПоДокумента.Заметка) И ВыборкаПоДокумента.Заметка Тогда
						ОбластьСтрокаМонтаж.Параметры.РасшифровкаЗаметка = Новый Структура("Заметка, Предмет", ВыборкаПоДокумента.Заметка, ВыборкаПоДокумента.Предмет);
					Иначе
						ОбластьСтрокаМонтаж.Параметры.РасшифровкаЗаметка = Неопределено;
					КонецЕсли;	

					
					Если НачалоДня(ВыборкаПоДокумента.ДатаМонтажа) = НачалоДня(ТекущаяДата()) Тогда
						ОбластьСтрокаМонтаж.Области.СтрокаМонтаж.Шрифт = Новый Шрифт(,9,Истина);
					ИначеЕсли НачалоДня(ВыборкаПоДокумента.ДатаМонтажа) < НачалоДня(ТекущаяДата()) Тогда
						ОбластьСтрокаМонтаж.Области.СтрокаМонтаж.ЦветТекста = Новый Цвет(252,0,0);
					КонецЕсли;
					
					ТабДок.Вывести(ОбластьСтрокаМонтаж);
					
					ОбластьСтрокаМонтаж.Области.СтрокаМонтаж.ЦветТекста = Новый Цвет(0,0,0);
					ОбластьСтрокаМонтаж.Области.СтрокаМонтаж.Шрифт = Новый Шрифт(,8,Ложь,Ложь);
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьОтчетОбщий(ПараметрыОтчета) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСлева = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ПолеСправа = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
	Макет = Отчеты.ОтчетСтаршегоДизайнера.ПолучитьМакет("МакетОбщий");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаЗамеры = Макет.ПолучитьОбласть("ШапкаЗамеры");
	ОбластьСтрокаЗамеры = Макет.ПолучитьОбласть("СтрокаЗамеры");
	ОбластьШапкаМонтаж = Макет.ПолучитьОбласть("ШапкаМонтаж");
	ОбластьСтрокаМонтаж = Макет.ПолучитьОбласть("СтрокаМонтаж");

	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регион", ПараметрыОтчета.Подразделение.Регион);
	
	# Область Запрос
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	докЗамер.АдресЗамера КАК Адрес,
	|	докЗамер.Замерщик.Фамилия + "" "" + ПОДСТРОКА(докЗамер.Замерщик.Имя, 1, 1) + "". "" + ПОДСТРОКА(докЗамер.Замерщик.Отчество, 1, 1) + ""."" КАК Замерщик,
	|	докЗамер.Офис КАК Офис,
	|	докЗамер.Автор.ФизическоеЛицо.Фамилия + "" "" + ПОДСТРОКА(докЗамер.Автор.ФизическоеЛицо.Имя, 1, 1) + "". "" + ПОДСТРОКА(докЗамер.Автор.ФизическоеЛицо.Отчество, 1, 1) + ""."" КАК Автор,
	|	докЗамер.Ссылка КАК Предмет,
	|	докЗамер.Дата КАК ДатаЗамера,
	|	Встречи.Встреча.Дата КАК ДатаВстречи,
	|	Встречи.Встреча.Ответственный.Фамилия + "" "" + ПОДСТРОКА(Встречи.Встреча.Ответственный.Имя, 1, 1) + "". "" + ПОДСТРОКА(Встречи.Встреча.Ответственный.Отчество, 1, 1) + ""."" КАК Дизайнер,
	|	NULL КАК Статус,
	|	NULL КАК ДатаМонтажа,
	|	""Замер"" КАК Вид,
	|	NULL КАК Изделие,
	|	NULL КАК Монтажник,
	|	Встречи.Встреча.Ответственный.Фамилия КАК Фамилия,
	|	ВЫБОР
	|		КОГДА НаличиеЗаметокПоПредмету.ЕстьЗаметка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НаличиеЗаметокПоПредмету.ЕстьЗаметка
	|	КОНЕЦ КАК Заметка
	|ИЗ
	|	Документ.Замер КАК докЗамер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктивностьЗамеров КАК АктивностьЗамеров
	|		ПО (АктивностьЗамеров.Замер = докЗамер.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Замер.Ссылка КАК Ссылка,
	|			МИНИМУМ(ВстречаСКлиентом.Ссылка) КАК Встреча
	|		ИЗ
	|			Документ.Замер КАК Замер
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВстречаСКлиентом КАК ВстречаСКлиентом
	|				ПО (ВстречаСКлиентом.Основание = Замер.Ссылка)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Замер.Ссылка) КАК Встречи
	|		ПО докЗамер.Ссылка = Встречи.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеЗаметокПоПредмету КАК НаличиеЗаметокПоПредмету
	|		ПО (докЗамер.Ссылка = (ВЫРАЗИТЬ(НаличиеЗаметокПоПредмету.Предмет КАК Документ.Замер)))
	|ГДЕ
	|	АктивностьЗамеров.Статус
	|	И докЗамер.Подразделение.Регион = &Регион
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	докСпецификация.АдресМонтажа,
	|	ВЫБОР
	|		КОГДА докСпецификация.ДокументОснование ССЫЛКА Документ.Замер
	|			ТОГДА ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Замерщик.Фамилия + "" "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Замерщик.Имя, 1, 1) + "". "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Замерщик.Отчество, 1, 1) + "".""
	|		КОГДА докСпецификация.ДокументОснование = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫРАЗИТЬ(докСпецификация.Автор КАК Справочник.Пользователи).ФизическоеЛицо.Руководитель.Фамилия + "" "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.Автор КАК Справочник.Пользователи).ФизическоеЛицо.Руководитель.Имя, 1, 1) + "". "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.Автор КАК Справочник.Пользователи).ФизическоеЛицо.Руководитель.Отчество, 1, 1) + "".""
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	докСпецификация.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СтатусСпецификацииСрезПоследних.Статус,
	|	докСпецификация.ДатаМонтажа,
	|	""Монтаж"",
	|	докСпецификация.Изделие,
	|	докСпецификация.Монтажник.Фамилия + "" "" + ПОДСТРОКА(докСпецификация.Монтажник.Имя, 1, 1) + "". "" + ПОДСТРОКА(докСпецификация.Монтажник.Отчество, 1, 1) + ""."",
	|	ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Замерщик.Фамилия,
	|	ВЫБОР
	|		КОГДА НаличиеЗаметокПоПредмету.ЕстьЗаметка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НаличиеЗаметокПоПредмету.ЕстьЗаметка
	|	КОНЕЦ
	|ИЗ
	|	Документ.Спецификация КАК докСпецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусСпецификации.СрезПоследних КАК СтатусСпецификацииСрезПоследних
	|		ПО (СтатусСпецификацииСрезПоследних.Спецификация = докСпецификация.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеЗаметокПоПредмету КАК НаличиеЗаметокПоПредмету
	|		ПО (докСпецификация.Ссылка = (ВЫРАЗИТЬ(НаличиеЗаметокПоПредмету.Предмет КАК Документ.Спецификация)))
	|ГДЕ
	|	докСпецификация.Подразделение.Регион = &Регион
	|	И докСпецификация.Проведен
	|	И СтатусСпецификацииСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификации.Установлен)
	|	И докСпецификация.ПакетУслуг = ЗНАЧЕНИЕ(Перечисление.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж)
	|	И докСпецификация.ДатаМонтажа <> ДАТАВРЕМЯ(1, 1, 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вид,
	|	ДатаЗамера,
	|	ДатаМонтажа
	|ИТОГИ ПО
	|	Вид";
	
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 	
	ТабДок.Вывести(ОбластьШапка);
	
	Пока Выборка.Следующий() Цикл	
		
		ТабДок.Вывести(ОбластьПустаяСтрока);
		ЭтоЗамеры = Выборка.Вид = "Замер";
		ТабДок.Вывести(ОбластьПустаяСтрока);
		ТабДок.Вывести(?(ЭтоЗамеры, ОбластьШапкаЗамеры, ОбластьШапкаМонтаж));
		
		ВыборкаПоСотрудникам = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСотрудникам.Следующий() Цикл
						
			Если ЭтоЗамеры Тогда 
				
				ОбластьСтрокаЗамеры.Параметры.Заполнить(ВыборкаПоСотрудникам);
				ОбластьСтрокаЗамеры.Параметры.РасшифровкаАдрес = Новый Структура("РасшифровкаАдрес", ВыборкаПоСотрудникам.Предмет);
				
				Если ЗначениеЗаполнено(ВыборкаПоСотрудникам.Заметка) И ВыборкаПоСотрудникам.Заметка Тогда
					ОбластьСтрокаЗамеры.Параметры.РасшифровкаЗаметка = Новый Структура("Заметка, Предмет", ВыборкаПоСотрудникам.Заметка, ВыборкаПоСотрудникам.Предмет);
				Иначе
					ОбластьСтрокаЗамеры.Параметры.РасшифровкаЗаметка = Неопределено;	
				КонецЕсли;
				
				Если НачалоДня(ВыборкаПоСотрудникам.ДатаЗамера) = НачалоДня(ТекущаяДата()) Тогда
					ОбластьСтрокаЗамеры.Области.СтрокаЗамеры.Шрифт = Новый Шрифт(,9,Истина);
				Иначе
					
					Если ЗначениеЗаполнено(ВыборкаПоСотрудникам.ДатаВстречи) Тогда
						
						Если НачалоДня(ВыборкаПоСотрудникам.ДатаВстречи) = НачалоДня(ТекущаяДата()) Тогда
							ОбластьСтрокаЗамеры.Области.СтрокаЗамеры.Шрифт = Новый Шрифт(,9,Истина,Истина);
						ИначеЕсли НачалоДня(ВыборкаПоСотрудникам.ДатаВстречи) < НачалоДня(ТекущаяДата()) Тогда
							ОбластьСтрокаЗамеры.Области.СтрокаЗамеры.ЦветТекста = Новый Цвет(252,0,0);
						КонецЕсли;
					Иначе
						ОбластьСтрокаЗамеры.Области.СтрокаЗамеры.ЦветТекста = Новый Цвет(252,0,0);
					КонецЕсли;
					
				КонецЕсли;
				
				ТабДок.Вывести(ОбластьСтрокаЗамеры);	
				
				ОбластьСтрокаЗамеры.Области.СтрокаЗамеры.ЦветТекста = Новый Цвет(0,0,0);
				ОбластьСтрокаЗамеры.Области.СтрокаЗамеры.Шрифт = Новый Шрифт(,8,Ложь,Ложь);

				
			Иначе
				
				ОбластьСтрокаМонтаж.Параметры.Заполнить(ВыборкаПоСотрудникам);
				ОбластьСтрокаМонтаж.Параметры.РасшифровкаАдрес = Новый Структура("РасшифровкаАдрес", ВыборкаПоСотрудникам.Предмет);
				
				Если ЗначениеЗаполнено(ВыборкаПоСотрудникам.Заметка) И ВыборкаПоСотрудникам.Заметка Тогда
					ОбластьСтрокаМонтаж.Параметры.РасшифровкаЗаметка = Новый Структура("Заметка, Предмет", ВыборкаПоСотрудникам.Заметка, ВыборкаПоСотрудникам.Предмет);
				Иначе
					ОбластьСтрокаМонтаж.Параметры.РасшифровкаЗаметка = Неопределено;	
				КонецЕсли;
				
				Если НачалоДня(ВыборкаПоСотрудникам.ДатаМонтажа) = НачалоДня(ТекущаяДата()) Тогда
					ОбластьСтрокаМонтаж.Области.СтрокаМонтаж.Шрифт = Новый Шрифт(,9,Истина);
				ИначеЕсли НачалоДня(ВыборкаПоСотрудникам.ДатаМонтажа) < НачалоДня(ТекущаяДата()) Тогда
					ОбластьСтрокаМонтаж.Области.СтрокаМонтаж.ЦветТекста = Новый Цвет(252,0,0);
				КонецЕсли;
				
				ТабДок.Вывести(ОбластьСтрокаМонтаж);
				
				ОбластьСтрокаМонтаж.Области.СтрокаМонтаж.ЦветТекста = Новый Цвет(0,0,0);
				ОбластьСтрокаМонтаж.Области.СтрокаМонтаж.Шрифт = Новый Шрифт(,8,Ложь,Ложь);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
