
Функция СформироватьОтчет(ПараметрыОтчета, ОтчетСтДиз = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСлева = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ПолеСправа = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	СтаршийДизайнер = ?(ПараметрыОтчета.Свойство("СтаршийДизайнер"), ПараметрыОтчета.СтаршийДизайнер, Справочники.ФизическиеЛица.ПустаяСсылка());
	
	ЕстьСтаршийДизайнер = ЗначениеЗаполнено(СтаршийДизайнер);
		
	Макет = Отчеты.ОтчетСтаршегоДизайнера.ПолучитьМакет("Макет");
	
	ОбластьШапкаДоговоры = Макет.ПолучитьОбласть("ШапкаДоговоры");
	ОбластьСтрокаДоговоры = Макет.ПолучитьОбласть("СтрокаДоговоры");	
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаОбщ");
	ОбластьШапкаЗамеры = Макет.ПолучитьОбласть("ШапкаЗамерыОбщ");
	ОбластьСтрокаЗамеры = Макет.ПолучитьОбласть("СтрокаЗамерыОбщ");
	ОбластьШапкаМонтаж = Макет.ПолучитьОбласть("ШапкаМонтажОбщ");
	ОбластьСтрокаМонтаж = Макет.ПолучитьОбласть("СтрокаМонтажОбщ");
	ОбластьШапкаАкт = Макет.ПолучитьОбласть("ШапкаАкт");
	ОбластьСтрокаАкт = Макет.ПолучитьОбласть("СтрокаАкт");
	ОбластьШапкаПеределка = Макет.ПолучитьОбласть("ШапкаПеределки");
	ОбластьСтрокаПеределка = Макет.ПолучитьОбласть("СтрокаПеределки");
	ОбластьШапкаПлан = Макет.ПолучитьОбласть("ШапкаПлан");
	ОбластьСтрокаПлан = Макет.ПолучитьОбласть("СтрокаПлан");

	# Область Запрос
	
	МассивДолжность  = Новый Массив;
	МассивДолжность.Добавить(Справочники.Должности.ДизайнерКонсультант);
	МассивДолжность.Добавить(Справочники.Должности.СтаршийДизайнер);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регион", ПараметрыОтчета.Подразделение.Регион);
	Запрос.УстановитьПараметр("СтаршийДизайнер", СтаршийДизайнер);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Должность", МассивДолжность);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	NULL КАК Адрес,
	|	NULL КАК Замерщик,
	|	NULL КАК Офис,
	|	NULL КАК Автор,
	|	NULL КАК Предмет,
	|	NULL КАК ДатаЗамера,
	|	NULL КАК ДатаВстречи,
	|	ФизическиеЛица.Ссылка.Фамилия + "" "" + ПОДСТРОКА(ФизическиеЛица.Ссылка.Имя, 1, 1) + "". "" + ПОДСТРОКА(ФизическиеЛица.Ссылка.Отчество, 1, 1) + ""."" КАК Дизайнер,
	|	NULL КАК Статус,
	|	NULL КАК ДатаМонтажа,
	|	""План"" КАК Вид,
	|	NULL КАК Изделие,
	|	NULL КАК Монтажник,
	|	NULL КАК Фамилия,
	|	NULL КАК Заметка,
	|	NULL КАК Примечание,
	|	NULL КАК ТелефонКлиента,
	|	NULL КАК РазницаДат,
	|	NULL КАК ДатаРазмещения,
	|	NULL КАК ДатаИзготовления,
	|	NULL КАК Виновный,
	|	NULL КАК Сумма,
	|	NULL КАК МетровЛДСП,
	|	МАКСИМУМ(ФизическиеЛица.Руководитель.Фамилия + "" "" + ПОДСТРОКА(ФизическиеЛица.Руководитель.Имя, 1, 1) + "". "" + ПОДСТРОКА(ФизическиеЛица.Руководитель.Отчество, 1, 1) + ""."") КАК Руководитель,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ВТ.План) = 0
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ВТ.Выручка) * 100 / МАКСИМУМ(ВТ.План)
	|	КОНЕЦ КАК ПроцПлана,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ВТ.План) = 0
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ВТ.Выручка) * 100 / МАКСИМУМ(ВТ.План) - МАКСИМУМ(ВТ.План) * (РАЗНОСТЬДАТ(&НачалоПериода, &ТекущаяДата, ДЕНЬ) + 1) / (РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, ДЕНЬ) + 1) * 100 / МАКСИМУМ(ВТ.План)
	|	КОНЕЦ КАК ОтклонениеПлана,
	|	1 КАК Порядок
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УправленческийОбороты.Субконто2 КАК Сотрудник,
	|			УправленческийОбороты.СуммаОборот КАК План,
	|			0 КАК Выручка,
	|			УправленческийОбороты.Период КАК Период
	|		ИЗ
	|			РегистрБухгалтерии.Управленческий.Обороты(
	|					&НачалоПериода,
	|					&КонецПериода,
	|					Регистратор,
	|					Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПоказателиСотрудника),
	|					,
	|					Подразделение.Регион = &Регион
	|						И Субконто1 = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСотрудников.ВыручкаПлан),
	|					,
	|					) КАК УправленческийОбороты
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			УправленческийОбороты.Субконто2,
	|			0,
	|			УправленческийОбороты.СуммаОборот,
	|			УправленческийОбороты.Период
	|		ИЗ
	|			РегистрБухгалтерии.Управленческий.Обороты(
	|					&НачалоПериода,
	|					&КонецПериода,
	|					Регистратор,
	|					Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПоказателиСотрудника),
	|					,
	|					Подразделение.Регион = &Регион
	|						И Субконто1 = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСотрудников.Выручка),
	|					,
	|					) КАК УправленческийОбороты) КАК ВТ
	|		ПО ФизическиеЛица.Ссылка = ВТ.Сотрудник
	|ГДЕ
	|	ФизическиеЛица.Должность В(&Должность)
	|	И ФизическиеЛица.Активность
	|	И ФизическиеЛица.Подразделение.Регион = &Регион
	|	И ВЫБОР
	|			КОГДА &СтаршийДизайнер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ФизическиеЛица.Руководитель = &СтаршийДизайнер
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ФизическиеЛица.Ссылка.Фамилия + "" "" + ПОДСТРОКА(ФизическиеЛица.Ссылка.Имя, 1, 1) + "". "" + ПОДСТРОКА(ФизическиеЛица.Ссылка.Отчество, 1, 1) + "".""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	докЗамер.АдресЗамера + "", тел. "" + докЗамер.Телефон + "" ("" + докЗамер.ИмяЗаказчика + "")"",
	|	докЗамер.Замерщик.Фамилия + "" "" + ПОДСТРОКА(докЗамер.Замерщик.Имя, 1, 1) + "". "" + ПОДСТРОКА(докЗамер.Замерщик.Отчество, 1, 1) + ""."",
	|	докЗамер.Офис,
	|	докЗамер.Автор.ФизическоеЛицо.Фамилия + "" "" + ПОДСТРОКА(докЗамер.Автор.ФизическоеЛицо.Имя, 1, 1) + "". "" + ПОДСТРОКА(докЗамер.Автор.ФизическоеЛицо.Отчество, 1, 1) + ""."",
	|	докЗамер.Ссылка,
	|	докЗамер.Дата,
	|	Встречи.Встреча.Дата,
	|	Встречи.Встреча.Ответственный.Фамилия + "" "" + ПОДСТРОКА(Встречи.Встреча.Ответственный.Имя, 1, 1) + "". "" + ПОДСТРОКА(Встречи.Встреча.Ответственный.Отчество, 1, 1) + ""."",
	|	NULL,
	|	NULL,
	|	""Замер"",
	|	NULL,
	|	NULL,
	|	Встречи.Встреча.Ответственный.Фамилия,
	|	ВЫБОР
	|		КОГДА НаличиеЗаметокПоПредмету.ЕстьЗаметка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НаличиеЗаметокПоПредмету.ЕстьЗаметка
	|	КОНЕЦ,
	|	докЗамер.Комментарий,
	|	докЗамер.Телефон,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	2
	|ИЗ
	|	Документ.Замер КАК докЗамер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктивностьЗамеров КАК АктивностьЗамеров
	|		ПО (АктивностьЗамеров.Замер = докЗамер.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеЗаметокПоПредмету КАК НаличиеЗаметокПоПредмету
	|		ПО (докЗамер.Ссылка = (ВЫРАЗИТЬ(НаличиеЗаметокПоПредмету.Предмет КАК Документ.Замер)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Замер.Ссылка КАК Ссылка,
	|			МИНИМУМ(ВстречаСКлиентом.Ссылка) КАК Встреча
	|		ИЗ
	|			Документ.Замер КАК Замер
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВстречаСКлиентом КАК ВстречаСКлиентом
	|				ПО (ВстречаСКлиентом.Основание = Замер.Ссылка)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Замер.Ссылка) КАК Встречи
	|		ПО докЗамер.Ссылка = Встречи.Ссылка
	|ГДЕ
	|	АктивностьЗамеров.Статус
	|	И докЗамер.Подразделение.Регион = &Регион
	|	И ВЫБОР
	|			КОГДА &СтаршийДизайнер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА докЗамер.Замерщик = &СтаршийДизайнер
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	докСпецификация.АдресМонтажа + "", тел. "" + ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Телефон + "" ("" + ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).ИмяЗаказчика + "")"",
	|	ВЫБОР
	|		КОГДА докСпецификация.ДокументОснование ССЫЛКА Документ.Замер
	|			ТОГДА ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Замерщик.Фамилия + "" "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Замерщик.Имя, 1, 1) + "". "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Замерщик.Отчество, 1, 1) + "".""
	|		КОГДА докСпецификация.ДокументОснование = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫРАЗИТЬ(докСпецификация.Автор КАК Справочник.Пользователи).ФизическоеЛицо.Руководитель.Фамилия + "" "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.Автор КАК Справочник.Пользователи).ФизическоеЛицо.Руководитель.Имя, 1, 1) + "". "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.Автор КАК Справочник.Пользователи).ФизическоеЛицо.Руководитель.Отчество, 1, 1) + "".""
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	докСпецификация.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СтатусСпецификацииСрезПоследних.Статус,
	|	докСпецификация.ДатаМонтажа,
	|	""Монтаж"",
	|	докСпецификация.Изделие,
	|	докСпецификация.Монтажник.Фамилия + "" "" + ПОДСТРОКА(докСпецификация.Монтажник.Имя, 1, 1) + "". "" + ПОДСТРОКА(докСпецификация.Монтажник.Отчество, 1, 1) + ""."",
	|	ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Замерщик.Фамилия,
	|	ВЫБОР
	|		КОГДА НаличиеЗаметокПоПредмету.ЕстьЗаметка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НаличиеЗаметокПоПредмету.ЕстьЗаметка
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА РазмещенСрезПоследних.Период ЕСТЬ NULL 
	|			ТОГДА РАЗНОСТЬДАТ(&ТекущаяДата, докСпецификация.ДатаОтгрузки, ДЕНЬ)
	|		ИНАЧЕ РАЗНОСТЬДАТ(РазмещенСрезПоследних.Период, докСпецификация.ДатаОтгрузки, ДЕНЬ)
	|	КОНЕЦ,
	|	РазмещенСрезПоследних.Период,
	|	NULL,
	|	NULL,
	|	NULL,
	|	докСпецификация.КоличествоМетровЛДСП,
	|	NULL,
	|	NULL,
	|	NULL,
	|	3
	|ИЗ
	|	Документ.Спецификация КАК докСпецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусСпецификации.СрезПоследних КАК СтатусСпецификацииСрезПоследних
	|		ПО (СтатусСпецификацииСрезПоследних.Спецификация = докСпецификация.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеЗаметокПоПредмету КАК НаличиеЗаметокПоПредмету
	|		ПО (докСпецификация.Ссылка = (ВЫРАЗИТЬ(НаличиеЗаметокПоПредмету.Предмет КАК Документ.Спецификация)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусСпецификации.СрезПоследних(, Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификации.Размещен)) КАК РазмещенСрезПоследних
	|		ПО (РазмещенСрезПоследних.Спецификация = докСпецификация.Ссылка)
	|ГДЕ
	|	докСпецификация.Подразделение.Регион = &Регион
	|	И ВЫБОР
	|			КОГДА &СтаршийДизайнер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Замер).Замерщик = &СтаршийДизайнер
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И докСпецификация.Проведен
	|	И СтатусСпецификацииСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификации.Установлен)
	|	И докСпецификация.ПакетУслуг = ЗНАЧЕНИЕ(Перечисление.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж)
	|	И докСпецификация.ДатаМонтажа <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ докСпецификация.Изделие = ЗНАЧЕНИЕ(Справочник.Изделия.ДопСоглашение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	докСпецификация.АдресМонтажа + "", тел. "" + ВЫРАЗИТЬ(ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Спецификация).ДокументОснование КАК Документ.Замер).Телефон + "" ("" + ВЫРАЗИТЬ(ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Спецификация).ДокументОснование КАК Документ.Замер).ИмяЗаказчика + "")"",
	|	ВЫБОР
	|		КОГДА докСпецификация.ДокументОснование ССЫЛКА Документ.Замер
	|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Спецификация).ДокументОснование КАК Документ.Замер).Замерщик.Фамилия + "" "" + ПОДСТРОКА(ВЫРАЗИТЬ(ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Спецификация).ДокументОснование КАК Документ.Замер).Замерщик.Имя, 1, 1) + "". "" + ПОДСТРОКА(ВЫРАЗИТЬ(ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Спецификация).ДокументОснование КАК Документ.Замер).Замерщик.Отчество, 1, 1) + "".""
	|		КОГДА докСпецификация.ДокументОснование = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫРАЗИТЬ(докСпецификация.Автор КАК Справочник.Пользователи).ФизическоеЛицо.Руководитель.Фамилия + "" "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.Автор КАК Справочник.Пользователи).ФизическоеЛицо.Руководитель.Имя, 1, 1) + "". "" + ПОДСТРОКА(ВЫРАЗИТЬ(докСпецификация.Автор КАК Справочник.Пользователи).ФизическоеЛицо.Руководитель.Отчество, 1, 1) + "".""
	|	КОНЕЦ,
	|	NULL,
	|	докСпецификация.Автор.ФизическоеЛицо.Фамилия + "" "" + ПОДСТРОКА(докСпецификация.Автор.ФизическоеЛицо.Имя, 1, 1) + "". "" + ПОДСТРОКА(докСпецификация.Автор.ФизическоеЛицо.Отчество, 1, 1) + ""."",
	|	докСпецификация.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СтатусСпецификацииСрезПоследних.Статус,
	|	NULL,
	|	""Переделка"",
	|	NULL,
	|	NULL,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Спецификация).ДокументОснование КАК Документ.Замер).Замерщик.Фамилия,
	|	ВЫБОР
	|		КОГДА НаличиеЗаметокПоПредмету.ЕстьЗаметка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НаличиеЗаметокПоПредмету.ЕстьЗаметка
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	РазмещенСрезПоследних.Период,
	|	докСпецификация.ДатаИзготовления,
	|	докСпецификация.Виновный.Фамилия + "" "" + ПОДСТРОКА(докСпецификация.Виновный.Имя, 1, 1) + "". "" + ПОДСТРОКА(докСпецификация.Виновный.Отчество, 1, 1) + ""."",
	|	докСпецификация.СуммаДокумента,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	4
	|ИЗ
	|	Документ.Спецификация КАК докСпецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусСпецификации.СрезПоследних(, ) КАК СтатусСпецификацииСрезПоследних
	|		ПО (СтатусСпецификацииСрезПоследних.Спецификация = докСпецификация.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеЗаметокПоПредмету КАК НаличиеЗаметокПоПредмету
	|		ПО (докСпецификация.Ссылка = (ВЫРАЗИТЬ(НаличиеЗаметокПоПредмету.Предмет КАК Документ.Спецификация)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусСпецификации.СрезПоследних(, Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификации.Размещен)) КАК РазмещенСрезПоследних
	|		ПО (РазмещенСрезПоследних.Спецификация = докСпецификация.Ссылка)
	|ГДЕ
	|	докСпецификация.Подразделение.Регион = &Регион
	|	И ВЫБОР
	|			КОГДА &СтаршийДизайнер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(докСпецификация.ДокументОснование КАК Документ.Спецификация).ДокументОснование КАК Документ.Замер).Замерщик = &СтаршийДизайнер
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И докСпецификация.Проведен
	|	И СтатусСпецификацииСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификации.Отгружен)
	|	И докСпецификация.Изделие = ЗНАЧЕНИЕ(Справочник.Изделия.Переделка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	докЗамер.АдресЗамера + "", тел. "" + докЗамер.Телефон + "" ("" + докЗамер.ИмяЗаказчика + "")"",
	|	докЗамер.Замерщик.Фамилия + "" "" + ПОДСТРОКА(докЗамер.Замерщик.Имя, 1, 1) + "". "" + ПОДСТРОКА(докЗамер.Замерщик.Отчество, 1, 1) + ""."",
	|	NULL,
	|	NULL,
	|	докАктВыполненияДоговора.Ссылка,
	|	докАктВыполненияДоговора.Дата,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	""Акт"",
	|	NULL,
	|	NULL,
	|	докЗамер.Замерщик.Фамилия,
	|	NULL,
	|	докАктВыполненияДоговора.Комментарий,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	5
	|ИЗ
	|	Документ.АктВыполненияДоговора КАК докАктВыполненияДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Замер КАК докЗамер
	|		ПО ((ВЫРАЗИТЬ(докАктВыполненияДоговора.Договор.Спецификация.ДокументОснование КАК Документ.Замер)) = докЗамер.Ссылка)
	|ГДЕ
	|	докАктВыполненияДоговора.Подразделение.Регион = &Регион
	|	И докАктВыполненияДоговора.ДатаПередачи = ДАТАВРЕМЯ(1, 1, 1)
	|	И ВЫБОР
	|			КОГДА &СтаршийДизайнер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ТОГДА докЗамер.Замерщик = &СтаршийДизайнер
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	ДатаЗамера,
	|	ДатаМонтажа
	|ИТОГИ
	|	МАКСИМУМ(Вид)
	|ПО
	|	Порядок";
	
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьШапка.Параметры.ДатаОтчета = Формат(ТекущаяДата(), "ДЛФ=DD");
	ОбластьШапка.Параметры.Замерщик = СтаршийДизайнер;
	ШапкаПоказана = Ложь;
	
	Если ОтчетСтДиз Тогда
		ТабДок.Вывести(ОбластьШапка);
		ШапкаПоказана = Истина;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ВидОтчета = Выборка.Вид;
		
		ЭтоЗамеры = ВидОтчета = "Замер";
		ЭтоМонтаж = ВидОтчета = "Монтаж";
		ЭтоАкт = ВидОтчета = "Акт"; 
		ЭтоПеределка = ВидОтчета = "Переделка";
		ЭтоПлан = ВидОтчета = "План";
		
		Если ОтчетСтДиз Тогда
			//ТабДок.Вывести(ОбластьПустаяСтрока);
			ТабДок.Вывести(ОбластьПустаяСтрока);
		КонецЕсли;
		
		Если ЭтоЗамеры Тогда
			ТабДок.Вывести(ОбластьШапкаЗамеры);
		ИначеЕсли ЭтоПлан И ОтчетСтДиз Тогда
			ТабДок.Вывести(ОбластьШапкаПлан);
		ИначеЕсли ЭтоМонтаж И ОтчетСтДиз Тогда	
			ТабДок.Вывести(ОбластьШапкаМонтаж);
		ИначеЕсли ЭтоАкт И ОтчетСтДиз Тогда	
			ТабДок.Вывести(ОбластьШапкаАкт);
		ИначеЕсли ЭтоПеределка И ОтчетСтДиз Тогда	
			ТабДок.Вывести(ОбластьШапкаПеределка);
		КонецЕсли;
		
		ВыборкаПоСотрудникам = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСотрудникам.Следующий() Цикл
			
			Если ЭтоЗамеры Тогда 
				
				ОбластьСтрокаЗамеры.Параметры.Заполнить(ВыборкаПоСотрудникам);
				ОбластьСтрокаЗамеры.Параметры.РасшифровкаАдрес = Новый Структура("РасшифровкаАдрес", ВыборкаПоСотрудникам.Предмет);
				ОбластьСтрокаЗамеры.Параметры.СтатусЗамеры = "";
				
				Если ЗначениеЗаполнено(ВыборкаПоСотрудникам.Заметка) И ВыборкаПоСотрудникам.Заметка Тогда
					ОбластьСтрокаЗамеры.Параметры.РасшифровкаЗаметка = Новый Структура("Заметка, Предмет", ВыборкаПоСотрудникам.Заметка, ВыборкаПоСотрудникам.Предмет);
				Иначе
					ОбластьСтрокаЗамеры.Параметры.РасшифровкаЗаметка = Неопределено;
				КонецЕсли;
				
				Если НачалоДня(ВыборкаПоСотрудникам.ДатаЗамера) = НачалоДня(ТекущаяДата()) Тогда
					ОбластьСтрокаЗамеры.Параметры.СтатусЗамеры = "Замер";
					ОбластьСтрокаЗамеры.Области.СтрокаЗамерыОбщ.Шрифт = Новый Шрифт(,9,Истина);
				ИначеЕсли НачалоДня(ВыборкаПоСотрудникам.ДатаЗамера) < НачалоДня(ТекущаяДата()) 
					И НачалоДня(ВыборкаПоСотрудникам.ДатаЗамера) >= НачалоДня(ДобавитьМесяц(ТекущаяДата(), -1)) Тогда
					ОбластьСтрокаЗамеры.Области.СтрокаЗамерыОбщ.ЦветТекста = Новый Цвет(0,0,0);
				ИначеЕсли НачалоДня(ВыборкаПоСотрудникам.ДатаЗамера) < НачалоДня(ДобавитьМесяц(ТекущаяДата(), -1)) Тогда
					ОбластьСтрокаЗамеры.Области.СтрокаЗамерыОбщ.ЦветТекста = Новый Цвет(252,0,0);	
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаПоСотрудникам.ДатаВстречи) Тогда
					Если НачалоДня(ВыборкаПоСотрудникам.ДатаВстречи) = НачалоДня(ТекущаяДата()) Тогда
						ОбластьСтрокаЗамеры.Параметры.СтатусЗамеры = "Встреча";
						ОбластьСтрокаЗамеры.Области.СтрокаЗамерыОбщ.Шрифт = Новый Шрифт(,9,Истина,Истина);
						ОбластьСтрокаЗамеры.Области.СтрокаЗамерыОбщ.ЦветТекста = Новый Цвет(0,0,0);
					ИначеЕсли НачалоДня(ВыборкаПоСотрудникам.ДатаВстречи) < НачалоДня(ТекущаяДата()) Тогда
						ОбластьСтрокаЗамеры.Параметры.ДатаВстречи = Неопределено;
					КонецЕсли;
				КонецЕсли;
				
				ТабДок.Вывести(ОбластьСтрокаЗамеры);
				
				ОбластьСтрокаЗамеры.Области.СтрокаЗамерыОбщ.ЦветТекста = Новый Цвет(0,0,0);
				ОбластьСтрокаЗамеры.Области.СтрокаЗамерыОбщ.Шрифт = Новый Шрифт(,8,Ложь,Ложь);
				
			ИначеЕсли ЭтоПлан И ОтчетСтДиз Тогда
				
				ОбластьСтрокаПлан.Параметры.Заполнить(ВыборкаПоСотрудникам);
				Если ЗначениеЗаполнено(ВыборкаПоСотрудникам.ОтклонениеПлана) И ВыборкаПоСотрудникам.ОтклонениеПлана < 0 Тогда
					ОбластьСтрокаПлан.Области.СтрокаПлан.ЦветТекста = Новый Цвет(252,0,0);
				КонецЕсли;
				
				ТабДок.Вывести(ОбластьСтрокаПлан);
				ОбластьСтрокаПлан.Области.СтрокаПлан.ЦветТекста = Новый Цвет(0,0,0);
				
			ИначеЕсли ЭтоМонтаж И ОтчетСтДиз Тогда
				
				ОбластьСтрокаМонтаж.Параметры.Заполнить(ВыборкаПоСотрудникам);
				ОбластьСтрокаМонтаж.Параметры.РасшифровкаАдрес = Новый Структура("РасшифровкаАдрес", ВыборкаПоСотрудникам.Предмет);
				ОбластьСтрокаМонтаж.Параметры.Изделие = Строка(ВыборкаПоСотрудникам.Изделие) + "(" + ВыборкаПоСотрудникам.МетровЛДСП + " м2)";
				
				СтатусСпецификации = ?(ВыборкаПоСотрудникам.РазницаДат < 4, Строка(ВыборкаПоСотрудникам.Статус) + " (НР- " + ВыборкаПоСотрудникам.ДатаРазмещения + ")", Строка(ВыборкаПоСотрудникам.Статус));
				ОбластьСтрокаМонтаж.Параметры.Статус = СтатусСпецификации;
								
				Если ЗначениеЗаполнено(ВыборкаПоСотрудникам.Заметка) И ВыборкаПоСотрудникам.Заметка Тогда
					ОбластьСтрокаМонтаж.Параметры.РасшифровкаЗаметка = Новый Структура("Заметка, Предмет", ВыборкаПоСотрудникам.Заметка, ВыборкаПоСотрудникам.Предмет);
				Иначе
					ОбластьСтрокаМонтаж.Параметры.РасшифровкаЗаметка = Неопределено;	
				КонецЕсли;
				
				Если НачалоДня(ВыборкаПоСотрудникам.ДатаМонтажа) = НачалоДня(ТекущаяДата()) Тогда
					ОбластьСтрокаМонтаж.Области.СтрокаМонтажОбщ.Шрифт = Новый Шрифт(,9,Истина);
				ИначеЕсли НачалоДня(ВыборкаПоСотрудникам.ДатаМонтажа) < НачалоДня(ТекущаяДата())
					ИЛИ Найти(СтатусСпецификации,"(НР") > 0 Тогда
					ОбластьСтрокаМонтаж.Области.СтрокаМонтажОбщ.ЦветТекста = Новый Цвет(252,0,0);
				КонецЕсли;
				
				ТабДок.Вывести(ОбластьСтрокаМонтаж);
				
				ОбластьСтрокаМонтаж.Области.СтрокаМонтажОбщ.ЦветТекста = Новый Цвет(0,0,0);
				ОбластьСтрокаМонтаж.Области.СтрокаМонтажОбщ.Шрифт = Новый Шрифт(,8,Ложь,Ложь);
				
			ИначеЕсли ЭтоАкт И ОтчетСтДиз Тогда
				
				ОбластьСтрокаАкт.Параметры.Заполнить(ВыборкаПоСотрудникам);			
				ТабДок.Вывести(ОбластьСтрокаАкт);
				
			ИначеЕсли ЭтоПеределка И ОтчетСтДиз Тогда
				
				ОбластьСтрокаПеределка.Параметры.Заполнить(ВыборкаПоСотрудникам);			
				ТабДок.Вывести(ОбластьСтрокаПеределка);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Подразделение", ПараметрыОтчета.Подразделение);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческийОстатки.Субконто2 КАК Договор,
	|	Договор.Автор.ФизическоеЛицо КАК Автор,
	|	Договор.Комментарий,
	|	Договор.Подразделение,
	|	Договор.СуммаДокумента КАК СуммаДоговора
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Остатки(
	|			&ТекущаяДата,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ВзаиморасчетыСПокупателями),
	|			,
	|			Субконто2 ССЫЛКА Документ.Договор
	|				И (ВЫРАЗИТЬ(Субконто2 КАК Документ.Договор)) <> ЗНАЧЕНИЕ(Документ.Договор.ПустаяСсылка)
	|				И Подразделение = &Подразделение) КАК УправленческийОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Договор КАК Договор
	|		ПО ((ВЫРАЗИТЬ(УправленческийОстатки.Субконто2 КАК Документ.Договор)) = Договор.Ссылка)
	|ГДЕ
	|	Договор.Подразделение = &Подразделение";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	ТЗ = Документы.Договор.РасчетПени(Выборка.ВыгрузитьКолонку("Договор"), КонецДня(ТекущаяДата()));
	
	Если ТЗ.Количество() > 0 Тогда
		
		Если НЕ ШапкаПоказана И ОтчетСтДиз Тогда
			ТабДок.Вывести(ОбластьПустаяСтрока);
			ОбластьШапка.Параметры.Замерщик = ФизическиеЛица.ФамилияИнициалыФизЛица(ТЗ[0].Автор);
			ТабДок.Вывести(ОбластьШапка);
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьПустаяСтрока);
		ТабДок.Вывести(ОбластьШапкаДоговоры);
		
	КонецЕсли;
	
	Для Каждого Строка Из ТЗ Цикл
		
		Замер = Строка.Договор.Спецификация.ДокументОснование;
			
		ОбластьСтрокаДоговоры.Параметры.Заполнить(Строка);
		
		Если ТипЗнч(Замер) = Тип("ДокументСсылка.Замер") Тогда
			ОбластьСтрокаДоговоры.Параметры.Адрес = Замер.АдресЗамера + ", тел. " + Замер.Телефон + " (" + Замер.ИмяЗаказчика + ")";
		КонецЕсли;
		
		ОбластьСтрокаДоговоры.Параметры.ПервыйПросроченныйПлатеж = Формат(Строка.ПервыйПросроченныйПлатеж, "ДФ=dd.MM.yyyy");
		ОбластьСтрокаДоговоры.Параметры.Автор = ФизическиеЛица.ФамилияИнициалыФизЛица(Строка.Автор);
		ОбластьСтрокаДоговоры.Параметры.РасшифровкаДоговор = Новый Структура("РасшифровкаДоговор", Строка.Договор);
		ТабДок.Вывести(ОбластьСтрокаДоговоры);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
