
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.НоменклатураПодразделений.Записывать = Истина;
	
	Для каждого Строка Из СписокНоменклатуры Цикл
		
		Если Строка.Номенклатура.Базовый Тогда
		
			Движение = Движения.НоменклатураПодразделений.Добавить();
			Движение.Период = Дата;
			Движение.Подразделение = Подразделение;
			ЗаполнитьЗначенияСвойств(Движение, Строка);
			
		Иначе
			
			Сообщить("Позиция не записана: "+Строка.НомерСтроки+". "+Строка.Номенклатура+". Номенклатура не базовая.");
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры
