Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,
	ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьНарядЗадания") Тогда
		ПодготовитьПечатнуюФорму("ПечатьНарядЗадания", "Печать наряд задания", "Документ.НарядЗадание.ПечатьНарядЗадания",
		МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьТребуемыйМатериал") Тогда
		ПодготовитьПечатнуюФорму("ПечатьТребуемыйМатериал", "Печать требуемый материал", "Документ.НарядЗадание.ПечатьНарядЗадания",
		МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	Если НужноПечататьМакет Тогда
		Если ИмяМакета = "ПечатьНарядЗадания" Тогда
			ТабДок = ПечатьНарядЗадания(МассивОбъектов, ОбъектыПечати);
		КонецЕсли;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьНарядЗадания(МассивОбъектов, ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ПечатьНарядЗадания";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета="дверь, двери, двери, ж, копейка, копейки, копеек, ж, 0";
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	
	Макет = Документы.НарядЗадание.ПолучитьМакет("ПечатьНарядЗадания");
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Подразделение", );
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	Запрос.Параметры.Вставить("ВидыСубконто", ВидыСубконто);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НарядЗаданиеСписокНоменклатуры.Номенклатура
	|ПОМЕСТИТЬ СписокНоменклатуры
	|ИЗ
	|	Документ.НарядЗадание.СписокНоменклатуры КАК НарядЗаданиеСписокНоменклатуры
	|ГДЕ
	|	НарядЗаданиеСписокНоменклатуры.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НарядЗаданиеСписокНоменклатуры.Ссылка КАК Ссылка,
	|	НарядЗаданиеСписокНоменклатуры.Ссылка.Подразделение,
	|	НарядЗаданиеСписокНоменклатуры.Ссылка.Номер,
	|	НарядЗаданиеСписокНоменклатуры.Ссылка.Дата,
	|	НарядЗаданиеСписокНоменклатуры.Номенклатура,
	|	НарядЗаданиеСписокНоменклатуры.КоличествоТребуется КАК КоличествоТребуется,
	|	УправленческийОстатки.КоличествоОстаток КАК ОстатокВЦеху,
	|	НарядЗаданиеСписокНоменклатуры.Ссылка.Подразделение.Руководитель КАК РуководительПодразделения,
	|	НарядЗаданиеСписокНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения,
	|	НарядЗаданиеСписокНоменклатуры.Номенклатура.ЦеховаяЗона КАК ЦеховаяЗона
	|ИЗ
	|	Документ.НарядЗадание.СписокНоменклатуры КАК НарядЗаданиеСписокНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
	|				,
	|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ОсновноеПроизводство),
	|				&ВидыСубконто,
	|				Субконто1 В
	|					(ВЫБРАТЬ
	|						СписокНоменклатуры.Номенклатура
	|					ИЗ
	|						СписокНоменклатуры)) КАК УправленческийОстатки
	|		ПО НарядЗаданиеСписокНоменклатуры.Ссылка.Подразделение = УправленческийОстатки.Подразделение
	|			И НарядЗаданиеСписокНоменклатуры.Номенклатура = УправленческийОстатки.Субконто1
	|ГДЕ
	|	НарядЗаданиеСписокНоменклатуры.Ссылка В(&Ссылка)
	|ИТОГИ ПО
	|	Ссылка,
	|	ЦеховаяЗона";
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокНоменклатурыШапка = Макет.ПолучитьОбласть("СписокНоменклатурыШапка");
	ОбластьСписокНоменклатуры = Макет.ПолучитьОбласть("СписокНоменклатуры");
	ОбластьСписокИнженерныхРасчетовШапка = Макет.ПолучитьОбласть("СписокИнженерныхРасчетовШапка");
	ОбластьСписокИнженерныхРасчетов = Макет.ПолучитьОбласть("СписокИнженерныхРасчетов");
	ОбластьЦеховаяЗонаШапка = Макет.ПолучитьОбласть("ЦеховаяЗонаШапка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка.Ссылка);
		Шапка.Параметры.Склад = Выборка.Подразделение.ОсновнойСклад;
		Шапка.Параметры.Номер = Строка(Формат(Число(Выборка.Номер),"ЧГ=0"));
		ТабДок.Вывести(Шапка);
		
		ТабДок.Вывести(ОбластьСписокИнженерныхРасчетовШапка);
		Для каждого Строка Из Выборка.Ссылка.СписокСпецификаций Цикл
			
			КоличествоДверей = Строка.Спецификация.СписокДверей.Количество();
			Если КоличествоДверей > 0 Тогда
				КоличествоДверейПрописью = ЧислоПрописью(КоличествоДверей, ФормСтрока, ПарПредмета);
			КонецЕсли;
			
			ОбластьСписокИнженерныхРасчетов.Параметры.НомерСтроки = Строка.НомерСтроки;
			ОбластьСписокИнженерныхРасчетов.Параметры.Спецификация = "Спецификация № " + Строка.Спецификация.Номер;
			ОбластьСписокИнженерныхРасчетов.Параметры.КоличествоДверей = КоличествоДверейПрописью;
			ОбластьСписокИнженерныхРасчетов.Параметры.СуммаНаряда = Строка.СуммаНаряда;
			ОбластьСписокИнженерныхРасчетов.Параметры.ДатаИзготовления = Строка.ДатаИзготовления;
			
			ТабДок.Вывести(ОбластьСписокИнженерныхРасчетов);
			
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьСписокНоменклатурыШапка);
		
		ВыборкаЦеховаяЗона = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЦеховаяЗона.Следующий() Цикл
			ОбластьЦеховаяЗонаШапка.Параметры.ЦеховаяЗона = ВыборкаЦеховаяЗона.ЦеховаяЗона;
			ТабДок.Вывести(ОбластьЦеховаяЗонаШапка);
			ВыборкаСписокНоменклатуры = ВыборкаЦеховаяЗона.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСписокНоменклатуры.Следующий() Цикл
				ОбластьСписокНоменклатуры.Параметры.Заполнить(ВыборкаСписокНоменклатуры);
				ТабДок.Вывести(ОбластьСписокНоменклатуры);
			КонецЦикла;
		КонецЦикла; 
		
		Подвал.Параметры.Заполнить(Выборка);
		Подвал.Параметры.МОЛ = Выборка.Подразделение.ОсновнойСклад.МОЛ;
		ТабДок.Вывести(Подвал);
			
		ВставлятьРазделительСтраниц = Истина;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 
		НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры
