&НаКлиенте
Процедура ОткрытьЗаписьНаЗамер(Команда)
	
	ОткрытьФорму("Обработка.ЗаписьНаЗамер.Форма");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЕстьДоговор 											= "Договор заключен";
	ДолгийРасчетСтоимости 							= "Рассчитайте изделие";
	Элементы.Список.Период.ДатаНачала 		= НачалоДня(ТекущаяДата() - (7 * 24 * 60 * 60));
	Элементы.Список.Период.ДатаОкончания 	= Дата('00010101');
	//Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗамеров(Команда)
	
	ОткрытьФорму("Отчет.ГрафикЗамеров.Форма.ФормаОтчета");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры
