
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЗ = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицы);
	
	Для каждого Элем Из ТЗ Цикл
		НоваяСтрока = СписокСообщений.Добавить();
		НоваяСтрока.Дата = Элем.Дата;
		НоваяСтрока.Номер = Элем.Номер;
		НоваяСтрока.Тема = Элем.Тема;
		НоваяСтрока.Ссылка = Элем.Ссылка;
	КонецЦикла;
 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСообщенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		
		СтандартнаяОбработка=Ложь;
		
		ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущиеДанные.Ссылка);
		ОткрытьФорму("Документ.СообщениеДилеру.Форма.ФормаПросмотра", ПараметрыФормы, ЭтаФорма);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьСписок" Тогда
		
		Для каждого Строка Из СписокСообщений Цикл
			Если  Строка.Ссылка = Параметр Тогда
			      СписокСообщений.Удалить(Строка);
			КонецЕсли;	
		КонецЦикла;
		
		Если СписокСообщений.Количество() = 0 Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

