
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСообщений.ЗагрузитьЗначения(Параметры.МассивСообщений); 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСообщенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСообщенийПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСообщенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		
		СтандартнаяОбработка=Ложь;
		
		ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущиеДанные.Значение);
		ОткрытьФорму("Документ.СообщениеДилеру.Форма.ФормаПросмотра", ПараметрыФормы);

	КонецЕсли;
	
КонецПроцедуры