
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьПлан)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьПлан(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьПлан(ТабДок, ПараметрКоманды)
	Документы.ПланРуководителя.ПечатьПлан(ТабДок, ПараметрКоманды);
КонецПроцедуры
