
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЕстьСпецификация(ПараметрКоманды) Тогда
		
		ТабДок = Новый ТабличныйДокумент;
		ПечатьАктДоставкаСборка(ТабДок, ПараметрКоманды);
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Защита = Ложь;
		ТабДок.ТолькоПросмотр = Ложь;
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.Показать("Акт доставки сборки");
		
	Иначе
		
		ТекстСообщения = "Запрещено распечатывать Акт доставки без спецификации";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ПараметрКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПечатьАктДоставкаСборка(ТабДок, ПараметрКоманды)
	
	Документы.Монтаж.ПечатьАктДоставкаСборка(ТабДок, ПараметрКоманды);
	
КонецПроцедуры

&НаСервере
Функция ЕстьСпецификация(Монтаж)
	
	Спецификация = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Монтаж, "Спецификация");
	//МассивДокументов = ЛексСервер.НайтиПодчиненныеДокументы(Спецификация, "Документ.Спецификация", "ДокументОснование");
	Ответ = ЗначениеЗаполнено(Спецификация);
	
	Возврат Ответ;
	
КонецФункции // ПроверитьРасчетИнженера()
