
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьОперативныйЗакуп(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать("Опериативный закуп");
	
КонецПроцедуры

&НаСервере
Процедура ПечатьОперативныйЗакуп(ТабДок, ПараметрКоманды)
	Документы.ОперативныйЗакуп.ПечатьОперативныйЗакуп(ТабДок, ПараметрКоманды);
КонецПроцедуры
