////////////////////////////////////////////////////////////////////////////////
// Подсистема "Информационный центр".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Открывает форму отображения отдельной новости.
//
// Параметры:
//	Идентификатор - УникальныйИдентификатор - идентификатор новости.
//
Процедура ПоказатьНовость(Идентификатор) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОткрытьНовость");
	ПараметрыФормы.Вставить("Идентификатор", Идентификатор);
	ОткрытьФорму("Обработка.ИнформационныйЦентр.Форма.ОтображениеСообщений", ПараметрыФормы);
	
КонецПроцедуры

// Открывает форму отображения всех новостей.
//
//
Процедура ПоказатьВсеСообщения() Экспорт
	
	ПараметрыФормы = Новый Структура("ОткрытьВсеСообщения");
	ОткрытьФорму("Обработка.ИнформационныйЦентр.Форма.ОтображениеСообщений", ПараметрыФормы);
	
КонецПроцедуры

// Возвращает размер в мегабайтах, размер вложения не больше 20 Мегабайт.
//
// Возвращаемое значение:
//	Число - размер вложений в мегабайтах.
//
Функция МаксимальныйРазмерВложенийДляОтправкиСообщенияВПоддержкуСервиса() Экспорт
	
	Возврат 20;
	
КонецФункции

// Открывает форму по отправке сообщения получателю.
//
Процедура ОткрытьФормуОтправкиСообщенияВТехподдержку(ПараметрыСообщения = Неопределено) Экспорт
	
	ОткрытьФорму("Обработка.ИнформационныйЦентр.Форма.ОтправкаСообщенияВПоддержку", ПараметрыСообщения);
	
КонецПроцедуры

// Процедура-обработчик при нажатии на информационную ссылку.
//
// Параметры:
//	Форма - УправляемаяФорма - контекст управляемой формы.
//	Элемент - ЭлементФормы - группа формы.
//
Процедура НажатиеНаИнформационнуюСсылку(Форма, Элемент) Экспорт
	
	Гиперссылка = Форма.ИнформационныеСсылки.НайтиПоЗначению(Элемент.Имя);
	
	Если Гиперссылка <> Неопределено Тогда
		
		ПерейтиПоНавигационнойСсылке(Гиперссылка.Представление);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура-обработчик при нажатии на "Все" информационные ссылки.
//
// Параметры:
//	ПутьКФорме - Строка - полный путь к форме.
//
Процедура НажатиеНаСсылкуВсеИнформационныеСсылки(ПутьКФорме) Экспорт
	
	ПараметрыФормы = Новый Структура("ПутьКФорме", ПутьКФорме);
	ОткрытьФорму("Обработка.ИнформационныйЦентр.Форма.ИнформационныеСсылкиВКонтексте", ПараметрыФормы);
	
КонецПроцедуры

// Открывает форму с содержанием пожелания.
//
// ИдентификаторПожелания - Строка - уникальный идентификатор пожелания.
//
Процедура ПоказатьПожелание(ИдентификаторПожелания) Экспорт
	
	ПараметрыФормы = Новый Структура("ИдентификаторПожелания", ИдентификаторПожелания);
	ОткрытьФорму("Обработка.ИнформационныйЦентр.Форма.Пожелание", ПараметрыФормы);
	
КонецПроцедуры