////////////////////////////////////////////////////////////////////////////////
// Подсистема "Информационный центр".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Открывает форму отображения отдельной новости.
//
// Параметры:
//	ВнешняяСсылка - Строка - внешняя ссылка.
//	Идентификатор - УникальныйИдентификатор - идентификатор новости.
//
Процедура ПоказатьНовость(ВнешняяСсылка, Идентификатор) Экспорт
	
	Если Не ПустаяСтрока(ВнешняяСсылка) Тогда 
		ПерейтиПоНавигационнойСсылке(ВнешняяСсылка);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОткрытьНовость");
	ПараметрыФормы.Вставить("Идентификатор", Идентификатор);
	ОткрытьФорму("ОбщаяФорма.ОтображениеНовостей", ПараметрыФормы);
	
КонецПроцедуры

// Открывает форму отображения всех новостей.
//
//
Процедура ПоказатьВсеНовости() Экспорт
	
	ПараметрыФормы = Новый Структура("ОткрытьВсеНовости");
	ОткрытьФорму("ОбщаяФорма.ОтображениеНовостей", ПараметрыФормы);
	
КонецПроцедуры

// Возвращает размер в мегабайтах, размер вложения не больше 25 Мегабайта.
//
// Возвращаемое значение:
//	Число - размер вложений в мегабайтах.
//
Функция МаксимальныйРазмерВложенийДляОтправкиСообщенияВПоддержкуСервиса() Экспорт
	
	Возврат 20;
	
КонецФункции

// Открывает форму по отправке сообщения получателю.
//
Процедура ОткрытьФормуОтправкиСообщенияВТехподдержку(ИспользоватьРазделениеПоОбластямДанных, ПараметрыСообщения = Неопределено) Экспорт
	
	Если ИспользоватьРазделениеПоОбластямДанных Тогда  
		ОткрытьФорму("ОбщаяФорма.ОтправкаСообщенияВТехподдержку", ПараметрыСообщения);
	КонецЕсли;
	
КонецПроцедуры
