#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
#Область СлужебныеПроцедурыИФункции
 
// Заполняет настройки вариантов отчета.
// Подробнее - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	
	Отчет = МодульВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПросроченныеЗадачи);
	Отчет.Описание = НСтр("ru = 'Список задач, выполненных с нарушением сроков, по исполнителям.'");
	
	Вариант = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, Отчет, "ЗадачиВыполненныеСНарушениемСроков");
	Вариант.Описание = НСтр("ru = 'Список задач, выполненных с нарушением сроков, по исполнителям.'");
	
КонецПроцедуры
 
#КонецОбласти

#КонецЕсли