////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными в модели сервиса".
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СинхронизацияССервисомДавноНеВыполнялась() Экспорт
	
	Возврат АвтономнаяРаботаСлужебный.СинхронизацияССервисомДавноНеВыполнялась();
	
КонецФункции

Функция ПараметрыФормыВыполненияОбменаДанными() Экспорт
	
	Возврат АвтономнаяРаботаСлужебный.ПараметрыФормыВыполненияОбменаДанными();
	
КонецФункции
