
&НаКлиенте
Процедура СпецификацияПриИзменении(Элемент)
	
	СформироватьНаСервере(ТабДок, Отчет.Спецификация);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьНаСервере(ТабДок, Спецификация)
	
	ТабДок.Очистить();
	ТабДок = Отчеты.ИсторияСтатусовСпецификаций.СформироватьОтчет(Спецификация);
	ТабДок.НижнийКолонтитул.ТекстВЦентре = "[&НомерСтраницы]/[&СтраницВсего]" ;
	ТабДок.НижнийКолонтитул.Выводить = Истина;
	ТабДок.РазмерКолонтитулаСнизу = 10;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ссылка") Тогда
		Отчет.Спецификация = Параметры.Ссылка;
		СформироватьНаСервере(ТабДок, Параметры.Ссылка);
	КонецЕсли;
	
КонецПроцедуры
