
///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ОПРЕДЕЛЕНИЯ ТИПОВ

//Функция описание типа договора
//
Функция ПолучитьОписаниеТиповДоговора() Экспорт
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.Договор"));
	МассивТипов.Добавить(Тип("ДокументСсылка.Спецификация"));
	
	Возврат Новый ОписаниеТипов(МассивТипов);
	
КонецФункции

//Функция возвращает описание типа банковского счета организации
//
Функция ТипЗначенияБанковскогоСчетаОрганизации() Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// Функция ПолучитьОписаниеТиповБанковскогоСчетаОрганизации ОписаниеТипов
// для банковских счетов организаций.
//
Функция ПолучитьОписаниеТиповБанковскогоСчетаОрганизации() Экспорт

	Возврат Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");	

КонецФункции // ПолучитьОписаниеТиповБанковскогоСчетаОрганизации()

// Функция ПолучитьОписаниеТиповНоменклатурнойГруппы возвращает 
// тип для номенклатурной группы.
//
Функция ПолучитьОписаниеТиповНоменклатурнойГруппы() Экспорт

	Возврат Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы");

КонецФункции

// Функция ОписаниеТиповПодразделения возвращает 
// описание типов для справочника подразделений.
//
Функция ОписаниеТиповПодразделения() Экспорт

	Возврат Новый ОписаниеТипов("СправочникСсылка.Подразделения");

КонецФункции

//Функция возвращает тип для справочника подразделений.
//
Функция ТипПодразделения() Экспорт
	
	Возврат Тип("СправочникСсылка.Подразделения");

КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ОПРЕДЕЛЕНИЯ ХАРАКТЕРА ОПЕРАЦИИ ПО ТИПУ РЕГИСТРАТОРОВ

// Функция проверяет, является ли переданный по ссылке документ документом возврата товаров.
//
Функция ДокументЯвляетсяВозвратом(СсылкаНаДокумент) Экспорт
	
	Возврат Ложь;
	
КонецФункции // ДокументЯвляетсяВозвратом()

// Функция проверяет, является ли переданный по ссылке документ документом реализации отгруженных товаров.
//
Функция ДокументЯвляетсяРеализациейОтгруженныхТоваров(СсылкаНаДокумент) Экспорт

	Возврат Ложь;
	
КонецФункции // ДокументЯвляетсяРеализациейОтгруженныхТоваров()

// Функция ДокументЯвляетсяРеализацией возвращает Истина, если переданный по ссылке документ
// является документом реализации (товаров, услуг, ОС, НМА)
//
Функция ДокументЯвляетсяРеализацией(СсылкаНаДокумент) Экспорт
	
	Возврат Ложь;
	
КонецФункции // ДокументЯвляетсяРеализацией()

// Функция проверяет, является ли переданный по ссылке документ отчетом комитенту.
//
Функция ДокументЯвляетсяОтчетомКомитенту(СсылкаНаДокумент) Экспорт

	Возврат Ложь;
	
КонецФункции // ДокументЯвляетсяОтчетомКомитенту()

// Функция проверяет, является ли переданный по ссылке документ поступление доп.расходов.
//
Функция ДокументЯвляетсяПоступлениемДопРасходов(СсылкаНаДокумент) Экспорт

	Возврат Ложь;
	
КонецФункции // ДокументЯвляетсяОтчетомКомитенту()

// Функция ЭтоРегламентнаяОперация возвращает Истина, если переданный по ссылке документ
// является документом регламентной операции.
//
Функция ЭтоРегламентнаяОперация(СсылкаНаДокумент) Экспорт

	Возврат Ложь;

КонецФункции // ЭтоРегламентнаяОперация()

///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ОПРЕДЕЛЕНИЯ ИМЕН РЕКВИЗИТОВ

// Функция ПолучитьИмяРеквизитаКонтрагентДоговора имя реквизита в справочнике
// ДоговорыКонтрагентов, в котором храниться ссылка на контрагента-владельца.
//
Функция ПолучитьИмяРеквизитаКонтрагентДоговора() Экспорт

	Возврат "Владелец";

КонецФункции

// Функция ПолучитьИмяРеквизитаВидДоговора имя реквизита в справочнике
// ДоговорыКонтрагентов, по которому определяется вид договора.
//
Функция ПолучитьИмяРеквизитаВидДоговора() Экспорт

	Возврат "ВидДоговора";

КонецФункции

// Функция ПолучитьИмяРеквизитаНоменклатурнаяГруппаНоменклатуры возвращает 
// имя реквизита НоменклатурнаяГруппа в справочнике Номенклатура
//
Функция ПолучитьИмяРеквизитаНоменклатурнаяГруппаНоменклатуры() Экспорт

	Возврат "НоменклатурнаяГруппа";

КонецФункции

Функция ПолучитьИмяСправочникаНоменклатурныеГруппы() Экспорт

	Возврат "НоменклатурныеГруппы";

КонецФункции

// Функция возвращает строку с именем реквизита в справочнике подразделений,
// определяющего организацию подразделения, либо пустую строку, если справочник 
// подразделений не является подчиненным справочником.
//
Функция ИмяРеквизитаОрганизацияПодразделения() Экспорт
	
	Возврат "Владелец";

КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ СООБЩЕНИЙ

// Функция возвращает строку с навигационной ссылкой на раздел ОС и НМА.
//
Функция ПолучитьНавигационнуюСсылкуНаРазделОСиНМА() Экспорт

	Возврат "e1cib/navigationpoint/ОсновныеСредстваИНМА";

КонецФункции // ПолучитьНавигационнуюСсылкуНаРазделОСиНМА()

// Функция возвращает строку с навигационной ссылкой для открытия учетной политики организации.
//
Функция ПолучитьНавигационнуюСсылкуНаУчетнуюПолитикуОрганизации() Экспорт

	Возврат "e1cib/navigationpoint/БухгалтерскийИНалоговыйУчет.УчетнаяПолитика/РегистрСведений.УчетнаяПолитикаОрганизаций.Команда.ОткрытьСписок";

КонецФункции // ПолучитьНавигационнуюСсылкуНаУчетнуюПолитикуОрганизации()
