
Функция СформироватьОтчет(ПараметрыОтчета) Экспорт
	
	НачалоПериода 	= ПараметрыОтчета.Период.ДатаНачала;
	КонецПериода 	= ПараметрыОтчета.Период.ДатаОкончания;
	Монтажник			= ПараметрыОтчета.Монтажник;
	Город 				= ПараметрыОтчета.Город;
	
	Макет = Отчеты.ГрафикМонтажа.ПолучитьМакет("ГрафикМонтажа");
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Монтажник КАК Монтажник,
	|	Монтаж.Ссылка КАК СсылкаНаМонтаж,
	|	Монтаж.Ссылка.Дата КАК ДатаДоставки,
	|	Монтаж.ДатаМонтажа КАК Дата,
	|	Монтаж.Ссылка.Экспедитор КАК Экспедитор,
	|	Монтаж.Спецификация.АдресМонтажа КАК АдресМонтажа,
	|	Монтаж.Спецификация.Доставка КАК Доставка,
	|	Монтаж.ДатаМонтажа КАК ДатаМонтажа,
	|	Договор.Номер КАК НомерДоговора,
	|	Договор.Контрагент.Телефон КАК Телефон1,
	|	Договор.Ссылка КАК СсылкаНаДоговор
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Договор КАК Договор
	|		ПО Монтаж.Спецификация = Договор.Спецификация
	|ГДЕ
	|	Монтаж.ДатаМонтажа МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Монтаж.Ссылка.Проведен
	|	И Монтаж.Монтажник = &Монтажник
	|	И Договор.Офис.Город = &Город
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Если НЕ ЗначениеЗаполнено(Монтажник) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Монтаж.Монтажник = &Монтажник", "");
		
	КонецЕсли;
	
	Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
	Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
	Запрос.Параметры.Вставить("Монтажник", Монтажник);
	Запрос.Параметры.Вставить("Город", Город);
	
	Если НЕ ЗначениеЗаполнено(Монтажник) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Монтаж.Монтажник = &Монтажник", "");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Город) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Договор.Офис.Город = &Город", "");
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.ПериодСтр = ПредставлениеПериода(НачалоПериода, КонецПериода);
	Строка = Макет.ПолучитьОбласть("Строка");
	ПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ТабДок 									= Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб 				= Истина;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 						= Ложь;
	ТабДок.ТолькоПросмотр 			= Ложь;
	
	ТабДок.Очистить();
	ТабДок.Вывести(Шапка);
		
	НомерСтроки = 5;
	НачалоТекДата = 5;
	ТекДата = '0001.01.01';
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекДата) Тогда
			ТекДата = НачалоДня(Выборка.ДатаМонтажа) ;
		КонецЕсли;
		
		НомерСтроки = 1 + НомерСтроки;
		
		Если НачалоДня(ТекДата) <> НачалоДня(Выборка.ДатаМонтажа) Тогда
			
			ТабДок.Вывести(ПустаяСтрока);
			ТабДок.Вывести(ПустаяСтрока);
			НомерСтроки = 2 + НомерСтроки;
			
			Область = ТабДок.Область(НачалоТекДата, 1, НомерСтроки - 2, 1);
			Область.Объединить();
			ТекДата = НачалоДня(Выборка.ДатаМонтажа);
			НачалоТекДата = НомерСтроки - 1;
			
		КонецЕсли;
		
		Строка.Параметры.Заполнить(Выборка);
		//Если Выборка.Самовывоз Тогда
		//	Строка.Параметры.Комментарий = "Самовывоз / " + Выборка.Комментарий;
		//КонецЕсли;
		
		Адрес 								= Отчеты.ГрафикЗамеров.ПолучитьСтруктуруАдреса(Выборка.АдресМонтажа);
		Строка.Параметры.Подъезд 	= Адрес.Подъезд;
		Строка.Параметры.Этаж 		= Адрес.Этаж;
		Строка.Параметры.Код 		= Адрес.КодПодъезда;
		Строка.Параметры.Дата 		= Формат((Выборка.ДатаМонтажа), "ДФ = дд.ММ")+" "+Формат((Выборка.ДатаМонтажа), "ДФ = дддд");
		//Строка.Параметры.ДатаВремяДоставки = Формат((Выборка.ДатаДоставки), "ДФ = дд.МММ")
		//+Символы.ПС+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1:00-%2:00", Выборка.ВремяДоставкиНачало, Выборка.ВремяДоставкиКонец);
		
		Строка.Параметры.Телефоны = Выборка.Телефон1;// + Символы.ПС + Выборка.Телефон2;
		ТабДок.Вывести(Строка);
		
	КонецЦикла;
	
	ТабДок.Вывести(ПустаяСтрока);
	ТабДок.Вывести(ПустаяСтрока);
	НомерСтроки = 2 + НомерСтроки;
	
	Область = ТабДок.Область(НачалоТекДата, 1, НомерСтроки - 1, 1);
	Область.Объединить();
	Возврат ТабДок;
	
КонецФункции
