
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = Ложь;
	
	ХранимыйФайлРаскрой = "НовыйРаскрой";
	ХранимыйФайлКривойПил = "КривойПил";
	
	СпецификацияСсылка = ПараметрКоманды;
		
	СвойстваРаскроя = ПолучитьСвойстваРаскроя(СпецификацияСсылка, Отказ);
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раскрой не сформирован. Перезапишите спецификацию.");
		Возврат;	
	Иначе	
		ПолучитьРисункиРаскроя(СвойстваРаскроя, СпецификацияСсылка);
		ЗаписатьРисункиРаскроя(СвойстваРаскроя, СпецификацияСсылка, Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваРаскроя.СтрокаРаскрой) Тогда
		
		ВидОтображения = ПолучитьВидОтображенияФлэш(СпецификацияСсылка);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Спецификация", СпецификацияСсылка);
		ПараметрыФормы.Вставить("ХранимыйФайл", ХранимыйФайлРаскрой);
		ПараметрыФормы.Вставить("СтрокаНовогоРаскрояЛДСП", СвойстваРаскроя.СтрокаРаскрой);
		ПараметрыФормы.Вставить("ВидОтображения", ВидОтображения);
		ОткрытьФорму("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы,, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваРаскроя.СтрокаКривогоПилаФРС) Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Спецификация", "КриволинейныеДеталиФРС", ПараметрКоманды, ПараметрыВыполненияКоманды, Неопределено);

	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваРаскроя.СтрокаКривогоПилаСтеколка) Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Спецификация", "КриволинейныеДеталиСтеколка", ПараметрКоманды, ПараметрыВыполненияКоманды, Неопределено);

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОтображенияФлэш(Спецификация) Экспорт
	
	ВидОтображения = "2";
	
	Проведен = Спецификация.Проведен;
	Статус = Документы.Спецификация.ПолучитьСтатусСпецификации(Спецификация);
	
	Если Спецификация.Дилерский И НЕ (Проведен И (Статус <> Перечисления.СтатусыСпецификации.Сохранен)) Тогда	
		ВидОтображения = "3";
	КонецЕсли;
	
	Возврат ВидОтображения;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРисункиРаскроя(СвойстваРаскроя, СпецификацияСсылка)
	
	СвойстваРаскроя.Вставить("РисунокКривогоПилаФРС", "");
	СвойстваРаскроя.Вставить("РисунокКривогоПилаСтеколка", "");
	
	СвойстваРаскроя.Вставить("РисунокРаскроя", "");
	
	ВидОтображения = ПолучитьВидОтображенияФлэш(СпецификацияСсылка);
	
	Если ЗначениеЗаполнено(СвойстваРаскроя.СтрокаКривогоПилаФРС) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Спецификация", СпецификацияСсылка);
		ПараметрыФормы.Вставить("ХранимыйФайл", "КривойПил");
		ПараметрыФормы.Вставить("СтрокаКривогоПила", СвойстваРаскроя.СтрокаКривогоПилаФРС);
		ПараметрыФормы.Вставить("ВидОтображения", ВидОтображения);
		
		СвойстваРаскроя.РисунокКривогоПилаФРС = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваРаскроя.СтрокаКривогоПилаСтеколка) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Спецификация", СпецификацияСсылка);
		ПараметрыФормы.Вставить("ХранимыйФайл", "КривойПил");
		ПараметрыФормы.Вставить("СтрокаКривогоПила", СвойстваРаскроя.СтрокаКривогоПилаСтеколка);
		ПараметрыФормы.Вставить("ВидОтображения", ВидОтображения);
		
		СвойстваРаскроя.РисунокКривогоПилаСтеколка = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаписатьРисункиРаскроя(СвойстваРаскроя, СпецификацияСсылка, Отказ)
	
	НаборЗаписей = ПолучитьНаборЗаписейРегистра(СпецификацияСсылка, Отказ);
	
	Запись = НаборЗаписей[0];
	
	Если Запись <> Неопределено Тогда
		
		Запись.РисунокКривогоПилаФРС = СвойстваРаскроя.РисунокКривогоПилаФРС;
		Запись.РисунокКривогоПилаСтеколка = СвойстваРаскроя.РисунокКривогоПилаСтеколка;
		Запись.РисунокРаскроя = СвойстваРаскроя.РисунокРаскроя;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьНаборЗаписейРегистра(СпецификацияСсылка, Отказ)
	
	НаборЗаписей = РегистрыСведений.РаскройДеталей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(СпецификацияСсылка);
	
	НаборЗаписей.Прочитать();
	
	Отказ = НаборЗаписей.Количество() <> 1;
	
	Возврат НаборЗаписей;
	
КонецФункции

&НаСервере
Функция ПолучитьСвойстваРаскроя(СпецификацияСсылка, Отказ)
	
	НаборЗаписей = РегистрыСведений.РаскройДеталей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(СпецификацияСсылка);
	
	НаборЗаписей.Прочитать();
	
	Отказ = НаборЗаписей.Количество() <> 1;
	
	Если НЕ Отказ Тогда
		
		Н = НаборЗаписей[0];
		
		Свойства = Новый Структура();
		Свойства.Вставить("СтрокаРаскрой",Н.СтрокаРаскрой);
		Свойства.Вставить("СтрокаКривогоПилаФРС",Н.СтрокаКривогоПилаФРС);
		Свойства.Вставить("СтрокаКривогоПилаСтеколка",Н.СтрокаКривогоПилаСтеколка);
		
		Возврат Свойства;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

