
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = Ложь;
	
	СпецификацияСсылка = ПараметрКоманды;
		
	СвойстваРаскроя = ОбновитьРаскройНаСервере(СпецификацияСсылка);
	
	ПолучитьРисункиКриволинейных(СвойстваРаскроя, СпецификацияСсылка);
	ЗаписатьРисункиКриволинейных(СвойстваРаскроя, СпецификацияСсылка, Отказ);
	
	Если ЗначениеЗаполнено(СвойстваРаскроя.СтрокаРаскрой) Тогда
		
		ВидОтображения = ПолучитьВидОтображенияФлэш(СпецификацияСсылка);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Спецификация", СпецификацияСсылка);
		ПараметрыФормы.Вставить("ХранимыйФайл", "НовыйРаскрой");
		ПараметрыФормы.Вставить("СтрокаНовогоРаскрояЛДСП", СвойстваРаскроя.СтрокаРаскрой);
		ПараметрыФормы.Вставить("ВидОтображения", ВидОтображения);
		ОткрытьФорму("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы,, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваРаскроя.СтрокаКривогоПилаФРС) Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Спецификация", "КриволинейныеДеталиФРС", ПараметрКоманды, ПараметрыВыполненияКоманды, Неопределено);

	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваРаскроя.СтрокаКривогоПилаСтеколка) Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Спецификация", "КриволинейныеДеталиСтеколка", ПараметрКоманды, ПараметрыВыполненияКоманды, Неопределено);

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОтображенияФлэш(Спецификация) Экспорт
	
	ВидОтображения = "2";
	
	Проведен = Спецификация.Проведен;
	Статус = Документы.Спецификация.ПолучитьСтатусСпецификации(Спецификация);
	
	Если Спецификация.Дилерский И НЕ (Проведен И (Статус <> Перечисления.СтатусыСпецификации.Сохранен)) Тогда	
		ВидОтображения = "3";
	КонецЕсли;
	
	Возврат ВидОтображения;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРисункиКриволинейных(СвойстваРаскроя, СпецификацияСсылка)
	
	СвойстваРаскроя.Вставить("РисунокКривогоПилаФРС", "");
	СвойстваРаскроя.Вставить("РисунокКривогоПилаСтеколка", "");
	
	ВидОтображения = ПолучитьВидОтображенияФлэш(СпецификацияСсылка);
	
	Если ЗначениеЗаполнено(СвойстваРаскроя.СтрокаКривогоПилаФРС) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Спецификация", СпецификацияСсылка);
		ПараметрыФормы.Вставить("ХранимыйФайл", "КривойПил");
		ПараметрыФормы.Вставить("СтрокаКривогоПила", СвойстваРаскроя.СтрокаКривогоПилаФРС);
		ПараметрыФормы.Вставить("ВидОтображения", ВидОтображения);
		
		СвойстваРаскроя.РисунокКривогоПилаФРС = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваРаскроя.СтрокаКривогоПилаСтеколка) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Спецификация", СпецификацияСсылка);
		ПараметрыФормы.Вставить("ХранимыйФайл", "КривойПил");
		ПараметрыФормы.Вставить("СтрокаКривогоПила", СвойстваРаскроя.СтрокаКривогоПилаСтеколка);
		ПараметрыФормы.Вставить("ВидОтображения", ВидОтображения);
		
		СвойстваРаскроя.РисунокКривогоПилаСтеколка = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаписатьРисункиКриволинейных(СвойстваРаскроя, СпецификацияСсылка, Отказ)
	
	Если ЗначениеЗаполнено(СвойстваРаскроя.РисунокКривогоПилаФРС) ИЛИ ЗначениеЗаполнено(СвойстваРаскроя.РисунокКривогоПилаСтеколка) Тогда 
	
		НаборЗаписей = ПолучитьНаборЗаписейРегистра(СпецификацияСсылка);
		
		Если НаборЗаписей.Количество() > 0 Тогда
			Запись = НаборЗаписей[0];
		Иначе
			Запись = НаборЗаписей.Добавить();
			Запись.Объект = СпецификацияСсылка;
		КонецЕсли;
		
		Запись.РисунокКривогоПилаФРС = СвойстваРаскроя.РисунокКривогоПилаФРС;
		Запись.РисунокКривогоПилаСтеколка = СвойстваРаскроя.РисунокКривогоПилаСтеколка;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьНаборЗаписейРегистра(СпецификацияСсылка)
	
	НаборЗаписей = РегистрыСведений.РаскройДеталей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(СпецификацияСсылка);
	
	НаборЗаписей.Прочитать();
		
	Возврат НаборЗаписей;
	
КонецФункции

&НаСервере
Функция ОбновитьРаскройНаСервере(Спецификация)
	
	Структура = РегистрыСведений.РаскройДеталей.СформироватьРаскрой(Спецификация, ,Истина);
	
	СтруктураПередачи = Новый Структура;
	СтруктураПередачи.Вставить("СтрокаКривогоПилаФРС", Структура.СтрокаКривогоПилаФРС);
	СтруктураПередачи.Вставить("СтрокаКривогоПилаСтеколка", Структура.СтрокаКривогоПилаСтеколка);
	СтруктураПередачи.Вставить("ТекущаяСтрокаРаскроя", Структура.ДанныеДляРаскроя);
	СтруктураПередачи.Вставить("СтрокаРаскрой", Структура.ДанныеДляРаскроя);
	СтруктураПередачи.Вставить("ТаблицаДеталей", Структура.ТаблицаДеталей);
	СтруктураПередачи.Вставить("ТаблицаДеталей", Структура.ТаблицаДеталей);
	
	Попытка
		СтруктураПередачи.Вставить("ЛучшийПроцентОтхода", Структура.ЛучшийПроцентОтхода);
		СтруктураПередачи.Вставить("ВремяФормирования", Структура.ВремяФормирования);
	Исключение
		
	КонецПопытки;
	
	СтруктураПередачи.Вставить("АлгоритмРаскроя", Структура.АлгоритмРаскроя);
	СтруктураПередачи.Вставить("Спецификация", Спецификация);
	СтруктураПередачи.Вставить("РисунокКривогоПилаФРС", "");
	СтруктураПередачи.Вставить("РисунокКривогоПилаСтеколка", "");
	СтруктураПередачи.Вставить("РисунокРаскроя", "");
	
	Возврат СтруктураПередачи;
	
КонецФункции

