
&НаКлиенте
Процедура АдресРегистрацииНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыАдреса = Новый Структура;
	ПараметрыАдреса.Вставить("Подразделение", Объект.Подразделение);
	
	Если Объект.АдресРегистрации = "Введите адрес" Тогда
		СтарыйАдрес = "";	
	Иначе	
		СтарыйАдрес = Объект.АдресРегистрации;	
	КонецЕсли;
	
	ПараметрыАдреса.Вставить("СтарыйАдрес", СтарыйАдрес);
	
	СтруктураАдреса = ОткрытьФормуМодально("ОбщаяФорма.ФормаВводаАдреса", ПараметрыАдреса, ЭтаФорма);
	
	Если ТипЗнч(СтруктураАдреса) = Тип("Структура") Тогда
		Объект.АдресРегистрации = СтруктураАдреса.Адрес;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПроживанияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыАдреса = Новый Структура;
	ПараметрыАдреса.Вставить("Подразделение", Объект.Подразделение);
	
	Если Объект.АдресПроживания = "Введите адрес" Тогда
		СтарыйАдрес = "";	
	Иначе	
		СтарыйАдрес = Объект.АдресПроживания;	
	КонецЕсли;
	
	ПараметрыАдреса.Вставить("СтарыйАдрес", СтарыйАдрес);
	
	СтруктураАдреса = ОткрытьФормуМодально("ОбщаяФорма.ФормаВводаАдреса", ПараметрыАдреса, ЭтаФорма);
	
	Если ТипЗнч(СтруктураАдреса) = Тип("Структура") Тогда
		Объект.АдресПроживания = СтруктураАдреса.Адрес;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	
	Объект.Фамилия = СокрЛП(Объект.Фамилия);
	Объект.Имя = СокрЛП(Объект.Имя);
	Объект.Отчество = СокрЛП(Объект.Отчество);
	
	Объект.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2 %3", Объект.Фамилия, Объект.Имя, Объект.Отчество);
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольИнкассатора(Команда)
	
	Объект.ПарольИнкассатора = ОткрытьФормуМодально("Справочник.ФизическиеЛица.Форма.ФормаПарольИнкассатора");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// а тут не глючит если форма только для просмотра открывается?
	// допустим прав нет
	
	Если НЕ ЗначениеЗаполнено(Объект.АдресПроживания) Тогда
		Объект.АдресПроживания = "Введите адрес";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.АдресРегистрации) Тогда
		Объект.АдресРегистрации = "Введите адрес";
	КонецЕсли;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура АктивностьПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Функция ОбновитьЭлементыФормы()
	
	Элементы.ГруппаПараметрыРаботы.Доступность = Объект.Активность;
	
КонецФункции


