
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Макет = Обработки.ОтчетПоОперационнойКассе.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТабличнойЧасти = Макет.ПолучитьОбласть("ШапкаТабличнойЧасти");
	ОбластьТелоТабличнойЧасти = Макет.ПолучитьОбласть("ТелоТабличнойЧасти");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
	ТабДок = Новый ТабличныйДокумент;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УправленческийОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
	|	УправленческийОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ОперационнаяКасса),
	|			,
	|			Подразделение = &Подразделение
	|				И Субконто2 = &Сотрудник) КАК УправленческийОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УправленческийОстаткиИОбороты.Регистратор КАК Документ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УправленческийОстаткиИОбороты.СуммаОборот, 0) > 0
	|			ТОГДА ЕСТЬNULL(УправленческийОстаткиИОбороты.СуммаОборот, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(-УправленческийОстаткиИОбороты.СуммаОборотКт, 0) < 0
	|			ТОГДА ЕСТЬNULL(-УправленческийОстаткиИОбороты.СуммаОборотКт, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход,
	|	УправленческийОстаткиИОбороты.Период КАК Период
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ОперационнаяКасса),
	|			,
	|			Подразделение = &Подразделение
	|				И Субконто2 = &Сотрудник) КАК УправленческийОстаткиИОбороты
	|ГДЕ
	|	УправленческийОстаткиИОбороты.Регистратор <> НЕОПРЕДЕЛЕНО
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	МассивЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаОстатки = МассивЗапросов[0].Выбрать();
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбластьШапка.Параметры.ДатаНачала = Период.ДатаНачала;
	ОбластьШапка.Параметры.ДатаОкончания = Период.ДатаОкончания;
	ОбластьШапка.Параметры.Подразделение = Подразделение;
	ОбластьШапка.Параметры.Сотрудник = Сотрудник;
	
	ВыборкаОстатки.Следующий();
	ОбластьШапка.Параметры.НачальныйОстаток = ВыборкаОстатки.НачальныйОстаток;
	ОбластьПодвал.Параметры.КонечныйОстаток = ВыборкаОстатки.КонечныйОстаток;
	
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьШапкаТабличнойЧасти);
	Итого = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОбластьТелоТабличнойЧасти.Параметры.Приход = ВыборкаДетальныеЗаписи.Приход;
		ОбластьТелоТабличнойЧасти.Параметры.Расход = ВыборкаДетальныеЗаписи.Расход;
		ОбластьТелоТабличнойЧасти.Параметры.Документ = ВыборкаДетальныеЗаписи.Документ;
		ТабДок.Вывести(ОбластьТелоТабличнойЧасти);
		
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сотрудник = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	Подразделение = Сотрудник.Подразделение;
	Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	СформироватьНаСервере()
	
КонецПроцедуры
