
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Макет = Обработки.ОтчетПоОперационнойКассе.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТабличнойЧасти = Макет.ПолучитьОбласть("ШапкаТабличнойЧасти");
	ОбластьТелоТабличнойЧасти = Макет.ПолучитьОбласть("ТелоТабличнойЧасти");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
	ТабДок = Новый ТабличныйДокумент;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УправленческийОстаткиИОбороты.Регистратор КАК Документ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УправленческийОстаткиИОбороты.СуммаОборот, 0) > 0
	|			ТОГДА ЕСТЬNULL(УправленческийОстаткиИОбороты.СуммаОборот, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(-УправленческийОстаткиИОбороты.СуммаОборотКт, 0) < 0
	|			ТОГДА ЕСТЬNULL(-УправленческийОстаткиИОбороты.СуммаОборотКт, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход,
	|	УправленческийОстаткиИОбороты.Период КАК Период,
	|	УправленческийОстаткиИОбороты.СуммаНачальныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ОперационнаяКасса),
	|			,
	|			Подразделение = &Подразделение
	|				И Субконто2 = &Сотрудник) КАК УправленческийОстаткиИОбороты
	|ГДЕ
	|	УправленческийОстаткиИОбороты.Регистратор <> НЕОПРЕДЕЛЕНО
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбластьШапка.Параметры.ДатаНачала = Период.ДатаНачала;
	ОбластьШапка.Параметры.ДатаОкончания = Период.ДатаОкончания;
	ОбластьШапка.Параметры.Подразделение = Подразделение;
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьШапкаТабличнойЧасти);
	Итого = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сумма = ?(ВыборкаДетальныеЗаписи.Приход > 0, ВыборкаДетальныеЗаписи.Приход, ВыборкаДетальныеЗаписи.Расход);
		Итого = Итого + Сумма;
		ОбластьТелоТабличнойЧасти.Параметры.Сумма = Сумма;
		ОбластьТелоТабличнойЧасти.Параметры.Документ = ВыборкаДетальныеЗаписи.Документ;
		ОбластьТелоТабличнойЧасти.Параметры.СуммаОстаток = ВыборкаДетальныеЗаписи.СуммаНачальныйОстаток;
		ТабДок.Вывести(ОбластьТелоТабличнойЧасти);
		
	КонецЦикла;
	
	ОбластьПодвал.Параметры.Итого = Итого;
	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Администратор = РольДоступна("Администратор");
	Подразделение = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо.Подразделение;
	Элементы.Сотрудник.Доступность = Администратор;
	Сотрудник = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	
КонецПроцедуры
