
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УправленческийДвиженияССубконто.Период,
		|	УправленческийДвиженияССубконто.Регистратор,
		|	УправленческийДвиженияССубконто.Подразделение,
		|	УправленческийДвиженияССубконто.СубконтоДт1,
		|	УправленческийДвиженияССубконто.Содержание,
		|	УправленческийДвиженияССубконто.Сумма
		|ИЗ
		|	РегистрБухгалтерии.Управленческий.ДвиженияССубконто(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			СубконтоДт2 = &Сотрудник
		|				И СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ОперационнаяКасса),
		|			,
		|			) КАК УправленческийДвиженияССубконто";

	Запрос.УстановитьПараметр("НачалоПериода", СтандартныйПериод.ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода", СтандартныйПериод.ДатаОкончания);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = СписокОпераций.Добавить();
		НоваяСтрока.Дата = ВыборкаДетальныеЗаписи.Период;
		НоваяСтрока.Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
		НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		НоваяСтрока.Комментарий = ВыборкаДетальныеЗаписи.Содержание;
		
	КонецЦикла;
	
КонецПроцедуры
