
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ДобавлениеИзменениеУчебныхЗанятий"));
	
	Если НЕ Отказ И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Структура = РегистрыСведений.ФайлыВБазе.ПолучитьСвойстваФайла(Объект.Ссылка, УникальныйИдентификатор);
		
		АдресКартинки = Структура.АдресВХранилище;
		НомерВерсии = Структура.НомерВерсии;
		Хеш = Структура.Хеш;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	
	ИмяФайла = "";
	ПоместитьФайл(АдресКартинки, , ИмяФайла, , УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РегистрыСведений.ФайлыВБазе.ЗаписатьФайлВРегистр(ТекущийОбъект.Ссылка, АдресКартинки);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКартинку(Команда)
	
	АдресКартинки = Неопределено;
	
КонецПроцедуры
