
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ЗначениеЗаполнено(Объект.МОЛ) Тогда
	
		 ЗаполнитьНаСервере();
		 
	Иначе
		 
		Сообщить("Заполните МОЛ"); 
		 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МОЛ", Объект.МОЛ);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таб.ОсновноеСредство
	|ИЗ
	|	РегистрСведений.СостояниеОсновныхСредств.СрезПоследних(&Период, ) КАК Таб
	|ГДЕ
	|	Таб.МОЛ = &МОЛ
	|	И Таб.ПринятоКУчету";
	
	Объект.ОсновныеСредства.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
