
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ЗначениеЗаполнено(Объект.МОЛ) Тогда
	
		 ЗаполнитьНаСервере();
		 
	Иначе
		 
		Сообщить("Заполните МОЛ"); 
		 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МОЛ", Объект.МОЛ);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(УправленческийОстатки.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	СУММА(ВЫБОР
	|			КОГДА УправленческийОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПервоначальнаяСтоимостьОС)
	|				ТОГДА УправленческийОстатки.СуммаОстатокДт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПервоначальнаяСтоимость,
	|	СУММА(ВЫБОР
	|			КОГДА УправленческийОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.АмортизацияОС)
	|				ТОГДА УправленческийОстатки.СуммаОстатокКт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Амортазиация
	|ПОМЕСТИТЬ втОсновныеСредства
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Остатки(
	|			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), СЕКУНДА, 1),
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПервоначальнаяСтоимостьОС)
	|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.АмортизацияОС),
	|			,
	|			) КАК УправленческийОстатки
	|ГДЕ
	|	УправленческийОстатки.Подразделение = &Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(УправленческийОстатки.Субконто1 КАК Справочник.ОсновныеСредства)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОсновныеСредства.ОсновноеСредство
	|ИЗ
	|	втОсновныеСредства КАК втОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеОсновныхСредств.СрезПоследних(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), ) КАК СостояниеОсновныхСредствСрезПоследних
	|		ПО втОсновныеСредства.ОсновноеСредство = СостояниеОсновныхСредствСрезПоследних.ОсновноеСредство
	|ГДЕ
	|	СостояниеОсновныхСредствСрезПоследних.МОЛ = &МОЛ";
	
	Объект.ОсновныеСредства.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
