
Процедура ДокументПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Источник.Автор) Тогда
		
		Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
			Источник.Автор = ПользователиКлиентСервер.ТекущийВнешнийПользователь();
		Иначе
			Источник.Автор = ПользователиКлиентСервер.ТекущийПользователь();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДокументПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	МетаданныеДокумента = Источник.Метаданные();
	
	ИмяРеквизита = "Автор";
	Если МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
		Источник.Автор = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Процедура предназначена для заполнения общих реквизитов документов,
// вызывается в обработчиках событий "ОбработкаЗаполнения" в модулях документов.
//
// Параметры:
//  ДокументОбъект   - <ДокументОбъект> - документ, реквизиты которого необходимо заполнить
//  ДанныеЗаполнения - <Структура> или <Неопределено> - одноименный параметр обработчика ОбработкаЗаполнения документа
//
Процедура ДокументОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		Пользователь = ПараметрыСеанса.ТекущийВнешнийПользователь;
	Иначе
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	МетаданныеДокумента = Источник.Метаданные();
	
	Выборка = ПланыВидовХарактеристик.НастройкиПользователей.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИмяРеквизита = Выборка.Наименование;
		Если МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) <> Неопределено
			И НЕ ЗначениеЗаполнено(Источник[ИмяРеквизита]) Тогда
			Источник[Выборка.Наименование] = ЛексСервер.ПолучитьЗначениеНастройкиПользователя(Пользователь, Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Источник.Дата = ЛексСервер.ПолучитьВремяНовогоДокумента(Источник);
	
КонецПроцедуры
