Процедура ПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Источник.Автор) Тогда 
		
		Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
			Источник.Автор = ПользователиКлиентСервер.ТекущийВнешнийПользователь();
		Иначе
			Источник.Автор = ПользователиКлиентСервер.ТекущийПользователь();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопированииДокумента(Источник, ОбъектКопирования) Экспорт
	
	Источник.Автор = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияДокументовОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Источник.Дата = ЛексСервер.ПолучитьВремяНовогоДокумента(Источник);
	
КонецПроцедуры
