
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФормулыКаталога.Ссылка
	|ИЗ
	|	Справочник.ФормулыКаталога КАК ФормулыКаталога
	|ГДЕ
	|	ФормулыКаталога.Наименование = &Наименование
	|	И ФормулыКаталога.Ссылка <> &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Наименование формулы уже существует", ,"Объект.Наименование");
		Отказ = Истина;
		
	КонецЕсли;
	
	//Проверка наименования в структуре
	Попытка
		Структура = Новый Структура;
		Структура.Вставить(Наименование, Наименование);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неправильное наименование формулы", ,"Объект.Наименование");
		Отказ = Истина;
	КонецПопытки;
	
	//Если Найти(Формула, "Формула.") > 0 Тогда
	//	
	//	РазвернутьФормулу();
	//	
	//КонецЕсли;	
		      
КонецПроцедуры

//Функция РазвернутьФормулу()
//	
//	Формула = НайтиВсеФормулы();
//	
//	
//	
//КонецФункции

//&НаСервере
//Функция НайтиВсеФормулы() 
//	
//	ВсеФормулы = Новый Структура;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ФормулыКаталога.Наименование,
//	|	ФормулыКаталога.Формула
//	|ИЗ
//	|	Справочник.ФормулыКаталога КАК ФормулыКаталога
//	|ГДЕ
//	|	ФормулыКаталога.Активность
//	|	И НЕ ФормулыКаталога.ПометкаУдаления";
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		
//		ВсеФормулы.Вставить(Выборка.Наименование, Выборка.Формула);
//		
//	КонецЦикла;
//	
//	Возврат ВсеФормулы;
//	
//КонецФункции
