
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФормулыКаталога.Ссылка
	|ИЗ
	|	Справочник.ФормулыКаталога КАК ФормулыКаталога
	|ГДЕ
	|	ФормулыКаталога.Наименование = &Наименование
	|	И ФормулыКаталога.Ссылка <> &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Наименование формулы уже существует", ,"Объект.Наименование");
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Найти(Формула, "Формула.") > 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Использование справочника формул в описании формулы запрещено", ,"Объект.Формула");
		Отказ = Истина;
		
	КонецЕсли;	
		
КонецПроцедуры
