
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Замер") Тогда
		// Заполнение шапки
		Подразделение = ДанныеЗаполнения.Подразделение;
		Замер = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
	ДопДетали = Перечисления.ВидыДеталей.ДопДетали;
	
	Для ч = 0 По Перечисления.ВидыДеталей.Количество() - 1 Цикл
		Деталь = Перечисления.ВидыДеталей.Получить(ч); 
		
		Если Деталь <> ДопДетали Тогда
			
			НоваяСтрока = Номенклатура.Добавить();
			НоваяСтрока.Деталь = Деталь;
			Если Деталь = Перечисления.ВидыДеталей.ДВП Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ДВП;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.СтеклоДляПолки Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.СтеклоДляПолок;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.ЯщикВыдвижной Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ЯщикВыдвижной;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.ФасадАГТ Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ФасадАГТ;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.Джокер Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.Джокер;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.ФасадПолукруглый Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ФасадПолукруглый;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.Фланец Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.Фланец;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.Консоль Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.Консоль;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.Штангодержатель Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.Штангодержатель;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.УслугиДизайнера Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.УслугиДизайнера;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.УслугаГравировка Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.Гравировка;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.ДопРаботы Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ДопРаботы;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.МонтажЗаднейСтенки Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.МонтажЗаднейСтенки;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.МонтажКоробаВертикального Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.МонтажКоробаВертикального;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.МонтажКоробаПотолочного Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.МонтажКоробаПотолочного;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ТЗ = Справочники.Двери.ТекущаяСтоимостьНоменклатуры(Номенклатура, Дата, Подразделение, Ложь);
		Номенклатура.Загрузить(ТЗ);
	КонецЕсли;
	
КонецПроцедуры



