
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокНесовместимости.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.КаталогИзделий");
	Изделие = Параметры.Изделие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Изделие", Изделие);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НесовместимостьИзделийПоКаталогу.НесовместимостимоеИзделие КАК Значение
	|ИЗ
	|	РегистрСведений.НесовместимостьИзделийПоКаталогу КАК НесовместимостьИзделийПоКаталогу
	|ГДЕ
	|	НесовместимостьИзделийПоКаталогу.Изделие = &Изделие";
	
	СписокНесовместимости.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение"));
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьНаСервере(СписокНесовместимости, Изделие);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьНаСервере(Список, Изделие)
	
	НаборИзделий = РегистрыСведений.НесовместимостьИзделийПоКаталогу.СоздатьНаборЗаписей();
	НаборИзделий.Отбор.Изделие.Установить(Изделие);
	НаборИзделий.Очистить();
	
	НаборНесовместимых = РегистрыСведений.НесовместимостьИзделийПоКаталогу.СоздатьНаборЗаписей();
	НаборНесовместимых.Отбор.НесовместимостимоеИзделие.Установить(Изделие);
	НаборНесовместимых.Очистить();
	
	Для Каждого Элемент Из Список Цикл
		
		НоваяСтрока = НаборИзделий.Добавить();
		НоваяСтрока.Изделие = Изделие;
		НоваяСтрока.НесовместимостимоеИзделие = Элемент.Значение;
		
		НоваяСтрока = НаборНесовместимых.Добавить();
		НоваяСтрока.Изделие = Элемент.Значение;
		НоваяСтрока.НесовместимостимоеИзделие = Изделие;
		
	КонецЦикла;
	
	НаборИзделий.Записать();
	НаборНесовместимых.Записать();
	
КонецПроцедуры

