
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПараметровОтбора =  ЭтаФорма.Элементы.СписокНоменклатурыНоменклатура.ПараметрыВыбора;
	
	НовыйМассивПараметров = Новый Массив;
	Для каждого ЭлементОтбора  Из СписокПараметровОтбора Цикл
		    НовыйМассивПараметров.Добавить(ЭлементОтбора);
	КонецЦикла;
	
	ОтборНоменклатурнаяГруппа = Новый ФиксированныйМассив(ПолучитьГруппыТолькоЛистовойМатериал()); 
	НовыйМассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.НоменклатурнаяГруппа",ОтборНоменклатурнаяГруппа));
	
	ЭтаФорма.Элементы.СписокНоменклатурыНоменклатура.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассивПараметров);
	
		
КонецПроцедуры

&НаСервере
Функция ПолучитьГруппыТолькоЛистовойМатериал()

	ПараметрыВыбораНомГруппа = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидМатериала", Перечисления.ВидыМатериалов.Листовой);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатурныеГруппы.Ссылка
		|ИЗ
		|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
		|ГДЕ
		|	НоменклатурныеГруппы.ВидМатериала = &ВидМатериала
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПараметрыВыбораНомГруппа.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат ПараметрыВыбораНомГруппа;

КонецФункции // ПолучитьГруппыЛистовойМатериал()
