
&НаСервере
Процедура  ПриИзмененииРеквизитовВТЧСервер(СтруктураТЧ, СтруктураДействий) Экспорт

	Перем ЗначениеИзСтруктуры;
	
	СоответствиеДействий = Новый Соответствие;
	
	Если СтруктураТЧ.Свойство("СтрокиТЧ", ЗначениеИзСтруктуры) Тогда
		Для Каждого ТекущаяСтрока Из ЗначениеИзСтруктуры Цикл
			ТекСтруктураДействий = СоответствиеДействий[ТекущаяСтрока];
			Если ТекСтруктураДействий <> Неопределено Тогда
				ОбработатьСтрокуТЧСервер(ТекущаяСтрока, ТекСтруктураДействий);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если СтруктураТЧ.Свойство("ТекущаяСтрока", ЗначениеИзСтруктуры) Тогда
		ОбработатьСтрокуТЧСервер(ЗначениеИзСтруктуры, СтруктураДействий);
	КонецЕсли;


КонецПроцедуры

Процедура ОбработатьСтрокуТЧСервер(ТекущаяСтрока, СтруктураДействий) Экспорт

	ЗаполнитьЕдиницуХраненияСервер(ТекущаяСтрока, СтруктураДействий);
	ЗаполнитьКоэффициентСервер(ТекущаяСтрока, СтруктураДействий);
 	ЗаполнитьКоличествоСервер(ТекущаяСтрока, СтруктураДействий);
  	ПересчитатьСуммуСервер(ТекущаяСтрока, СтруктураДействий);
  	ПересчитатьЦенуСервер(ТекущаяСтрока, СтруктураДействий);

КонецПроцедуры

Процедура ЗаполнитьЕдиницуХраненияСервер(ТекущаяСтрока, СтруктураДействий)

	Перем ПараметрДействия;

	Если СтруктураДействий.Свойство("ЗаполнитьЕдиницуХранения", ПараметрДействия) Тогда
    	ТекущаяСтрока.ЕдиницаХранения = Справочники.ЕдиницыХранения.ВернутьЕдиницуХраненияПоУмолчанию(ТекущаяСтрока.Номенклатура);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьКоэффициентСервер(ТекущаяСтрока, СтруктураДействий)

	Перем ПараметрДействия;

	Если СтруктураДействий.Свойство("ЗаполнитьКоэффициент", ПараметрДействия) Тогда
    	ТекущаяСтрока.Коэффициент = ТекущаяСтрока.ЕдиницаХранения.Коэффициент;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьКоличествоСервер(ТекущаяСтрока, СтруктураДействий)

	Перем ПараметрДействия;

	Если СтруктураДействий.Свойство("ЗаполнитьКоличество", ПараметрДействия) Тогда
    	ТекущаяСтрока.Количество = 1;
	КонецЕсли;

КонецПроцедуры

Процедура ПересчитатьСуммуСервер(ТекущаяСтрока, СтруктураДействий)

	Перем ПараметрДействия;

	Если СтруктураДействий.Свойство("ПересчитатьСумму", ПараметрДействия) Тогда
    	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена*ТекущаяСтрока.Количество;
	КонецЕсли;

КонецПроцедуры

Процедура ПересчитатьЦенуСервер(ТекущаяСтрока, СтруктураДействий)

	Перем ПараметрДействия;

	Если СтруктураДействий.Свойство("ПересчитатьЦену", ПараметрДействия) Тогда
		Если ТекущаяСтрока.Количество<>0 Тогда
    		ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма/ТекущаяСтрока.Количество;
		Иначе
    		ТекущаяСтрока.Цена = 0;
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

