
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	ФизЛицо = Пользователь.ФизическоеЛицо;
	ФизЛицоСтрока = ФизЛицо.Фамилия + " " + Лев(ФизЛицо.Имя, 1) + "." + Лев(ФизЛицо.Отчество, 1) + ".";
	
	ПользовательАдминистратор = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Администратор);
	ПользовательКадроваяСлужба = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.КадроваяСлужба);
	
	ДоступностьФормы = ПользовательКадроваяСлужба ИЛИ ПользовательАдминистратор;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ ДоступностьФормы И (Объект.Автор <> Пользователь) И (Объект.Адресат <> Пользователь) Тогда
			
			Элементы.Проблема.ТолькоПросмотр = Истина;
			Элементы.Адресат.ТолькоПросмотр = Истина;
			Элементы.ДатаКонтроля.ТолькоПросмотр = Истина;
			Элементы.ВидСлужебнойЗаписки.ТолькоПросмотр = Истина;	
			Элементы.Виновный.ТолькоПросмотр = Истина;
			Элементы.Тема.ТолькоПросмотр = Истина;
			Элементы.Сумма.ТолькоПросмотр = Истина;
			Элементы.Ознакомлен.ТолькоПросмотр = Истина;
			Элементы.НеСогласен.ТолькоПросмотр = Истина;
			Элементы.Утверждаю.ТолькоПросмотр = Истина;
			
		ИначеЕсли (Объект.Автор = ПараметрыСеанса.ТекущийПользователь) Тогда
			
			Элементы.Ответ.ТолькоПросмотр = Истина;
			Элементы.Ознакомлен.ТолькоПросмотр = Истина;
			Элементы.НеСогласен.ТолькоПросмотр = Истина;
			Элементы.Утверждаю.ТолькоПросмотр = Истина;
			
		ИначеЕсли (Объект.Адресат = ПараметрыСеанса.ТекущийПользователь) Тогда
			
			Элементы.Проблема.ТолькоПросмотр = Истина;	
			Элементы.ДатаКонтроля.ТолькоПросмотр = Истина;
			Элементы.ВидСлужебнойЗаписки.ТолькоПросмотр = Истина;	
			Элементы.Виновный.ТолькоПросмотр = Истина;
			Элементы.Тема.ТолькоПросмотр = Истина;
			Элементы.Утверждаю.ТолькоПросмотр = Истина;
			
			Если Объект.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.Заявка
				ИЛИ Объект.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.Поручение
				ИЛИ Объект.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.ПретензияЗаявление Тогда
				Элементы.Выполнена.ТолькоПросмотр = Ложь;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		
		Элементы.Ответ.ТолькоПросмотр = Истина;
		Элементы.Ознакомлен.ТолькоПросмотр = Истина;
		Элементы.НеСогласен.ТолькоПросмотр = Истина;
		Элементы.Утверждаю.ТолькоПросмотр = Истина;
		
		Если Объект.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.Заявка
			ИЛИ Объект.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.Поручение
			ИЛИ Объект.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.ПретензияЗаявление Тогда
			Элементы.Выполнена.ТолькоПросмотр = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.Дата > '20131212000000' ИЛИ Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Элементы.Ответ.Видимость = Ложь;
		Элементы.Служебное.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Объект.ДатаКонтроля < НачалоДня(ТекущаяДата()) И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Элементы.СтрокаПредупреждение.Видимость = Истина;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХранимыеФайлыВерсий.ВерсияФайла) КАК Количество
	|ИЗ
	|	РегистрСведений.ХранимыеФайлыВерсий КАК ХранимыеФайлыВерсий
	|ГДЕ
	|	ХранимыеФайлыВерсий.ВерсияФайла.Владелец.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	КоличествоФайлов = Выборка.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = НЕ ПроверитьЗаполнение();
	
	Если ЗначениеЗаполнено(ТекстОтвета) ИЛИ Не ЗначениеЗаполнено(Объект.Проблема) Тогда
		
		Текст = "Отправте текст в поле Истории";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.ТекстОтвета");
		Отказ = Истина;	
	КонецЕсли;
	
	Объект.Проблема = СокрЛП(Объект.Проблема);
	Объект.Ответ = СокрЛП(Объект.Ответ);
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Если ЗначениеЗаполнено(ТекстОтвета) Тогда
		
		НашТекстОтвета = Символы.ПС + ФизЛицоСтрока + "[" + Формат(ТекущаяДата(), "ДЛФ=DT") + "]: "+ ТекстОтвета;
		
		Если ЗначениеЗаполнено(Объект.Проблема) Тогда
			Объект.Проблема = Объект.Проблема + Символы.ПС + НашТекстОтвета;
		Иначе
			Объект.Проблема = НашТекстОтвета;
		КонецЕсли;
		
		ТекстОтвета = "";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	МассивЗаписок = Новый Массив;
	МассивЗаписок.Добавить(ТекущийОбъект.Ссылка);
	ЛексСервер.ОбработатьСтатусыМассиваСлужебныхЗаписок(МассивЗаписок);
	
КонецПроцедуры

