
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	ФизЛицо = Пользователь.ФизическоеЛицо;
	ФизЛицоСтрока = ФизЛицо.Фамилия + " " + Лев(ФизЛицо.Имя, 1) + "." + Лев(ФизЛицо.Отчество, 1) + ".";
	
	ПользовательАдминистратор = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Администратор);
	
	ДоступностьФормы = ПользовательАдминистратор;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И НЕ ДоступностьФормы Тогда
		Если (Объект.Автор <> Пользователь) И (Объект.Адресат <> Пользователь) Тогда
			
			Элементы.Проблема.ТолькоПросмотр = Истина;
			Элементы.Адресат.ТолькоПросмотр = Истина;
			Элементы.ДатаКонтроля.ТолькоПросмотр = Истина;
			Элементы.ВидСлужебнойЗаписки.ТолькоПросмотр = Истина;
			Элементы.Тема.ТолькоПросмотр = Истина;
			Элементы.Архив.ТолькоПросмотр = Истина;
			
		ИначеЕсли (Объект.Адресат = ПараметрыСеанса.ТекущийПользователь) Тогда
			
			Элементы.Проблема.ТолькоПросмотр = Истина;	
			Элементы.ДатаКонтроля.ТолькоПросмотр = Истина;
			Элементы.ВидСлужебнойЗаписки.ТолькоПросмотр = Истина;	
			Элементы.Тема.ТолькоПросмотр = Истина;
			Элементы.Архив.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХранимыеФайлыВерсий.ВерсияФайла) КАК Количество
	|ИЗ
	|	РегистрСведений.ХранимыеФайлыВерсий КАК ХранимыеФайлыВерсий
	|ГДЕ
	|	ХранимыеФайлыВерсий.ВерсияФайла.Владелец.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	КоличествоФайлов = Выборка.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = НЕ ПроверитьЗаполнение();
	
	Если ЗначениеЗаполнено(ТекстОтвета) ИЛИ Не ЗначениеЗаполнено(Объект.Проблема) Тогда
		
		Текст = "Отправте текст в поле Истории";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Элементы.ТекстОтвета");
		Отказ = Истина;
		
	КонецЕсли;
	
	Если НЕ Отказ И НЕ Объект.Проведен И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		
		Объект.Проблема = Объект.Проблема + Символы.ПС + Символы.ПС 
		+ ФизЛицоСтрока + "[" + Формат(ТекущаяДата(), "ДЛФ=DT") + "]: Документ помещен в архив";	
		
	ИначеЕсли НЕ Отказ И Объект.Проведен И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Объект.Проблема = Объект.Проблема + Символы.ПС + Символы.ПС 
		+ ФизЛицоСтрока + "[" + Формат(ТекущаяДата(), "ДЛФ=DT") + "]: Документ вернули из архива";
		
	КонецЕсли;
	
	Объект.Проблема = СокрЛП(Объект.Проблема);
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Если ЗначениеЗаполнено(ТекстОтвета) Тогда
		
		#Если НЕ ВебКлиент Тогда
			
			Если НЕ ПроверитьПравописание() Тогда
				
				Возврат;
				
			КонецЕсли;
			
		#КонецЕсли
		
		НашТекстОтвета = Символы.ПС + ФизЛицоСтрока + "[" + Формат(ТекущаяДата(), "ДЛФ=DT") + "]: " + ТекстОтвета;
		
		Если ЗначениеЗаполнено(Объект.Проблема) Тогда
			Объект.Проблема = Объект.Проблема + Символы.ПС + НашТекстОтвета;
		Иначе
			Объект.Проблема = НашТекстОтвета;
		КонецЕсли;
		
		ТекстОтвета = "";
		
		Объект.Ознакомлен = Пользователь = Объект.Адресат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	МассивЗаписок = Новый Массив;
	МассивЗаписок.Добавить(ТекущийОбъект.Ссылка);
	ЛексСервер.ОбработатьСтатусыМассиваСлужебныхЗаписок(МассивЗаписок);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресатПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.Ознакомлен = Ложь;
		
		СтарыйАдресат = ЛексСервер.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Адресат");
		
		Если СтарыйАдресат <> Объект.Адресат Тогда
			
			Объект.Проблема = Объект.Проблема + Символы.ПС + Символы.ПС 
			+ ФизЛицоСтрока + "[" + Формат(ТекущаяДата(), "ДЛФ=DT") + "] Смена адресата: " + СтарыйАдресат + "  >>>  " + Объект.Адресат;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСлужебнойЗапискиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ВидСЗ = ЛексСервер.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ВидСлужебнойЗаписки");
		
		Если ВидСЗ <> Объект.ВидСлужебнойЗаписки Тогда
			
			Объект.Проблема = Объект.Проблема + Символы.ПС + Символы.ПС 
			+ ФизЛицоСтрока + "[" + Формат(ТекущаяДата(), "ДЛФ=DT") + "] Смена вида СЗ: " + ВидСЗ + "  >>>  " + Объект.ВидСлужебнойЗаписки;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПравописание()
	
	Массив = ВыполнитьпроверкуПравописания(ТекстОтвета);
	
	ТекстЗамены = "Обнаружены орфографические ошибки:" + Символы.ПС;
	
	Для Каждого Элем Из Массив Цикл
		
		Попытка
			// На случай если не будет замены
			ТекстЗамены = ТекстЗамены + Элем.Слово + " - "+ Элем.Замена[0] + Символы.ПС;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	ТекстЗамены = ТекстЗамены + Символы.ПС + "Произвести замену?";
	
	Если Массив.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНетОтмена;
		Ответ = Вопрос(ТекстЗамены, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			Для каждого Элем Из Массив Цикл
				
				Попытка
					ТекстОтвета = СтрЗаменить(ТекстОтвета, Элем.Слово, Элем.Замена[0]);
				Исключение
				КонецПопытки;
				
			КонецЦикла;
			
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьпроверкуПравописания(Текст)
	
	#Если НЕ ВебКлиент Тогда
		
		СтрокаПроверки = Текст;
		
		Соединение = Новый HTTPСоединение("speller.yandex.net/services/spellservice/checkText?text="+СтрЗаменить(СтрокаПроверки,"","+"));
		Массив = Новый Массив;
		Файл = ПолучитьИмяВременногоФайла(".xml"); // не работает в ВебКлиенте
		Соединение.Получить("", Файл);
		Чтение = Новый ЧтениеXML;
		Чтение.ОткрытьФайл(Файл);
		
		Пока Чтение.Прочитать() Цикл
			Структура = Новый Структура;
			Если Чтение.Имя = "word" Тогда
				Чтение.Прочитать();
				Структура.Вставить("Слово", Чтение.Значение);
				Чтение.Прочитать();
				Чтение.Прочитать();
			КонецЕсли;
			МассивОб = Новый Массив;
			Пока Чтение.Имя = "s" Цикл
				Чтение.Прочитать();
				МассивОб.Добавить(Чтение.Значение);
				Чтение.Прочитать();
				Чтение.Прочитать();
			КонецЦикла;
			Если НЕ МассивОб.Количество() = 0 Тогда
				Структура.Вставить("Замена", МассивОб);
				Массив.Добавить(Структура);
			КонецЕсли;
		КонецЦикла;	
		
		Возврат Массив;
		
	#КонецЕсли
	
КонецФункции