
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПечатьАктНаСписание(ТабДок, Ссылка) Экспорт
	
	ФормСтрока = "Л=ru_RU";
	ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0";
	
	Для Каждого Док Из Ссылка Цикл
	
	Макет = Документы.СписаниеМатериалов.ПолучитьМакет("ПечатьАктСписание");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеМатериалов.Автор,
	|	СписаниеМатериалов.Дата,
	|	СписаниеМатериалов.Номер,
	|	СписаниеМатериалов.Подразделение,
	|	СписаниеМатериалов.Склад,
	|	СписаниеМатериалов.СуммаДокумента,
	|	СписаниеМатериалов.СписокНоменклатуры.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество,
	|		Описание
	|	),
	|	СписаниеМатериалов.Склад.МОЛ КАК СкладМОЛ
	|ИЗ
	|	Документ.СписаниеМатериалов КАК СписаниеМатериалов
	|ГДЕ
	|	СписаниеМатериалов.Ссылка В(&Ссылка)
	|	И СписаниеМатериалов.Проведен";
	
	Запрос.Параметры.Вставить("Ссылка", Док);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблица = Макет.ПолучитьОбласть("ШапкаТаблица");
	ОбластьСтрокаТаблица = Макет.ПолучитьОбласть("СтрокаТаблица");
	Подписи = Макет.ПолучитьОбласть("Подписи");
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	Пока Выборка.Следующий() Цикл
		
		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.Склад = Док.Склад;
		Шапка.Параметры.Дата = Формат(Док.Дата, "ДФ=dd.MM.yyyy");
		Шапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Док.Номер);
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьШапкаТаблица);
		ВыборкаСписокНоменклатуры = Выборка.СписокНоменклатуры.Выбрать();
		Пока ВыборкаСписокНоменклатуры.Следующий() Цикл
			ОбластьСтрокаТаблица.Параметры.Заполнить(ВыборкаСписокНоменклатуры);
			ТабДок.Вывести(ОбластьСтрокаТаблица, ВыборкаСписокНоменклатуры.Уровень());
		КонецЦикла;
		
		Подписи.Параметры.Заполнить(Выборка);
		Подписи.Параметры.Сумма = Строка(Выборка.СуммаДокумента) + "  ( " + ЧислоПрописью(Выборка.СуммаДокумента, ФормСтрока, ПарПредмета)+" )";
		Подписи.Параметры.ФизЛицоДиректор = ФизическиеЛица.ФамилияИнициалыФизЛица(Док.Подразделение.Руководитель);
		Подписи.Параметры.ФизЛицоУправляющий = ФизическиеЛица.ФамилияИнициалыФизЛица(Док.Подразделение.Управляющий);
		ТабДок.Вывести(Подписи);
		
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры