
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДоговорДилера") Тогда
		
		ДоговорДопСоглашение = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДополнительноеСоглашениеДилера") Тогда
		
		ДоговорДопСоглашение = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		
	КонецЕсли;
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = Автор.ОбъектАвторизации.Префикс;
	
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксКонтрагента(Ссылка, Префикс);
	
КонецПроцедуры
