
&НаКлиенте
Процедура Отправить(Команда)
	
	Если ЗначениеЗаполнено(ТекстПользователя) Тогда
		
		НашТекстОтвета = Формат(ТекущаяДата(), "ДЛФ=DT") + "  (" + ДолжностьФизЛица + ") " + ФизЛицоСтрока + ": "+ ТекстПользователя;
		Объект.Информация = Объект.Информация + Символы.ПС + НашТекстОтвета;
		ТекстПользователя = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = Пользователь;
	КонецЕсли;
	
	ФизЛицо = Пользователь.ФизическоеЛицо;
	ФизЛицоСтрока = ФизЛицо.Фамилия + " " + Лев(ФизЛицо.Имя, 1) + "." + Лев(ФизЛицо.Отчество, 1) + ".";
	ДолжностьФизЛица = ФизЛицо.Должность;
	
КонецПроцедуры
