
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Вставить содержимое обработчика.
	ПараметрыФормы = ПолучитьПараметрыТеста();
	ОткрытьФорму("Документ.ТестированиеПользователей.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыТеста()

	Возврат Новый Структура("ПравоваяБаза, КоличествоВопросов", Константы.ТестТема.Получить(), Константы.ТестКоличествоВопросов.Получить());
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПравоваяБаза.Ссылка
	//	|ИЗ
	//	|	Справочник.ПравоваяБаза КАК ПравоваяБаза";

	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	//ГСЧ = Новый ГенераторСлучайныхЧисел;
	//Возврат РезультатЗапроса[ГСЧ.СлучайноеЧисло( 0,РезультатЗапроса.Количество()-1 )].Ссылка;

КонецФункции // ПолучитьПараметрыТеста()
