
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПравоваяБаза = ПолучитьТемуТеста();
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("ПравоваяБаза", ПравоваяБаза);
	ОткрытьФорму("Документ.ТестированиеПользователей.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция ПолучитьТемуТеста()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравоваяБаза.Ссылка
		|ИЗ
		|	Справочник.ПравоваяБаза КАК ПравоваяБаза";

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	ГСЧ = Новый ГенераторСлучайныхЧисел;
	Возврат РезультатЗапроса[ГСЧ.СлучайноеЧисло( 0,РезультатЗапроса.Количество()-1 )].Ссылка;

КонецФункции // ПолучитьТемуТеста()
