
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	ПараметрыСтр = ПолучитьРасшифровкуНаСервере(Расшифровка);
	
	Если ЗначениеЗаполнено(ПараметрыСтр.Номенклатура) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ФормаОтчета = ПолучитьФорму("Отчет.ДинамикаЦенНоменклатуры.Форма");
    
	    КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
	    Настройки = КомпоновщикНастроек.Настройки;
		
		ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Подразделение"));
	    ЭлементНастройки.Значение = ПараметрыСтр.Подразделение;
		
		Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
	        ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки);
	        Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	            ПользовательскийПараметр.Значение = ЭлементНастройки.Значение;
	        КонецЕсли;
		КонецЕсли;
		
		ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Номенклатура"));
	    ЭлементНастройки.Значение = ПараметрыСтр.Номенклатура;
		
		Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
	        ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки);
	        Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	            ПользовательскийПараметр.Значение = ЭлементНастройки.Значение;
	        КонецЕсли;
	    КонецЕсли;

	    ФормаОтчета.Открыть();
	    ФормаОтчета.СкомпоноватьРезультат();
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасшифровкуНаСервере(фнРасшифровка)
	
	ПараметрыСтр = Новый Структура();
	ПараметрыСтр.Вставить("Номенклатура", "");
	ПараметрыСтр.Вставить("Подразделение", "");
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ЭлементыРасшифровки = Данные.Элементы.Получить(фнРасшифровка);
	Поля = ЭлементыРасшифровки.ПолучитьПоля();
	
	Если Поля.Количество() = 1 Тогда
		Поле = Поля[0].Поле;
	КонецЕсли;
	
	Если Поле = "Номенклатура"
	 ИЛИ Поле = "ПлановаяЗакупочная"
	 ИЛИ Поле = "Розничная" Тогда
		
		МассивРодители = ЭлементыРасшифровки.ПолучитьРодителей();
		Если МассивРодители.Количество() = 1 Тогда
			ПолеРодителя = Данные.Элементы.Получить(МассивРодители[0].Идентификатор).ПолучитьПоля();
			ПараметрыСтр.Номенклатура = ПолеРодителя[0].Значение;
		КонецЕсли;
		
		НастройкаПодразделение = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0];
		
		Если НастройкаПодразделение <> Неопределено Тогда
			ПараметрыСтр.Подразделение = НастройкаПодразделение.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПараметрыСтр;
	
КонецФункции
