
//Процедура ОбработкаПроведения(Отказ, Режим)
//	
//	Движения.ЗаработнаяПлата.Записывать = Истина;
//	Движения.ОборотыПоСтатьям.Записывать = Истина;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	НачислениеЗаработнойПлатыДизайнерамСписокДизайнеров.Дизайнер,
//	|	НачислениеЗаработнойПлатыДизайнерамСписокДизайнеров.Сумма КАК Сумма,
//	|	НачислениеЗаработнойПлатыДизайнерамСписокДизайнеров.Комментарий
//	|ИЗ
//	|	Документ.НачислениеЗаработнойПлатыДизайнерам.СписокДизайнеров КАК НачислениеЗаработнойПлатыДизайнерамСписокДизайнеров
//	|ГДЕ
//	|	НачислениеЗаработнойПлатыДизайнерамСписокДизайнеров.Ссылка = &Ссылка
//	|ИТОГИ
//	|	СУММА(Сумма)
//	|ПО
//	|	ОБЩИЕ";
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	
//	ВыборкаИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	ВыборкаИтог.Следующий();
//	Движение = Движения.ОборотыПоСтатьям.Добавить();
//	Движение.Период = Дата;
//	Движение.Подразделение = Подразделение;
//	Движение.Статья = Справочники.Статьи.ЗаработнаяПлатаОбщая;
//	Движение.Факт = ВыборкаИтог.Сумма;
//	
//	Выборка = ВыборкаИтог.Выбрать();
//	
//	// регистр ЗаработнаяПлата Приход
//	Пока Выборка.Следующий() Цикл
//		Движение = Движения.ЗаработнаяПлата.Добавить();
//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//		Движение.Период = Дата;
//		Движение.Подразделение = Подразделение;
//		Движение.Сотрудник = Выборка.Дизайнер;
//		Движение.Должность = Справочники.Должности.Дизайнер;
//		Движение.Сумма = Выборка.Сумма;
//		Движение.Комментарий = Выборка.Комментарий;
//	КонецЦикла;
//	
//КонецПроцедуры

//Процедура ПриЗаписи(Отказ)
//	
//	СуммаДокумента = 	СписокДизайнеров.Итог("Сумма");

//КонецПроцедуры
