
&НаКлиенте
Процедура Добавить(Команда)
	
	ИмяФайла = "";
	Если ПоместитьФайл(АдресВХранилище, , ИмяФайла, , УникальныйИдентификатор) Тогда
		Файл = Новый Файл(ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьФайлВРегистр(ТекущийОбъект.Ссылка, АдресВХранилище, НомерВерсии);

КонецПроцедуры

&НаСервере
Функция ЗаписатьФайлВРегистр(Объект, АдресВХранилище, НомерВерсии)
	
	НаборЗаписей = РегистрыСведений.ФайлыВБазе.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.НомерВерсии.Установить(НомерВерсии);
	
	Запись = НаборЗаписей.Добавить();
	Запись.Объект = Объект;
	Запись.НомерВерсии = НомерВерсии;
	
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
		Запись.Файл = Новый ХранилищеЗначения(ДвоичныеДанные);
	Иначе
		Запись.Файл = Неопределено;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Структура = ПолучитьАдресНомерФайла(Объект.Ссылка, УникальныйИдентификатор);
		АдресВХранилище = Структура.АдресВХранилище;
		НомерВерсии = Структура.НомерВерсии;
	Иначе
		НомерВерсии = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресНомерФайла(Объект, ИдентификаторФормы)
	
	Структура = Новый Структура;
	Структура.Вставить("НомерВерсии", Неопределено);
	Структура.Вставить("АдресВХранилище", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФайлыВБазе.Объект,
	|	ФайлыВБазе.НомерВерсии КАК НомерВерсии,
	|	ФайлыВБазе.Файл
	|ИЗ
	|	РегистрСведений.ФайлыВБазе КАК ФайлыВБазе
	|ГДЕ
	|	ФайлыВБазе.Объект = &Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерВерсии УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	Структура.Вставить("НомерВерсии", Выборка.НомерВерсии);
	Структура.Вставить("АдресВХранилище", ПоместитьВоВременноеХранилище(Выборка.Файл.Получить(), ИдентификаторФормы));
	Выборка.Сбросить();
	
	Возврат Структура;
	
КонецФункции