
&НаКлиенте
Процедура Добавить(Команда)
	
	ИмяФайла = "";
	Если ПоместитьФайл(АдресВХранилище, , ИмяФайла, , УникальныйИдентификатор) Тогда
		Файл = Новый Файл(ИмяФайла);
		Объект.ИмяФайла = Файл.Имя;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьФайлВРегистр(ТекущийОбъект.Ссылка, АдресВХранилище, НомерВерсии);
	Если Ознакомлен Тогда
		Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
		ЗаписатьФлагОзнакомления(ТекущийОбъект.Ссылка, НомерВерсии, Пользователь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаписатьФайлВРегистр(Объект, АдресВХранилище, НомерВерсии)
	
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
		
		ОбъектХеш = Новый ХешированиеДанных(ХешФункция.CRC32);
		ОбъектХеш.Добавить(ДвоичныеДанные);
		ХешНовый = ОбъектХеш.ХешСумма;
		
		Если ХешНовый <> Хеш Тогда
			НомерВерсии = НомерВерсии  + 1;
			НаборЗаписей = РегистрыСведений.ФайлыВБазе.СоздатьНаборЗаписей();
			Запись = НаборЗаписей.Добавить();
			Запись.Объект = Объект;
			Запись.НомерВерсии = НомерВерсии;
			Запись.Файл = Новый ХранилищеЗначения(ДвоичныеДанные);
			НаборЗаписей.Записать(Ложь);
		КонецЕсли;	
	КонецЕсли;	
КонецФункции

&НаСервере
Функция ЗаписатьФлагОзнакомления(Объект, НомерВерсии, Пользователь)
	
	НаборЗаписей = РегистрыСведений.ОзнакомлениеСПравовойБазой.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.НомерВерсии.Объект.Установить(НомерВерсии);
	НаборЗаписей.Сотрудник.Объект.Установить(Пользователь);
		
	Запись = НаборЗаписей.Добавить();
	Запись.Объект = Объект;
	Запись.НомерВерсии = НомерВерсии;
	Запись.Сотрудник = Пользователь;                                   
	Запись.Ознакомлен = Истина;
	НаборЗаписей.Записать();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	ПользовательАдминистратор = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Администратор);
	ДолжностьПользователя = Пользователь.ФизическоеЛицо.ОсновнаяДолжность;
	ДоступностьДолжности = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Структура = ПолучитьАдресНомерФайла(Объект.Ссылка, УникальныйИдентификатор);
		АдресВХранилище = Структура.АдресВХранилище;
		НомерВерсии = Структура.НомерВерсии;
		Хеш = Структура.Хеш;
		
		МассивДолжности = Объект.Должности.НайтиСтроки(Новый Структура("Должность", ДолжностьПользователя));
		Если МассивДолжности.Количество() = 1 Тогда		
			
			ДоступностьДолжности = МассивДолжности[0].Доступность;
			
			Если ДоступностьДолжности Тогда
				
				
				
			КонецЕсли;
		КонецЕсли;
		
		ЭтаФорма.ТолькоПросмотр = НЕ (ДоступностьДолжности ИЛИ ПользовательАдминистратор);
		
	Иначе
		
		ОбновитьНасервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресНомерФайла(Объект, ИдентификаторФормы)
	
	Структура = Новый Структура;
	Структура.Вставить("НомерВерсии", Неопределено);
	Структура.Вставить("АдресВХранилище", Неопределено);
	Структура.Вставить("Хеш", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ФайлыВБазе.Объект,
	|	ФайлыВБазе.НомерВерсии КАК НомерВерсии,
	|	ФайлыВБазе.Файл
	|ИЗ
	|	РегистрСведений.ФайлыВБазе КАК ФайлыВБазе
	|ГДЕ
	|	ФайлыВБазе.Объект = &Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерВерсии УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	Структура.Вставить("НомерВерсии", Выборка.НомерВерсии);
	Данные = Выборка.Файл.Получить();
	Если Данные <> Неопределено Тогда
		Структура.Вставить("АдресВХранилище", ПоместитьВоВременноеХранилище(Данные, ИдентификаторФормы));	
		
		ОбъектХеш = Новый ХешированиеДанных(ХешФункция.CRC32);
		ОбъектХеш.Добавить(Данные);
		Структура.Вставить("Хеш", ОбъектХеш.ХешСумма);
	КонецЕсли;
	
	Выборка.Сбросить();
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ИмяФайлаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
			ПолучитьФайл(АдресВХранилище, Объект.ИмяФайла);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНасервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНасервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НашиДолжности", Объект.Должности.Выгрузить());	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НашиДолжности.Должность,
	|	НашиДолжности.Доступность
	|ПОМЕСТИТЬ НашиДолжности
	|ИЗ
	|	&НашиДолжности КАК НашиДолжности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Должности.Ссылка КАК Должность,
	|	НашиДолжности.Доступность
	|ИЗ
	|	Справочник.Должности КАК Должности
	|		ЛЕВОЕ СОЕДИНЕНИЕ НашиДолжности КАК НашиДолжности
	|		ПО Должности.Ссылка = НашиДолжности.Должность
	|
	|УПОРЯДОЧИТЬ ПО
	|	Должности.Наименование";
	
	Объект.Должности.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
