
&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Подразделение", Подразделение);
	ПараметрыОтчета.Вставить("СтаршийДизайнер", СтаршийДизайнер);
	
	Если ЗначениеЗаполнено(СтаршийДизайнер) Тогда 	
		ТабДок = Отчеты.ОтчетСтаршегоДизайнера.СформироватьОтчет(ПараметрыОтчета);
	Иначе
		ТабДок = Отчеты.ОтчетСтаршегоДизайнера.СформироватьОтчетОбщий(ПараметрыОтчета);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	СвойствоПодразделение = ПланыВидовХарактеристик.НастройкиПользователей.Подразделение;
	Отбор = Новый Структура("Пользователь, Настройка", Пользователь , СвойствоПодразделение);
	Подразделение = РегистрыСведений.НастройкиПользователей.Получить(Отбор).Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		Если Расшифровка.Свойство("Заметка") Тогда
			Если Расшифровка.Заметка Тогда
				СтандартнаяОбработка = Ложь;
				НашаЗаметка = НайтиЗаметку(Расшифровка.Предмет);
				ОткрытьЗначение(НашаЗаметка);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция НайтиЗаметку(Предмет) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Предмет", Предмет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заметки.Ссылка
	|ИЗ
	|	Справочник.Заметки КАК Заметки
	|ГДЕ
	|	Заметки.Предмет = &Предмет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат Выборка[0].Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции