
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	РезультатОбработкаРасшифровкиНаСервере();
	ПолучитьРасшифровкуНаСервере(Расшифровка);
	
КонецПроцедуры

&НаСервере
Процедура РезультатОбработкаРасшифровкиНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция ПолучитьРасшифровкуНаСервере(Расшифровка, ЭтоГруппа = Ложь)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки); 
	
	Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();
	
	ПолеНоменклатура = Поля.Найти("Номенклатура");
	
	Если ПолеНоменклатура = Неопределено Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ЭтоГруппа = ПолеНоменклатура.Значение.ЭтоГруппа;
		
		Возврат ПолеНоменклатура.Значение;
		
	КонецЕсли;
	
КонецФункции