
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	ПолучитьРасшифровкуНаСервере(Расшифровка);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасшифровкуНаСервере(Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	КоллекцияЭлементовРасшифровки = Данные.Элементы.Получить(Расшифровка);
	Поля = КоллекцияЭлементовРасшифровки.ПолучитьПоля();
	
	Если Поля.Количество() > 0 Тогда
		ВыбранноеЗначение = Поля[0].Значение;
	Иначе
		ВыбранноеЗначение = Неопределено;
	КонецЕсли;
	
КонецФункции