
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	//Перем ВыполненноеДействие;
	//
	//СтандартнаяОбработка = Ложь;
	//ОбработкаРасшифровки=Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет));
	//
	//Настройки = ОбработкаРасшифровки.Выполнить(Расшифровка, ВыполненноеДействие);
	//
	//Если Настройки <> Неопределено Тогда
	//	
	//	МассивРодителей = ДанныеРасшифровки.Элементы.Получить(Расшифровка).ПолучитьРодителей();
	//	//потом можно получать значение по идентификаторам родителей
	//	//ПолеСКД =ДанныеРасшифровки.Элементы.Получить(<Идентификатор из Массива Родителей>).Получитьполя()[0].Поле;
	//	
	//	
	//КонецЕсли;
	
	
	
	//Перем ВыбранноеДействие, ПараметрыДействия;
	//
	//СтандартнаяОбработка = Ложь;
	//
	//// описание доступных действий
	//ДоступныеВарианты = Новый Массив;
	//ДоступныеВарианты.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать);
	//ДоступныеВарианты.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	//
	///////////////////////////////////////////////////
	//// описание дополнительных возможных действий (создание дополнительного меню)
	//// вынесем в отдельную функцию
	//ДополнительныеВарианты = Новый СписокЗначений;
	//ДополнительныеВарианты.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать);
	//ДополнительныеВарианты.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	//
	//ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет));
	//
	//ОбработкаРасшифровки.ВыбратьДействие(Расшифровка, ВыбранноеДействие, ПараметрыДействия, ДоступныеВарианты, ДополнительныеВарианты);
	//
	////Если ОбщегоНазначенияСервер.ПроверитьТип(ВыбранноеДействие, "ПеречислениеСсылка.СостоянияЗадач") Тогда
	////	// значит меняют состояние
	////	ЗаписатьСостояние(ВыбранноеДействие, Расшифровка);
	////	
	////ИначеЕсли ОбщегоНазначенияСервер.ПроверитьТип(ВыбранноеДействие, "Булево") Тогда 
	////	// меняем актуальность
	////	ЗаписатьАктуальность(ВыбранноеДействие, Расшифровка);
	////Иначе
	////	
	////	// что-то другое
	////	Если ВыбранноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
	////		// тут будем открывать обработку изменения свойств задачи
	////		ОбработкаЗадачКлиент.ОткрытьОбработкуЗадач(ПараметрыДействия);
	////	КонецЕсли; 
	////КонецЕсли;
	//
	ПолучитьРасшифровкуНаСервере(Расшифровка);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасшифровкуНаСервере(Расшифровка)
	
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	КоллекцияЭлементовРасшифровки = Данные.Элементы.Получить(Расшифровка);
	Поля = КоллекцияЭлементовРасшифровки.ПолучитьРодителей();
	
	Если Поля.Количество() > 0 Тогда
		ВыбранноеЗначение = Поля[0].Значение;
	Иначе
		ВыбранноеЗначение = Неопределено;
	КонецЕсли;
	
КонецФункции


