
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТабДокРасшифровка = ПолучитьРасшифровкуНаСервере(Расшифровка);
	
	Если ТипЗнч(ТабДокРасшифровка) = Тип("ТабличныйДокумент") Тогда
		ТабДокРасшифровка.Показать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасшифровкуНаСервере(Расшифровка)
	
	Перем Поле, Группировка;
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ЭлементыРасшифровки = Данные.Элементы.Получить(Расшифровка);
	Поля = ЭлементыРасшифровки.ПолучитьПоля();
	
	Если Поля.Количество() = 1 Тогда
		Поле = Поля[0].Поле;
	КонецЕсли;
	
	МассивРодители = ЭлементыРасшифровки.ПолучитьРодителей();
	Если МассивРодители.Количество() = 1 Тогда
		ПолеРодителя = Данные.Элементы.Получить(МассивРодители[0].Идентификатор).ПолучитьПоля();
		Группировка = ПолеРодителя[0].Значение;
	КонецЕсли;
	
	
	НастройкаПериод = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти("f23da4aa-970e-4c32-a6ee-f21da89b9ed2");
	Если ЗначениеЗаполнено(НастройкаПериод) Тогда
		Период = НастройкаПериод.Значение;
	Иначе
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Поле) И ЗначениеЗаполнено(Группировка) Тогда
		Ответ = СформироватьРасшифровку(Поле, Группировка, Период);
	Иначе
		Ответ = Неопределено;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция СформироватьРасшифровку(ИмяПоля, Номенклатура, Период)
	
	ТабДок = Новый ТабличныйДокумент;
	
	
	Возврат Неопределено;
	
КонецФункции
