
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьВыпускПродукции") Тогда
		ПодготовитьПечатнуюФорму("ПечатьВыпускПродукции", "Печать выпуск продукции", "Документ.ВыпускПродукции.ПечатьВыпускПродукции",
		МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	
	Если НужноПечататьМакет Тогда
		
		Если ИмяМакета = "ПечатьВыпускПродукции" Тогда
			
			ТабДок = ПечатьВыпускПродукции(МассивОбъектов, ОбъектыПечати);
			
		КонецЕсли;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьВыпускПродукции(МассивДокументов, ОбъектыПечати) Экспорт
	
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	
	Макет = Документы.ВыпускПродукции.ПолучитьМакет("ПечатьВыпускПродукции");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокНоменклатурыШапка = Макет.ПолучитьОбласть("СписокНоменклатурыШапка");
	ОбластьСписокНоменклатуры = Макет.ПолучитьОбласть("СписокНоменклатуры");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал"); 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ПечатьВыпускПродукции";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("МассивДокументов", МассивДокументов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Список.Ссылка КАК Ссылка,
	|	Список.Спецификация КАК Спец
	|ИЗ
	|	Документ.ВыпускПродукции.СписокСпецификаций КАК Список
	|ГДЕ
	|	Список.Ссылка В(&МассивДокументов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Первый = Истина;
	СуммаДокумента = 0;
	НомерСтроки = 1;
	
	Пока Выборка.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		Если ВставлятьРазделительСтраниц Тогда
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		Если Первый Тогда
			
			Первый = Ложь;
			
			СуммаДокумента = Выборка.Ссылка.СуммаДокумента;
			
			ОбластьЗаголовок.Параметры.Номер = Выборка.Ссылка.Номер;
			ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Ссылка.Дата, "ДЛФ=DD");
			ТабДок.Вывести(ОбластьЗаголовок);
			
			ОбластьШапка.Параметры.Подразделение = Выборка.Ссылка.Подразделение;
			ОбластьШапка.Параметры.Автор = Выборка.Ссылка.Автор;
			ТабДок.Вывести(ОбластьШапка);
		
			ТабДок.Вывести(ОбластьСписокНоменклатурыШапка);
			
		КонецЕсли;
		
		ОбластьСписокНоменклатуры.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСписокНоменклатуры.Параметры.Спецификация = Выборка.Спец;
		ОбластьСписокНоменклатуры.Параметры.Сумма = Выборка.Спец.СуммаНарядаСпецификации;
		ТабДок.Вывести(ОбластьСписокНоменклатуры);
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	ОбластьПодвал.Параметры.СуммаДокумента = СуммаДокумента;
	ОбластьПодвал.Параметры.СуммаДокументаПрописью = ЧислоПрописью(СуммаДокумента, ФормСтрока, ПарПредмета);
	ТабДок.Вывести(ОбластьПодвал); 
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, МассивДокументов);

	
	Возврат ТабДок;
	
КонецФункции
