
&НаКлиенте
Процедура Изменить(Команда)
	
	Если ЗначениеЗаполнено(НоваяДатаОтгрузки) И НоваяДатаОтгрузки > ДатаИзготовления Тогда		
		УстановитьДатуОтгрузки(Спецификация, НоваяДатаОтгрузки);
		ЭтаФорма.Закрыть();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не корректная дата отгрузки.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Спецификация = Параметры.Спецификация;
	ТекущаяДатаОтгрузки = Спецификация.ДатаОтгрузки;
	ДатаИзготовления = Спецификация.ДатаИзготовления;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуОтгрузки(Спецификация, ДатаОтгрузки)
	
	СпецОб = Спецификация.ПолучитьОбъект();
	СпецОб.ДатаОтгрузки = ДатаОтгрузки;
	
	Если СпецОб.Проведен Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	Иначе
		РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	
	СпецОб.Записать(РежимЗаписи);
	
КонецПроцедуры
