
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) ИЛИ ТипЗнч(ПараметрКоманды) <> Тип("ДокументСсылка.Спецификация") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьПеределку(ПараметрКоманды) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменить список виновных можно только в спецификации с изделием ""Переделка""");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Спецификация", ПараметрКоманды);
	ОткрытьФорму("Документ.Спецификация.Форма.ФормаИзмененияВиновных", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПеределку(Спец)
	Возврат Спец.Изделие.ЭтоПеределка;	
КонецФункции


