
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Комплектация") Тогда
		
		ПодготовитьПечатнуюФорму("Комплектация",
		"Комплектация",
		"Документ.Спецификация.Спецификация",
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода);
				
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	Если ИмяМакета = "Комплектация" Тогда
		
		ТабДок = ПечатьКомплектации(МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
	ПФорма = КоллекцияПечатныхФорм.Найти(ИмяМакета, "ИмяМакета");
	Если ЗначениеЗаполнено(ПФорма) И ТабДок.КоличествоЭкземпляров > 1 Тогда
		ПФорма.Экземпляров = ТабДок.КоличествоЭкземпляров;
	КонецЕсли;
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, ПредставлениеМакета, ТабДок, , ПолныйПутьКМакету);
	
КонецПроцедуры

Функция ПечатьКомплектации(МассивДокументов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_РасходныйКассовыйОрдер";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.КоличествоЭкземпляров = 2;
	ТабДок.Защита = Истина;
	Макет = Документы.Комплектация.ПолучитьМакет("ПечатьКомплектации");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("Подразделение", МассивДокументов[0].Подразделение);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(Остатки.Субконто2 КАК Справочник.Номенклатура).Базовый
	|			ТОГДА Остатки.Субконто2
	|		ИНАЧЕ ВЫРАЗИТЬ(Остатки.Субконто2 КАК Справочник.Номенклатура).БазоваяНоменклатура
	|	КОНЕЦ КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(Остатки.Субконто2 КАК Справочник.Номенклатура).Базовый
	|				ТОГДА Остатки.КоличествоОстаток
	|			ИНАЧЕ ВЫРАЗИТЬ(Остатки.Субконто2 КАК Справочник.Номенклатура).КоэффициентБазовых * Остатки.КоличествоОстаток
	|		КОНЕЦ) КАК Количество
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Остатки(
	|			,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.МатериалыНаСкладе),
	|			,
	|			Субконто1.ОсновнойСклад = ИСТИНА
	|				И Подразделение = &Подразделение) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(Остатки.Субконто2 КАК Справочник.Номенклатура).Базовый
	|			ТОГДА Остатки.Субконто2
	|		ИНАЧЕ ВЫРАЗИТЬ(Остатки.Субконто2 КАК Справочник.Номенклатура).БазоваяНоменклатура
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Комплектация.Ссылка КАК Ссылка,
	|	Комплектация.Ссылка.Дата КАК Дата,
	|	Комплектация.Ссылка.Номер КАК Номер,
	|	Комплектация.Ссылка.Спецификация КАК Спецификация,
	|	Комплектация.НомерСтроки КАК НомерСтроки,
	|	Комплектация.КоличествоСклад КАК КоличествоСклад,
	|	Комплектация.ЗатребованоСклад КАК ЗатребованоСклад,
	|	Комплектация.КоличествоЦех КАК КоличествоЦех,
	|	Комплектация.ЗатребованоЦех КАК ЗатребованоЦех,
	|	Комплектация.Номенклатура КАК Номенклатура,
	|	Комплектация.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Комплектация.Комментарий КАК Комментарий,
	|	Комплектация.Ссылка.Спецификация.Контрагент КАК Контрагент,
	|	Комплектация.Ссылка.Спецификация.Подразделение КАК ПодразделениеСпецификации,
	|	Комплектация.Ссылка.Спецификация.ЦветЛДСПОсновной КАК ЦветЛДСПОсновной,
	|	Комплектация.Ссылка.Спецификация.ПлощадьСборкиИзделия КАК ПлощадьСборкиИзделия,
	|	ВЫБОР
	|		КОГДА Комплектация.Номенклатура.Базовый
	|			ТОГДА Остатки.Количество
	|		ИНАЧЕ Остатки.Количество / Комплектация.Номенклатура.КоэффициентБазовых
	|	КОНЕЦ КАК ОстатокНаСкладе,
	|	Настройки.АдресХранения КАК АдресХранения
	|ИЗ
	|	Документ.Комплектация.СписокНоменклатуры КАК Комплектация
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстатки КАК Остатки
	|		ПО (Комплектация.Номенклатура = Остатки.Номенклатура
	|				ИЛИ Комплектация.Номенклатура.БазоваяНоменклатура = Остатки.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(, Подразделение = &Подразделение) КАК Настройки
	|		ПО (Комплектация.Номенклатура = Настройки.Номенклатура
	|				ИЛИ Комплектация.Номенклатура.БазоваяНоменклатура = Настройки.Номенклатура)
	|ГДЕ
	|	НЕ Комплектация.Ссылка.ПометкаУдаления
	|	И Комплектация.Ссылка В(&МассивДокументов)
	|	И Комплектация.Ссылка.Проведен
	|ИТОГИ
	|	Дата КАК Дата,
	|	Номер КАК Номер,
	|	Спецификация КАК Спецификация,
	|	Контрагент КАК Контрагент,
	|	ПодразделениеСпецификации КАК ПодразделениеСпецификации,
	|	ЦветЛДСПОсновной КАК ЦветЛДСПОсновной,
	|	ПлощадьСборкиИзделия КАК ПлощадьСборкиИзделия
	|ПО
	|	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокНоменклатурыШапка = Макет.ПолучитьОбласть("СписокНоменклатурыШапка");
	ОбластьСписокНоменклатуры = Макет.ПолучитьОбласть("СписокНоменклатуры");
	ОбластьОтклоненияШапка = Макет.ПолучитьОбласть("СписокНоменклатурыШапкаОтклонения");
	ОбластьОтклоненияСтрока = Макет.ПолучитьОбласть("СписокНоменклатурыОтклонения");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		Спец = Выборка.Спецификация;
		
		Если ВставлятьРазделительСтраниц Тогда
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		Логотип = ЛексСервер.ПолучитьЛоготипСервер(Спец, Истина);
		
		Если ТипЗнч(Логотип) = Тип("ДвоичныеДанные") Тогда
			ОбластьЗаголовок.Рисунки.D1.Картинка = Новый Картинка(Логотип);
			ОбластьЗаголовок.Рисунки.D1.ВыводитьНаПечать = Истина;
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Выборка.Номер);
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=D");
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		
		СтатусСпец = Документы.Спецификация.ПолучитьСтатусСпецификации(Выборка.Спецификация);
		Шапка.Параметры.Статус = СтатусСпец;
		
		Результат = СформироватьКомментарииДвери(Выборка.Спецификация);
		Шапка.Параметры.Проем = Результат.Проем;
		
		Шапка.Параметры.ОсновнойЦветЛДСП = Выборка.ЦветЛДСПОсновной;
		
		Шапка.Параметры.ВремяДокумента = Выборка.Дата;
		
		ТабДок.Вывести(Шапка);
		
		ТабДок.Вывести(ОбластьСписокНоменклатурыШапка);
		
		ВыборкаСписокНоменклатуры = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСписокНоменклатуры.Следующий() Цикл
			
			ОбластьСписокНоменклатуры.Параметры.Заполнить(ВыборкаСписокНоменклатуры);
			ТабДок.Вывести(ОбластьСписокНоменклатуры);
			
		КонецЦикла;
		
		ВыборкаСписокНоменклатуры.Сбросить();
		ВыводитьШапку = Истина;
		
		Пока ВыборкаСписокНоменклатуры.Следующий() Цикл
			
			Если ВыборкаСписокНоменклатуры.КоличествоСклад <> ВыборкаСписокНоменклатуры.ЗатребованоСклад
				ИЛИ ВыборкаСписокНоменклатуры.КоличествоЦех <> ВыборкаСписокНоменклатуры.ЗатребованоЦех Тогда
				
				Если ВыводитьШапку Тогда
					
					ВыводитьШапку = Ложь;
					ТабДок.Вывести(ОбластьОтклоненияШапка);
					
				КонецЕсли;
				
				ОбластьОтклоненияСтрока.Параметры.Заполнить(ВыборкаСписокНоменклатуры);
				ОбластьОтклоненияСтрока.Параметры.НеВыданоСклад = (ВыборкаСписокНоменклатуры.ЗатребованоСклад - ВыборкаСписокНоменклатуры.КоличествоСклад);
				ОбластьОтклоненияСтрока.Параметры.НеВыданоЦех = (ВыборкаСписокНоменклатуры.ЗатребованоЦех - ВыборкаСписокНоменклатуры.КоличествоЦех);
				
				ТабДок.Вывести(ОбластьОтклоненияСтрока);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗапросФ = Новый Запрос;
		ЗапросФ.УстановитьПараметр("Документ", Спец);
		ЗапросФ.УстановитьПараметр("ДокументОснование", Спец.ДокументОснование);
		ЗапросФ.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Файлы.Вид КАК ВидФайла
		|ИЗ
		|	Справочник.ФайлыЛекс КАК Файлы
		|ГДЕ
		|	((ВЫРАЗИТЬ(Файлы.ВладелецФайла КАК Документ.Спецификация)) = &Документ
		|			ИЛИ (ВЫРАЗИТЬ(Файлы.ВладелецФайла КАК Документ.Замер)) = &ДокументОснование)
		|	И Файлы.ПометкаУдаления = ЛОЖЬ
		|	И (Файлы.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыПрисоединенныхФайлов.МонтажнаяСхема)
		|			ИЛИ Файлы.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыПрисоединенныхФайлов.Эскиз)
		|			ИЛИ Файлы.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыПрисоединенныхФайлов.ЗамерныйЛист))";
		
		КоличествоПрикрепленныхФайлов = ЗапросФ.Выполнить().Выбрать().Количество();
		
		Если КоличествоПрикрепленныхФайлов > 0 Тогда
			
			ОбластьПрикрепленныеФайлы = Макет.ПолучитьОбласть("ПрикрепленныеФайлы");
			ОбластьПрикрепленныеФайлы.Параметры.Количество = КоличествоПрикрепленныхФайлов;
			ТабДок.Вывести(ОбластьПрикрепленныеФайлы);
			
		КонецЕсли;
		
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьКомментарииДвери(СпецификацияСсылка)
	
	СтруктураРезультатов = Новый Структура;
	Результат = "";
	Проем = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СпецификацияСсылка", СпецификацияСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпецификацияСписокДверей.Двери.Код КАК Код,
	|	СпецификацияСписокДверей.Двери.Комментарий КАК Комментарий,
	|	СпецификацияСписокДверей.Двери.ШиринаПроема КАК ШиринаПроема,
	|	СпецификацияСписокДверей.Двери.ВысотаПроема Как ВысотаПроема
	|ИЗ
	|	Документ.Спецификация.СписокДверей КАК СпецификацияСписокДверей
	|ГДЕ
	|	СпецификацияСписокДверей.Ссылка = &СпецификацияСсылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат = Результат + Выборка.Код + " - " + Выборка.Комментарий + " ";
		Проем = Проем + "Высота: " + Выборка.ВысотаПроема + " " + "Ширина: " + Выборка.ШиринаПроема + "; ";
	КонецЦикла;
	СтруктураРезультатов.Вставить("Комментарий", Результат);
	СтруктураРезультатов.Вставить("Проем", Проем);
	
	Возврат СтруктураРезультатов;
	
КонецФункции
