
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

//Функция ПолучитьКомплектации(СсылкаСпецификация) Экспорт
//	
//	МассивДокументов = ЛексСервер.НайтиПодчиненныеДокументы(СсылкаСпецификация, "Документ.Комплектация", "Спецификация");
//	Если МассивДокументов.Количество() > 0 Тогда
//		Возврат МассивДокументов;
//	//ИначеЕсли МассивДокументов.Количество() = 0 Тогда
//	Иначе
//		Возврат МассивДокументов.Вставить(Документы.Комплектация.ПустаяСсылка());
//	//Иначе
//	//	ВызватьИсключение "Ошибка 795: Нарушена связь ""Спецификации"" и документа ""Комплектация""";
//	КонецЕсли;
//	
//КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
КонецПроцедуры

Функция СформироватьКомментарииДвери(СпецификацияСсылка)
	
	СтруктураРезультатов = Новый Структура;
	Результат = "";
	ШиринаПроема = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СпецификацияСсылка", СпецификацияСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпецификацияСписокДверей.Двери.Код КАК Код,
	|	СпецификацияСписокДверей.Двери.Комментарий КАК Комментарий,
	|	СпецификацияСписокДверей.Двери.ШиринаПроема КАК ШиринаПроема
	|ИЗ
	|	Документ.Спецификация.СписокДверей КАК СпецификацияСписокДверей
	|ГДЕ
	|	СпецификацияСписокДверей.Ссылка = &СпецификацияСсылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат = Результат + Выборка.Код + " - " + Выборка.Комментарий + " ";
		ШиринаПроема = ШиринаПроема + Выборка.ШиринаПроема + " ";
	КонецЦикла;
	СтруктураРезультатов.Вставить("Комментарий", Результат);
	СтруктураРезультатов.Вставить("ШиринаПроема", ШиринаПроема);
	
	Возврат СтруктураРезультатов;
	
КонецФункции
