
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Спецификация") Тогда
		
		Подразделение = ДанныеЗаполнения.Подразделение;
		Склад = Подразделение.ОсновнойСклад;
		Спецификация = ДанныеЗаполнения;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗначениеЗаполнено(Ссылка) И НЕ Ссылка.Проведен Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КомплектацияСсылка = Документы.Комплектация.ПолучитьКомплектацию(Спецификация);
	
	СуммаДокумента = ПолучитьСуммуКомплектации();
	
	Если ЗначениеЗаполнено(КомплектацияСсылка) И Ссылка <> КомплектацияСсылка Тогда
		
		Отказ = Истина;
		ТекстСообщения = "К " + Спецификация + " уже введена " + КомплектацияСсылка;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, КомплектацияСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСуммуКомплектации()
	
	//МассивНоменклатуры = СписокНоменклатуры.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(СписокНоменклатуры.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ СписокНоменклатуры
		|ИЗ
		|	&МассивНоменклатуры КАК СписокНоменклатуры
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыПоПодразделениямСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыПоПодразделениямСрезПоследних.Розничная КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыПоПодразделениям.СрезПоследних(
		|			&Дата,
		|			Подразделение = &Подразделение
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						СписокНоменклатуры.Номенклатура
		|					ИЗ
		|						СписокНоменклатуры КАК СписокНоменклатуры)) КАК ЦеныНоменклатурыПоПодразделениямСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МассивНоменклатуры", СписокНоменклатуры);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ОбщаяСумма = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НайденнаяСтрока = СписокНоменклатуры.Найти(ВыборкаДетальныеЗаписи.Номенклатура, "Номенклатура");
		ОбщаяСумма = ОбщаяСумма + (НайденнаяСтрока.КоличествоСклад + НайденнаяСтрока.КоличествоЦех) * ВыборкаДетальныеЗаписи.Цена;
		
	КонецЦикла;
	
	Возврат ОбщаяСумма;
	
КонецФункции // ПолучитьСуммуКомплектации()


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Управленческий.Записать();
	
	Ошибки = Неопределено;
	СвойстваДокумента = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "Подразделение, Дата");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КомплектацияСписокНоменклатуры.Номенклатура,
	|	МИНИМУМ(КомплектацияСписокНоменклатуры.НомерСтроки) КАК НомерСтроки,
	|	СУММА(КомплектацияСписокНоменклатуры.КоличествоСклад + КомплектацияСписокНоменклатуры.КоличествоЦех) КАК Количество
	|ИЗ
	|	Документ.Комплектация.СписокНоменклатуры КАК КомплектацияСписокНоменклатуры
	|ГДЕ
	|	КомплектацияСписокНоменклатуры.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КомплектацияСписокНоменклатуры.Номенклатура";
	
	ТаблицаМатериалов = Запрос.Выполнить().Выгрузить();
	
	Структура = ЛексСервер.ПеремещениеМатериаловВПроизводство(ТаблицаМатериалов, Подразделение, Склад, Движения, МоментВремени());
	
	Для каждого СтрокаНехватки Из Структура.тзНехватка Цикл
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%5 На складе %1 недостаточно материала '%2'. Из требуемых %3 есть только %4", 
		Склад,
		СтрокаНехватки.Номенклатура, 
		СтрокаНехватки.КоличествоТребуется,
		СтрокаНехватки.КоличествоОстаток,
		Ссылка);
		Поле = "Объект.СписокНоменклатуры[" +Строка(СтрокаНехватки.НомерСтроки-1) + "].КоличествоЦех";
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, Поле, ТекстСообщения);
		
	КонецЦикла;
	
	Если Ошибки <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		Возврат;
		
	Иначе
		
		Движения.Управленческий.Записывать = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ Спецификация.Проведен Тогда
		
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено проводить комплектацию к непроведенной спецификации");
		
	КонецЕсли;
	
КонецПроцедуры
