
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Спецификация = ПараметрКоманды; 
	СтатусИзменен = ПередатьНаРасчет(Спецификация);
	
	Если СтатусИзменен И ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Документ.Спецификация.Форма.ФормаДокумента" Тогда
		ОповеститьОбИзменении(Спецификация);
		Оповестить("ИзмененСтатусСпецификации", Спецификация);
		ПараметрыВыполненияКоманды.Источник.Прочитать();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПередатьНаРасчет(СпецификацияСсылка)
	
	СтатусИзменен = Ложь;
	
	ТекущийСтатус = Документы.Спецификация.ПолучитьСтатусСпецификации(СпецификацияСсылка);
	
	Если ТекущийСтатус = Перечисления.СтатусыСпецификации.Сохранен Тогда	
		
		Если СпецификацияСсылка.Изделие = Справочники.Изделия.Детали Тогда
			
			Сообщить("Изделие ""Детали"" нельзя передать на расчет инженеру.");
			
		Иначе
		
			Документы.Спецификация.УстановитьСтатусСпецификации(СпецификацияСсылка, Перечисления.СтатусыСпецификации.Рассчитывается);
			СтатусИзменен = Истина;
			
		КонецЕсли;
	Иначе
		Сообщить("На Расчет передаются только спецификации со статусом ""Сохранен""");
	КонецЕсли;
	
	Возврат СтатусИзменен;
	
КонецФункции
