
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Для Каждого Документ Из ПараметрКоманды Цикл
		
		Массив = Новый Массив;
		Массив.Добавить(Документ);
		
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ФиксированныйКомплект", Ложь); 
		ПараметрыПечати.Вставить("ПереопределитьПользовательскиеНастройкиКоличества", Истина);
		
		МассивМакетов = ОпределитьМакеты(Документ);
				
		Если ЗначениеЗаполнено(МассивМакетов) Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Спецификация", СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивМакетов), Массив, ПараметрыВыполненияКоманды.Источник, ПараметрыПечати);
		Иначе
			Предупреждение("Документы на печать отсутствуют!");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьМакеты(Документ)
	
	МассивМакетов = Новый Массив;
	
	МассивМакетов.Добавить("Спецификация");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Файлы.ВидФайла
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	ВЫРАЗИТЬ(Файлы.ВладелецФайла КАК Документ.Спецификация) = &Документ
	|	И (Файлы.ВидФайла = ЗНАЧЕНИЕ(Перечисление.ВидыПрисоединенныхФайлов.Эскиз)
	|		ИЛИ Файлы.ВидФайла = ЗНАЧЕНИЕ(Перечисление.ВидыПрисоединенныхФайлов.ЗамерныйЛист)
	|		ИЛИ Файлы.ВидФайла = ЗНАЧЕНИЕ(Перечисление.ВидыПрисоединенныхФайлов.МонтажнаяСхема))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДобавитьЭскиз = Ложь;
	ДобавитьЗамерныйЛист = Ложь;
	ДобавитьМонтажнаяСхема = Ложь;
	
	ВидЭскиз = ПредопределенноеЗначение("Перечисление.ВидыПрисоединенныхФайлов.Эскиз");
	ВидЗамерныйЛист = ПредопределенноеЗначение("Перечисление.ВидыПрисоединенныхФайлов.Эскиз");
	ВидМонтажнаяСхема = ПредопределенноеЗначение("Перечисление.ВидыПрисоединенныхФайлов.Эскиз");
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.ВидФайла = ВидЭскиз И ДобавитьЭскиз = Ложь Тогда
			МассивМакетов.Добавить("ЭскизнаяЗаявка");
		КонецЕсли;
		
		Если Выборка.ВидФайла = ВидЗамерныйЛист И ДобавитьЗамерныйЛист = Ложь Тогда
			МассивМакетов.Добавить("ЗамерныйЛист");
		КонецЕсли;
		
		//Если Выборка.ВидФайла = ВидМонтажнаяСхема И ДобавитьМонтажнаяСхема = Ложь Тогда
		//	МассивМакетов.Добавить("МонтажнаяСхема");
		//КонецЕсли;
	
	КонецЕсли; 
	
	Возврат МассивМакетов;
	
КонецФункции
