
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ДолжностиСотрудников.Записывать = Истина;
	
	Для каждого Строка Из СписокСотрудников Цикл
		
		Проводка = Движения.ДолжностиСотрудников.Добавить();
		Проводка.Период = Дата;
		Проводка.Подразделение =Подразделение;
		Проводка.ФизЛицо = Строка.Сотрудник;
		Проводка.Должность = Строка.Должность;
		Проводка.Работает = Строка.Работает;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры
