
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвиженияУправленческий();
КонецПроцедуры

Функция СформироватьДвиженияУправленческий()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеСредстваСрезПоследних.ОсновноеСредство,
		|	ОсновныеСредстваСрезПоследних.СрокАмортизации,
		|	ОсновныеСредстваСрезПоследних.Стоимость
		|ИЗ
		|	РегистрСведений.ОсновныеСредства.СрезПоследних КАК ОсновныеСредстваСрезПоследних
		|ГДЕ
		|	ОсновныеСредстваСрезПоследних.НачислятьАмортизацию";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		Проводка = Движения.Управленческий.Добавить();
		Проводка.Период = Дата;
		Проводка.Сумма = Выборка.Стоимость / Выборка.СрокАмортизации;
		Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = Справочники.СтатьиДоходовРасходов.АмортизацияОС; 
		Проводка.СчетКт = ПланыСчетов.Управленческий.АмортизацияОС;		
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства] = Выборка.ОсновноеСредство;

	КонецЦикла;

КонецФункции // СформироватьДвиженияУправленческий()

