
&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("АдресТаблицы", ПолучитьАдресТаблицы(ТаблицаВыбранных));
	
	ОповеститьОВыборе(Структура);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицы(фТаблица)
	
	АдресТаблицы = ПоместитьВоВременноеХранилище(фТаблица.Выгрузить());
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Подразделение = Параметры.Подразделение;
	УстановитьПараметрыЗапроса(Остатки, Подразделение);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьПараметрыЗапроса(ДинамическийСписок, фПодразделение)
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Подразделение", фПодразделение);
	
КонецФункции

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	УстановитьПараметрыЗапроса(Остатки, Подразделение);
	
КонецПроцедуры

