
//Процедура ОбработкаПроведения(Отказ, Режим)
//	
//	Движения.СостояниеОС.Очистить();
//	Движения.ОсновныеСредства.Очистить();
//	Движения.СостояниеОС.Записать();
//	Движения.ОсновныеСредства.Записать();
//	
//	// блокировка ещё по хорошему нужна
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	СписаниеОСОсновныеСредства.ОС,
//	|	СписаниеОСОсновныеСредства.НомерСтроки
//	|ПОМЕСТИТЬ тчДок
//	|ИЗ
//	|	Документ.СписаниеОсновныхСредств.ОсновныеСредства КАК СписаниеОСОсновныеСредства
//	|ГДЕ
//	|	СписаниеОСОсновныеСредства.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	тчДок.ОС,
//	|	тчДок.НомерСтроки,
//	|	ЕСТЬNULL(СостояниеОССрезПоследних.ПринятоКУчету, ЛОЖЬ) КАК ПринятоКУчету,
//	|	СостояниеОССрезПоследних.МОЛ,
//	|	СостояниеОССрезПоследних.НачислятьАмортизацию,
//	|	СостояниеОССрезПоследних.СрокАмортизации,
//	|	СостояниеОССрезПоследних.ПервоначальнаяСтоимость,
//	|	ЕСТЬNULL(ОсновныеСредстваОстатки.СуммаОстаток, 0) КАК ОстаточнаяСтоимость
//	|ИЗ
//	|	тчДок КАК тчДок
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеОС.СрезПоследних(
//	|				&МоментВремени,
//	|				ПринятоКУчету
//	|					И ОсновноеСредство В
//	|						(ВЫБРАТЬ
//	|							т.ОС
//	|						ИЗ
//	|							тчДок КАК т)) КАК СостояниеОССрезПоследних
//	|		ПО тчДок.ОС = СостояниеОССрезПоследних.ОсновноеСредство
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОсновныеСредства.Остатки(
//	|				&МоментВремени,
//	|				Подразделение = &Подразделение
//	|					И ОсновноеСредство В
//	|						(ВЫБРАТЬ
//	|							т.ОС
//	|						ИЗ
//	|							тчДок КАК т)) КАК ОсновныеСредстваОстатки
//	|		ПО тчДок.ОС = ОсновныеСредстваОстатки.ОсновноеСредство
//	|ИТОГИ
//	|	СУММА(ОстаточнаяСтоимость)
//	|ПО
//	|	ОБЩИЕ";
//	
//	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
//	Запрос.УстановитьПараметр("Подразделение", Подразделение);
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	
//	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	ВыборкаИтоги.Следующий();
//	
//	Проводки = Движения.ОборотыПоСтатьям.Добавить();
//	Проводки.Период = Дата;
//	Проводки.Подразделение = Подразделение;
//	Проводки.Статья = СтатьяЗатрат;
//	Проводки.Факт = ВыборкаИтоги.ОстаточнаяСтоимость;
//	
//	Выборка = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	Пока Выборка.Следующий() Цикл
//		
//		Если НЕ Выборка.ПринятоКУчету ИЛИ Выборка.ОстаточнаяСтоимость = 0 Тогда
//			ТекстСообщения = "Основное средство """ + Выборка.ОС + """ в подразделении " + Подразделение + " по данным управленческого учета не числится";
//			ПолеСообщения = "ОсновныеСредства["+(Выборка.НомерСтроки - 1)+"].ОС";
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПолеСообщения);
//			Отказ = Истина;
//			Продолжить;
//		КонецЕсли;
//		
//		Проводки = Движения.СостояниеОС.Добавить();
//		Проводки.Период = Дата;
//		Проводки.ПринятоКУчету = Ложь;
//		
//		Проводки = Движения.ОсновныеСредства.ДобавитьРасход();
//		Проводки.Период = Дата;
//		Проводки.Подразделение = Подразделение;
//		Проводки.ОсновноеСредство = Выборка.ОС;
//		Проводки.Сумма = Выборка.ОстаточнаяСтоимость;
//		
//	КонецЦикла;
//	
//	Если НЕ Отказ Тогда
//		
//		Движения.СостояниеОС.Записывать = Истина;
//		Движения.ОборотыПоСтатьям.Записывать = Истина;
//		Движения.ОсновныеСредства.Записывать = Истина;
//		
//	КонецЕсли;
//	
//КонецПроцедуры
