&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
	
		Объект.Дата = КонецМесяца(ТекущаяДата());
	
	КонецЕсли; 	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ЗаполнитьДанными();
	
КонецПроцедуры
			   
&НаСервере
Процедура ЗаполнитьДанными()
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата));
		Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	УправленческийОбороты.Субконто1 КАК Статья1,
		               |	СУММА(УправленческийОбороты.СуммаОборотКт) КАК Доход1,
		               |	СУММА(УправленческийОбороты.СуммаОборотДт) КАК Расход1
		               |ПОМЕСТИТЬ Обороты
		               |ИЗ
		               |	РегистрБухгалтерии.Управленческий.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибыльУбытки)), , Подразделение = &Подразделение, , ) КАК УправленческийОбороты
		               |ГДЕ
		               |	НЕ УправленческийОбороты.Регистратор = &Регистратор
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	УправленческийОбороты.Субконто1
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	УправленческийОстатки.Субконто1 КАК Статья,
		               |	УправленческийОстатки.СуммаРазвернутыйОстатокДт + Обороты.Доход1 КАК Доход,
		               |	УправленческийОстатки.СуммаРазвернутыйОстатокКт + Обороты.Расход1 КАК Расход
		               |ИЗ
		               |	РегистрБухгалтерии.Управленческий.Остатки(&НачалоПериода, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибыльУбытки)), , Подразделение = &Подразделение) КАК УправленческийОстатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
		               |		ПО УправленческийОстатки.Субконто1 = Обороты.Статья1";
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Объект.Список.Загрузить(Результат.Выгрузить());
		
		Объект.Сумма = Объект.Список.Итог("Доход") - Объект.Список.Итог("Расход")
	
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Дата = КонецМесяца(Объект.Дата);
	ЗаполнитьДанными();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗаполнитьДанными();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры
 
 