
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполнить можно только не проведенный документ. Снимите проведение.");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанными();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанными()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческийОбороты.Субконто1 КАК Статья,
	|	СУММА(УправленческийОбороты.СуммаОборотДт) КАК Расход,
	|	СУММА(УправленческийОбороты.СуммаОборотКт) КАК Доход
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибыльУбытки)), , Подразделение = &Подразделение, , ) КАК УправленческийОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	УправленческийОбороты.Субконто1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Доход УБЫВ,
	|	Расход УБЫВ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Объект.Список.Загрузить(Результат.Выгрузить());
	
	Объект.СуммаДоходов = Объект.Список.Итог("Доход");
	Объект.СуммаРасходов = Объект.Список.Итог("Расход");
	
	Объект.СуммаДокумента = Объект.СуммаДоходов - Объект.СуммаРасходов;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Дата = КонецМесяца(Объект.Дата);
	ЗаполнитьДанными();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗаполнитьДанными();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Функция ПередЗаписьюНаСервере()
	
КонецФункции

	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	УправленческийОбороты.Субконто1 КАК ОборотСтатья,
	//|	СУММА(УправленческийОбороты.СуммаОборотДт) КАК ОборотДт,
	//|	СУММА(УправленческийОбороты.СуммаОборотКт) КАК ОборотКт
	//|ПОМЕСТИТЬ ОборотыБезПроведенных
	//|ИЗ
	//|	РегистрБухгалтерии.Управленческий.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибыльУбытки)), , Подразделение = &Подразделение, , ) КАК УправленческийОбороты
	//|ГДЕ
	//|	УправленческийОбороты.Регистратор <> &Регистратор
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	УправленческийОбороты.Субконто1
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЕСТЬNULL(Остатки.Субконто1, ОборотыБезПроведенных.ОборотСтатья) КАК Статья,
	//|	ВЫБОР
	//|		КОГДА ОборотыБезПроведенных.ОборотКт ЕСТЬ NULL 
	//|			ТОГДА ЕСТЬNULL(Остатки.СуммаОстатокКт, 0)
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА Остатки.СуммаОстатокКт ЕСТЬ NULL 
	//|					ТОГДА ОборотыБезПроведенных.ОборотКт
	//|				ИНАЧЕ Остатки.СуммаОстатокКт + ОборотыБезПроведенных.ОборотКт
	//|			КОНЕЦ
	//|	КОНЕЦ КАК Доход,
	//|	ВЫБОР
	//|		КОГДА ОборотыБезПроведенных.ОборотДт ЕСТЬ NULL 
	//|			ТОГДА ЕСТЬNULL(Остатки.СуммаОстатокДт, 0)
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА Остатки.СуммаОстатокДт ЕСТЬ NULL 
	//|					ТОГДА ОборотыБезПроведенных.ОборотДт
	//|				ИНАЧЕ Остатки.СуммаОстатокДт + ОборотыБезПроведенных.ОборотДт
	//|			КОНЕЦ
	//|	КОНЕЦ КАК Расход
	//|ИЗ
	//|	РегистрБухгалтерии.Управленческий.Остатки(&НачалоПериода, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибыльУбытки)), , Подразделение = &Подразделение) КАК Остатки
	//|		ПОЛНОЕ СОЕДИНЕНИЕ ОборотыБезПроведенных КАК ОборотыБезПроведенных
	//|		ПО Остатки.Субконто1 = ОборотыБезПроведенных.ОборотСтатья
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Расход";

