&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Дата = КонецМесяца(Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ЗаполнитьДанными();
	
КонецПроцедуры
			   
&НаСервере
Процедура ЗаполнитьДанными()
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата)-1);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	УправленческийОстаткиИОбороты.Субконто1 КАК Статья,
		               |	УправленческийОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокДт КАК Расход,
		               |	УправленческийОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокКт КАК Доход,
		               |	ВЫБОР
		               |		КОГДА УправленческийОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокКт > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ 1
		               |	КОНЕЦ КАК Сорт
		               |ИЗ
		               |	РегистрБухгалтерии.Управленческий.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибыльУбытки)), , Подразделение = &Подразделение) КАК УправленческийОстаткиИОбороты
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Сорт,
		               |	Статья";
		Результат = Запрос.Выполнить();
		Объект.Список.Загрузить(Результат.Выгрузить());
	
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Дата = КонецМесяца(Объект.Дата);
	ЗаполнитьДанными();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗаполнитьДанными();
	
КонецПроцедуры
 
 