&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
	
		Объект.Дата = КонецМесяца(ТекущаяДата());
	
	КонецЕсли; 	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ЗаполнитьДанными();
	
КонецПроцедуры
			   
&НаСервере
Процедура ЗаполнитьДанными()
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата));
		Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	УправленческийОбороты.Субконто1 КАК ОборотСтатья,
		               |	СУММА(УправленческийОбороты.СуммаОборотДт) КАК ОборотДт,
		               |	СУММА(УправленческийОбороты.СуммаОборотКт) КАК ОборотКт
		               |ПОМЕСТИТЬ ОборотыБезПроведенных
		               |ИЗ
		               |	РегистрБухгалтерии.Управленческий.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибыльУбытки)), , Подразделение = &Подразделение, , ) КАК УправленческийОбороты
		               |ГДЕ
		               |	УправленческийОбороты.Регистратор <> &Регистратор
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	УправленческийОбороты.Субконто1
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Остатки.Субконто1 КАК Статья,
		               |	Остатки.СуммаОстатокДт КАК ОстДт,
		               |	Остатки.СуммаОстатокКт КАК ОстКт,
		               |	ВЫБОР
		               |		КОГДА ОборотыБезПроведенных.ОборотКт ЕСТЬ NULL 
		               |			ТОГДА Остатки.СуммаОстатокКт
		               |		ИНАЧЕ Остатки.СуммаОстатокКт + ОборотыБезПроведенных.ОборотКт
		               |	КОНЕЦ КАК Доход,
		               |	ВЫБОР
		               |		КОГДА ОборотыБезПроведенных.ОборотДт ЕСТЬ NULL 
		               |			ТОГДА Остатки.СуммаОстатокДт
		               |		ИНАЧЕ Остатки.СуммаОстатокДт + ОборотыБезПроведенных.ОборотДт
		               |	КОНЕЦ КАК Расход
		               |ИЗ
		               |	РегистрБухгалтерии.Управленческий.Остатки(&НачалоПериода, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрибыльУбытки)), , Подразделение = &Подразделение) КАК Остатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыБезПроведенных КАК ОборотыБезПроведенных
		               |		ПО Остатки.Субконто1 = ОборотыБезПроведенных.ОборотСтатья
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Расход";
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Объект.Список.Загрузить(Результат.Выгрузить());
		
		Объект.Сумма = Объект.Список.Итог("Доход") - Объект.Список.Итог("Расход")
	
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Дата = КонецМесяца(Объект.Дата);
	ЗаполнитьДанными();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗаполнитьДанными();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры
 
 