
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЛексСервер.ПроверитьПодразделение(ПараметрКоманды) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбраны документы разных подразделений.");
		Возврат;
	КонецЕсли;
	
	//RonEXI: Пока пусть печатают не проведенные, ибо материала на складе нет, а доки у же нужны.
	//Проведены = ПроверитьПроведение(ПараметрКоманды);
	Проведены = Истина;
	
	Если Проведены Тогда
	
		МассивМакетов = ОпределитьМакеты(ПараметрКоманды);
		
		Если ЗначениеЗаполнено(МассивМакетов) Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ТребованиеНакладная", СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивМакетов), ПараметрКоманды, ПараметрыВыполненияКоманды, Неопределено);
		Иначе
			Предупреждение("Документы на печать отсутствуют!");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьМакеты(Документы)
	
	МассивМакетов = Новый Массив;
	МассивМакетов.Добавить("ПечатьТребованиеНакладная");
	МассивМакетов.Добавить("ПечатьРулонныйМатериал");
	МассивМакетов.Добавить("ПечатьХлыстовойМатериал");
	МассивМакетов.Добавить("ПечатьЛистовойМатериал");
	МассивМакетов.Добавить("ПечатьШтучныйМатериал");
	
	Возврат МассивМакетов;
	
КонецФункции

&НаСервере
Функция ПроверитьПроведение(ПараметрКоманды)
	
	Проведены = Истина;
	
	Для Каждого Документ Из ПараметрКоманды Цикл
		
		Если НЕ Документ.Проведен Тогда
			
			Проведены = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + Документ + " не проведена.");
	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Проведены;
	
КонецФункции