
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьТребованиеНакладная)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьТребованиеНакладная(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьТребованиеНакладная(ТабДок, ПараметрКоманды)
	Документы.ТребованиеНакладная.ПечатьТребованиеНакладная(ТабДок, ПараметрКоманды);
КонецПроцедуры
