
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьТребованиеНакладная(ТабДок, ПараметрКоманды);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать("Требование накладная");
	
КонецПроцедуры

&НаСервере
Процедура ПечатьТребованиеНакладная(ТабДок, ПараметрКоманды)
	
	Документы.ТребованиеНакладная.ПечатьТребованиеНакладная(ТабДок, ПараметрКоманды);
	
КонецПроцедуры
