&НаСервере
Функция ПолучитьВопросыПоТеме(Владелец)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВопросыПользователям.ТекстВопроса,
	|	ВопросыПользователям.СписокОтветов.(
	|		Ссылка,
	|		НомерСтроки,
	|		Ответ,
	|		Правильный
	|	),
	|	ВопросыПользователям.Тема,
	|	ВопросыПользователям.Ссылка
	|ИЗ
	|	Справочник.ВопросыПользователям КАК ВопросыПользователям
	|ГДЕ
	|	НЕ ВопросыПользователям.ПометкаУдаления
	//|	И ВопросыПользователям.Активность
	|	И ВЫБОР
	|			КОГДА &Владелец = ЗНАЧЕНИЕ(Справочник.ПравоваяБаза.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВопросыПользователям.Владелец = &Владелец
	|		КОНЕЦ";
	
	ВсеВопросыПоТеме = Запрос.Выполнить().Выгрузить();
	ВсегоВопросов = ВсеВопросыПоТеме.Количество();
	
	СтруктураСЧ = Новый Структура;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Пока СтруктураСЧ.Количество() < КолвоВопросов Цикл
		
		СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0, ВсегоВопросов-1);
		СтруктураСЧ.Вставить("К"+СлучайноеЧисло, СлучайноеЧисло);	
		
	КонецЦикла;
	
	Для каждого СлучайноеЧисло Из СтруктураСЧ Цикл
		
		НовыйВопрос = СлучайныеВопросы.Добавить();
		НовыйВопрос.Ссылка = ВсеВопросыПоТеме[СлучайноеЧисло.Значение].Ссылка;
		НовыйВопрос.СписокОтветов.Загрузить(ВсеВопросыПоТеме[СлучайноеЧисло.Значение].СписокОтветов);
		НовыйВопрос.ТекстВопроса = ВсеВопросыПоТеме[СлучайноеЧисло.Значение].ТекстВопроса;
		НовыйВопрос.Тема = ВсеВопросыПоТеме[СлучайноеЧисло.Значение].Тема;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьВопрос(НомерВопроса)
	ОбновитьФорму();
	Элементы.ТекстВопроса.Заголовок = СлучайныеВопросы[НомерВопроса].ТекстВопроса;
	ОтветПользователя.Очистить();
	Для каждого Ответ Из СлучайныеВопросы[НомерВопроса].СписокОтветов Цикл
		СтрокаТЧ = ОтветПользователя.Добавить();
		СтрокаТЧ.Ответ = Ответ.Ответ;
		СтрокаТЧ.Правильный = Ответ.ОтветПользователя;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаписатьОтвет(НомерВопроса)
	Записан = Ложь;
	Если НЕ ЗначениеЗаполнено(ОтветПользователя.НайтиСтроки(Новый Структура("Правильный",Истина))) Тогда
		ПоказатьОповещениеПользователя("Ошибка",,"Сначала ответьте на вопрос");
	Иначе
		
		Для каждого Ответ Из СлучайныеВопросы[НомерВопроса].СписокОтветов Цикл
			
			Ответ.ОтветПользователя = ОтветПользователя[СлучайныеВопросы[НомерВопроса].СписокОтветов.Индекс(Ответ)].Правильный;
			
		КонецЦикла;
		Записан = Истина;
	КонецЕсли;
	Возврат Записан;
КонецФункции


//&НаКлиенте
//Функция НачатьТестирование(Команда)
//	ТекущийВопрос = 0;
//	ПолучитьВопрос(ТекущийВопрос);
//	ОбновитьФорму();
//КонецФункции

&НаКлиенте
Процедура СледующийВопрос(Команда)
	
	Если ЗаписатьОтвет(ТекущийВопрос) Тогда
		Если Элементы.СледующийВопрос.Заголовок = "Завершить тестирование" Тогда
			ЗакончитьТестированиеНаСервере();
		Иначе	
			ТекущийВопрос = ТекущийВопрос + 1;
			ПолучитьВопрос(ТекущийВопрос);	
		КонецЕсли;	

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущийВопрос(Команда)
	
	Если ЗаписатьОтвет(ТекущийВопрос) Тогда
		ТекущийВопрос = ТекущийВопрос - 1;
		ПолучитьВопрос(ТекущийВопрос);
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ЗакончитьТестирование(Команда)
//	ЗаписатьОтвет(ТекущийВопрос);
//	
//КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()
	
	Если ТекущийВопрос <= 0 Тогда
		
		Элементы.ПредыдущийВопрос.Доступность = Ложь;
		Элементы.СледующийВопрос.Доступность = Истина;
		
	ИначеЕсли ТекущийВопрос = КолвоВопросов-1 Тогда
		
		Элементы.ПредыдущийВопрос.Доступность = Истина;
		Элементы.СледующийВопрос.Заголовок = "Завершить тестирование";
		
	Иначе
		
		Элементы.ПредыдущийВопрос.Доступность = Истина;
		Элементы.СледующийВопрос.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗакончитьТестированиеНаСервере()
	ВсегоПравильных = 0;
	Для каждого Вопрос Из СлучайныеВопросы Цикл
		
		ПравильныйОтвет = Истина;
		ОбъектВопрос = Объект.ВопросыТеста.Добавить();
		ОбъектВопрос.Вопрос = Вопрос.Ссылка;
		
		Для каждого Ответ Из Вопрос.СписокОтветов Цикл
			
			Если НЕ (Ответ.Правильный = Ответ.ОтветПользователя) Тогда
				
				ПравильныйОтвет = Ложь;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		ОбъектВопрос.ПравильныйОтвет = ПравильныйОтвет;
		ВсегоПравильных = ВсегоПравильных + ПравильныйОтвет;
	КонецЦикла;
	Элементы.ПравильныхОтветов.Заголовок = "Вы ответили верно на " + ВсегоПравильных + " из " + КолвоВопросов + " вопросов!";
КонецПроцедуры


&НаКлиенте
Процедура НачатьТестирование(Команда)
	ПолучитьВопросыПоТеме(Владелец);
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.Тест;
	ТекущийВопрос = 0;
	ПолучитьВопрос(ТекущийВопрос);
	ОбновитьФорму();
КонецПроцедуры
