
&НаСервере
Функция ПолучитьВопросыПоТеме(ПравоваяБаза)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПравоваяБаза", ПравоваяБаза);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВопросыПользователям.ТекстВопроса,
	|	ВопросыПользователям.СписокОтветов.(
	|		Ссылка,
	|		НомерСтроки,
	|		Ответ,
	|		Правильный
	|	),
	|	ВопросыПользователям.Тема,
	|	ВопросыПользователям.Ссылка
	|ИЗ
	|	Справочник.ВопросыПользователям КАК ВопросыПользователям
	|ГДЕ
	|	НЕ ВопросыПользователям.ПометкаУдаления
	//|	И ВопросыПользователям.Активность
	|	И ВЫБОР
	|			КОГДА &ПравоваяБаза = ЗНАЧЕНИЕ(Справочник.ПравоваяБаза.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВопросыПользователям.Владелец = &ПравоваяБаза
	|		КОНЕЦ";
	
	ВсеВопросыПоТеме = Запрос.Выполнить().Выгрузить();
	ВсегоВопросов = ВсеВопросыПоТеме.Количество();
	
	Если ОткрытоОбработчиком Тогда
		КолвоВопросов = Окр(0.3*ВсегоВопросов);
	КонецЕсли;
	
	МассивНомеровВопросов = Новый Массив;
	Для Сч = 0 По ВсегоВопросов - 1 Цикл	
		МассивНомеровВопросов.Добавить(Сч);	
	КонецЦикла;
	
	МассивСЧ = Новый Массив;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Пока МассивСЧ.Количество() < КолвоВопросов Цикл
		
		СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0, МассивНомеровВопросов.ВГраница());
		МассивСЧ.Добавить(МассивНомеровВопросов.Получить(СлучайноеЧисло));
		МассивНомеровВопросов.Удалить(СлучайноеЧисло);
		
	КонецЦикла;
	
	Для каждого СлучайноеЧисло Из МассивСЧ Цикл
		
		НовыйВопрос = СлучайныеВопросы.Добавить();
		НовыйВопрос.Ссылка = ВсеВопросыПоТеме[СлучайноеЧисло].Ссылка;
		НовыйВопрос.СписокОтветов.Загрузить(ВсеВопросыПоТеме[СлучайноеЧисло].СписокОтветов);
		НовыйВопрос.ТекстВопроса = ВсеВопросыПоТеме[СлучайноеЧисло].ТекстВопроса;
		НовыйВопрос.Тема = ВсеВопросыПоТеме[СлучайноеЧисло].Тема;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьВопрос(НомерВопроса)
	ОбновитьФорму();
	Элементы.ТекстВопроса.Заголовок = СлучайныеВопросы[НомерВопроса].ТекстВопроса;
	ОтветПользователя.Очистить();
	Для каждого Ответ Из СлучайныеВопросы[НомерВопроса].СписокОтветов Цикл
		СтрокаТЧ = ОтветПользователя.Добавить();
		СтрокаТЧ.Ответ = Ответ.Ответ;
		СтрокаТЧ.Правильный = Ответ.ОтветПользователя;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаписатьОтвет(НомерВопроса)
	Для каждого Ответ Из СлучайныеВопросы[НомерВопроса].СписокОтветов Цикл
		
		Ответ.ОтветПользователя = ОтветПользователя[СлучайныеВопросы[НомерВопроса].СписокОтветов.Индекс(Ответ)].Правильный;
		
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура СледующийВопрос(Команда)
	
	ЗаписатьОтвет(ТекущийВопрос);
	ТекущийВопрос = ТекущийВопрос + 1;
	ПолучитьВопрос(ТекущийВопрос);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущийВопрос(Команда)
	
	ЗаписатьОтвет(ТекущийВопрос);
	ТекущийВопрос = ТекущийВопрос - 1;
	ПолучитьВопрос(ТекущийВопрос);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()
	
	Если ТекущийВопрос <= 0 Тогда
		
		Элементы.ПредыдущийВопрос.Доступность = Ложь;
		Элементы.СледующийВопрос.Доступность = Истина;
		
	ИначеЕсли ТекущийВопрос = КолвоВопросов-1 Тогда
		
		Элементы.ПредыдущийВопрос.Доступность = Истина;
		Элементы.СледующийВопрос.Доступность = Ложь;
		
	Иначе
		
		Элементы.ПредыдущийВопрос.Доступность = Истина;
		Элементы.СледующийВопрос.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗакончитьТестированиеНаСервере()
	Объект.ВремяОкончанияТестирования = ТекущаяДата();
	ВсегоПравильных = 0;
	Для каждого Вопрос Из СлучайныеВопросы Цикл
		
		ПравильныйОтвет = Истина;
		ОбъектВопрос = Объект.ВопросыТеста.Добавить();
		ОбъектВопрос.Вопрос = Вопрос.Ссылка;
		
		Для каждого Ответ Из Вопрос.СписокОтветов Цикл
			
			Если НЕ (Ответ.Правильный = Ответ.ОтветПользователя) Тогда
				
				ПравильныйОтвет = Ложь;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		ОбъектВопрос.ПравильныйОтвет = ПравильныйОтвет;
		ВсегоПравильных = ВсегоПравильных + ПравильныйОтвет;
	КонецЦикла;
	
	Возврат ВсегоПравильных;
	
КонецФункции

&НаКлиенте
Процедура НачатьТестирование(Команда)
	ПолучитьВопросыПоТеме(ПравоваяБаза);
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.Тест;
	ТекущийВопрос = 0;
	Объект.ВремяНачалаТестирования = ТекущаяДата();
	ПолучитьВопрос(ТекущийВопрос);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ОткрытоОбработчиком Тогда
		НачатьТестирование(Команды.НачатьТестирование);
	КонецЕсли;	
	//Если Ложь Тогда
	//	ПравоваяБаза = 
	//	КолвоВопросов =
	//	
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Предупреждение("Вы ответили верно на " + ЗакончитьТестированиеНаСервере() + " из " + КолвоВопросов + " вопросов!", 5);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПравоваяБаза") Тогда
		ПравоваяБаза = Параметры.ПравоваяБаза;
		ОткрытоОбработчиком = Истина;
	КонецЕсли;
КонецПроцедуры



