
&НаКлиенте
Процедура Сформировать(Команда)
	ТаблицаОтчета = СформироватьНаСервере(ПериодОтчета, СписокПодразделений);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьНаСервере(ПериодОтчета, СписокПодразделений)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Отчеты.ОтчетПоПродажам.ПолучитьМакет("Макет");
	ОбластьЗаголовок =  Макет.ПолучитьОбласть("Заголовок");
	ОбластьНаименованиеПоказателя = Макет.ПолучитьОбласть("НаименованиеПоказателя");
	ОбластьМесяц = Макет.ПолучитьОбласть("МесяцСтрока | МесяцКолонка");
	ОбластьМесяцЗначение = Макет.ПолучитьОбласть("МесяцСтрокаЗначение | МесяцКолонка");
	ОбластьГод = Макет.ПолучитьОбласть("ГодСтрока | ГодКолонка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УправленческийОбороты.Период КАК Период,
		|	УправленческийОбороты.Субконто1 КАК Показатель,
		|	СУММА(ЕСТЬNULL(УправленческийОбороты.СуммаОборот, 0)) КАК Значение
		|ИЗ
		|	РегистрБухгалтерии.Управленческий.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПоказателиСотрудника), , , , ) КАК УправленческийОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	УправленческийОбороты.Период,
		|	УправленческийОбороты.Субконто1
		|
		|УПОРЯДОЧИТЬ ПО
		|	Показатель,
		|	Период
		|ИТОГИ ПО
		|	Показатель,
		|	Период ПЕРИОДАМИ(МЕСЯЦ, &ДатаНачала, &ДатаОкончания)";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодОтчета.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПоказатель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Показатель" ,"ВСЕ");
	
	ЗаголовокВыведен = Ложь;
		
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Пока ВыборкаПоказатель.Следующий() Цикл
		
		ПроверочнаяДата = Формат('00010101', "ДФ=гггг");
		ОбластьНаименованиеПоказателя.Параметры.НаименованиеПоказателя = ВыборкаПоказатель.Показатель;
		ТабДок.Вывести(ОбластьНаименованиеПоказателя);
		
		ВыборкаДата = ВыборкаПоказатель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПЕРИОД" ,"ВСЕ");
		ВыводимаяОбласть = ОбластьМесяц;
		ПервыйГод = Истина;
		
		Пока ВыборкаДата.Следующий() Цикл
			
			Если ПроверочнаяДата <> Формат(ВыборкаДата.Период, "ДФ=гггг") Тогда
				
				ОбластьГод.Параметры.Год = ВыборкаДата.Период;
				ПроверочнаяДата = Формат(ВыборкаДата.Период, "ДФ=гггг");
				ТабДок.Вывести(ОбластьГод);
				Если НЕ ПервыйГод Тогда 
					ВыводимаяОбласть = ОбластьМесяцЗначение;
				КонецЕсли;
				ПервыйГод = Ложь;
			КонецЕсли;
			
			Если ВыводимаяОбласть = ОбластьМесяц Тогда
				ВыводимаяОбласть.Параметры.Месяц = ВыборкаДата.Период;
			КонецЕсли;
			ВыводимаяОбласть.Параметры.ЗначениеПоказателя = ВыборкаДата.Значение;
			ТабДок.Присоединить(ВыводимаяОбласть);
			
		КонецЦикла;
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура СписокПодразделенийНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ОригинальныйСписок", СписокПодразделений);
	ОткрытьФорму("Справочник.Подразделения.Форма.ФормаВыбораНескольких", ПараметрыФормы, ЭтаФорма, Неопределено, Неопределено, Неопределено, Неопределено, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	СписокПодразделений = ВыбранноеЗначение;
КонецПроцедуры
