
&НаКлиенте
Процедура ИзделиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НашаСтрока = Детали.НайтиСтроки(Новый Структура("Элемент", ЭтаФорма.ТекущийЭлемент.Имя));
	ЕстьСтрока = НашаСтрока.Количество() = 1;
	
	Если ЕстьСтрока Тогда
		Элементы.Детали.ТекущаяСтрока = Детали.Индекс(НашаСтрока[0]);
		УстановитьОграничения(НашаСтрока[0]);
	Иначе
		Элементы.Детали.ТекущаяСтрока = Неопределено;
	КонецЕсли;
	
	УстановитьДоступность(ЕстьСтрока);
	ТекущийЭлементИзделия = ЭтаФорма.ТекущийЭлемент.Заголовок;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборИзделия(Команда)
	
	Изделие = ОткрытьФормуМодально("Справочник.КаталогИзделий.ФормаВыбора", , ЭтаФорма);
	
	ЭлементИзделия = ЭтаФорма.ТекущийЭлемент.Имя;
	
	СтруктураИзделия = ПолучитьСтруктуруИзделия(Изделие, РабочийКаталог);
	
	НашаСтрока = Детали.НайтиСтроки(Новый Структура("Элемент", ЭлементИзделия));
	ЕстьСтрока = НашаСтрока.Количество() = 1;
	
	Если ЕстьСтрока Тогда
		НоваяСтрока = НашаСтрока[0];
	Иначе
		НоваяСтрока = Детали.Добавить();
	КонецЕсли;
	
	НоваяСтрока.Изделие = Изделие;
	НоваяСтрока.ВысотаИзделия = СтруктураИзделия.ВысотаИзделия;
	НоваяСтрока.ШиринаИзделия = СтруктураИзделия.ШиринаИзделия;
	НоваяСтрока.ГлубинаИзделия = СтруктураИзделия.ГлубинаИзделия;
	НоваяСтрока.ВысотаИзделияМин = СтруктураИзделия.ВысотаИзделияМин;
	НоваяСтрока.ШиринаИзделияМин = СтруктураИзделия.ШиринаИзделияМин;
	НоваяСтрока.ГлубинаИзделияМин = СтруктураИзделия.ГлубинаИзделияМин;
	НоваяСтрока.ВысотаИзделияМакс = СтруктураИзделия.ВысотаИзделияМакс;
	НоваяСтрока.ШиринаИзделияМакс = СтруктураИзделия.ШиринаИзделияМакс;
	НоваяСтрока.ГлубинаИзделияМакс = СтруктураИзделия.ГлубинаИзделияМакс;
	НоваяСтрока.Элемент = ЭлементИзделия;
	
	УстановитьОграничения(НоваяСтрока);
	УстановитьДоступность(Истина);
	
	ОтобразитьКартинку(СтруктураИзделия.АдресЭлемента, ЭлементИзделия);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничения(СтрокаИзделия)
	
	Элементы.ГлубинаИзделия.Подсказка = Строка(СтрокаИзделия.ГлубинаИзделияМин) + " - " + Строка(СтрокаИзделия.ГлубинаИзделияМакс);
	Элементы.ГлубинаИзделия.МаксимальноеЗначение = СтрокаИзделия.ГлубинаИзделияМакс;
	Элементы.ГлубинаИзделия.МинимальноеЗначение = СтрокаИзделия.ГлубинаИзделияМин;
	Элементы.ШиринаИзделия.Подсказка = Строка(СтрокаИзделия.ШиринаИзделияМин) + " - " + Строка(СтрокаИзделия.ШиринаИзделияМакс);
	Элементы.ШиринаИзделия.МаксимальноеЗначение = СтрокаИзделия.ШиринаИзделияМакс;
	Элементы.ШиринаИзделия.МинимальноеЗначение = СтрокаИзделия.ШиринаИзделияМин;
	Элементы.ВысотаИзделия.Подсказка = Строка(СтрокаИзделия.ВысотаИзделияМин) + " - " + Строка(СтрокаИзделия.ВысотаИзделияМакс);
	Элементы.ВысотаИзделия.МаксимальноеЗначение = СтрокаИзделия.ВысотаИзделияМакс;
	Элементы.ВысотаИзделия.МинимальноеЗначение = СтрокаИзделия.ВысотаИзделияМин;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность(Флаг)
	
	Элементы.ГлубинаИзделия.Доступность = Флаг;
	Элементы.ВысотаИзделия.Доступность = Флаг;
	Элементы.ШиринаИзделия.Доступность = Флаг;
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруИзделия(Изделие, Каталог)
	
	Структура = Новый Структура;
	Структура.Вставить("АдресЭлемента", Каталог + "Изделие" + Изделие.Код);
	Структура.Вставить("ВысотаИзделия", Изделие.ВысотаИзделия);
	Структура.Вставить("ШиринаИзделия", Изделие.ШиринаИзделия);
	Структура.Вставить("ГлубинаИзделия", Изделие.ГлубинаИзделия);
	Структура.Вставить("ВысотаИзделияМин", Изделие.ВысотаИзделияМин);
	Структура.Вставить("ШиринаИзделияМин", Изделие.ШиринаИзделияМин);
	Структура.Вставить("ГлубинаИзделияМин", Изделие.ГлубинаИзделияМин);
	Структура.Вставить("ВысотаИзделияМакс", Изделие.ВысотаИзделияМакс);
	Структура.Вставить("ШиринаИзделияМакс", Изделие.ШиринаИзделияМакс);
	Структура.Вставить("ГлубинаИзделияМакс", Изделие.ГлубинаИзделияМакс);
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ОтобразитьКартинку(АдресЭлемента, ЭлементИзделия)
		
	АдресВХранилище = "";
	Если ЗначениеЗаполнено(АдресЭлемента) Тогда
		ИмяФайла = АдресЭлемента;
		ФайлИзображения = Новый Файл(ИмяФайла);
		Если ФайлИзображения.Существует() Тогда
			ПоместитьФайл(АдресВХранилище, ИмяФайла, , Ложь, ЭтаФорма.УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма[ЭлементИзделия] = АдресВХранилище;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РабочийКаталог = ФайловыеФункцииСлужебныйКлиент.ВыбратьПутьККаталогуДанныхПользователя();
	
КонецПроцедуры

&НаКлиенте
Процедура ГлубинаИзделияПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ШиринаИзделияПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВысотаИзделияПриИзменении(Элемент)
	
	
КонецПроцедуры







