
&НаКлиенте
Процедура ИзделиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НашаСтрока = Детали.НайтиСтроки(Новый Структура("Элемент", ЭтаФорма.ТекущийЭлемент.Имя));
	ЕстьСтрока = НашаСтрока.Количество() = 1;
	
	Если ЕстьСтрока Тогда
		Элементы.Детали.ТекущаяСтрока = Детали.Индекс(НашаСтрока[0]);
	Иначе
		Элементы.Детали.ТекущаяСтрока = Неопределено;
	КонецЕсли;
	
	ДоступностьПараметровИзделия(ЕстьСтрока);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборИзделия(Команда)
	
	Изделие = ОткрытьФормуМодально("Справочник.КаталогИзделий.ФормаВыбора", , ЭтаФорма);
	
	ЭлементИзделия = ЭтаФорма.ТекущийЭлемент.Имя;
	
	//СтруктураИзделия = ПолучитьСтруктуруИзделия(Изделие, ЭлементИзделия);
	
	НоваяСтрока = Детали.Добавить();
	НоваяСтрока.Изделие = Изделие;
	НоваяСтрока.Элемент = ЭлементИзделия;
	
	ДоступностьПараметровИзделия(Истина);
	
	//ОтобразитьКартинку();	
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	

КонецПроцедуры

&НаКлиенте
Процедура ДоступностьПараметровИзделия(Флаг)
	
	Элементы.ПараметрыИзделия.Доступность = Флаг;

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьКартинку(Изделие, ЭлементИзделия)
		
	//АдресИзделия = РабочийКаталог + "Изделие" + Изделие.Код;;
	//АдресВХранилище = "";
	//Если ЗначениеЗаполнено(АдресИзделия) Тогда
	//	ИмяФайла = АдресИзделия;
	//	ФайлИзображения = Новый Файл(ИмяФайла);
	//	Если ФайлИзображения.Существует() Тогда
	//		ПоместитьФайл(АдресВХранилище, ИмяФайла, , Ложь);
	//	КонецЕсли;
	//КонецЕсли;
	//
	//ЭтаФорма[ЭлементИзделия] = АдресВХранилище;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РабочийКаталог = ФайловыеФункцииСлужебныйКлиент.ВыбратьПутьККаталогуДанныхПользователя();
	
КонецПроцедуры







