
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		
		Элементы.СтраницаSMART.Видимость = Ложь;
		Элементы.ВАрхив.Видимость = Ложь;
		Элементы.Подразделение.Видимость = Ложь;

	КонецЕсли;
	
	Активные.Параметры.УстановитьЗначениеПараметра("Пользователь", ТПользователь);
	Активные.Параметры.УстановитьЗначениеПараметра("Подразделение", Подразделение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	Активные.Параметры.УстановитьЗначениеПараметра("Подразделение", Подразделение);
КонецПроцедуры
