
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		
		 ДилерскийДоступ = Истина;
		 SMART.ТекстЗапроса = "";
		
	КонецЕсли;
	
	Активные.Параметры.УстановитьЗначениеПараметра("ДилерскийДоступ", ДилерскийДоступ);
	Активные.Параметры.УстановитьЗначениеПараметра("Пользователь", ТПользователь);
	
	Архив.Параметры.УстановитьЗначениеПараметра("ДилерскийДоступ", ДилерскийДоступ);
	Архив.Параметры.УстановитьЗначениеПараметра("Пользователь", ТПользователь);
	
КонецПроцедуры
