
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	ТПользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		
		Элементы.СтраницаSMART.Видимость = Ложь;
		Элементы.ВАрхив.Видимость = Ложь;
		//Элементы.Подразделение.Видимость = Ложь;

	КонецЕсли;
	
	Активные.Параметры.УстановитьЗначениеПараметра("Пользователь", ТПользователь);
	
КонецПроцедуры
