
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьАктНаСписание)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьАктНаСписание(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьАктНаСписание(ТабДок, ПараметрКоманды)
	Документы.СписаниеМатериалов.ПечатьАктНаСписание(ТабДок, ПараметрКоманды);
КонецПроцедуры
