
&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата() - 8 * 86400));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбзвонДоговоровСписокДоговоров.Договор,
	|	ОбзвонДоговоровСписокДоговоров.Клиент КАК Клиент,
	|	ОбзвонДоговоровСписокДоговоров.Телефон,
	|	ОбзвонДоговоровСписокДоговоров.ОбщийКомментарий,
	|	ОбзвонДоговоровСписокДоговоров.Клиент.Фамилия КАК Фамилия,
	|	МАКСИМУМ(ОбзвонДоговоровСписокДоговоров.Ссылка.Дата) КАК ДатаЗвонка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбзвонДоговоровСписокДоговоров.Ссылка.Дата) КАК КоличествоПерезвонить
	|ПОМЕСТИТЬ ВТ_Перезвон
	|ИЗ
	|	Документ.ОбзвонДоговоров.СписокДоговоров КАК ОбзвонДоговоровСписокДоговоров
	|ГДЕ
	|	ОбзвонДоговоровСписокДоговоров.ОбщаяОценка = ЗНАЧЕНИЕ(Перечисление.Оценки.Перезвонить)
	|	И НЕ ОбзвонДоговоровСписокДоговоров.Договор В
	|				(ВЫБРАТЬ
	|					Дозвон.Договор
	|				ИЗ
	|					Документ.ОбзвонДоговоров.СписокДоговоров КАК Дозвон
	|				ГДЕ
	|					ОбзвонДоговоровСписокДоговоров.ОбщаяОценка <> ЗНАЧЕНИЕ(Перечисление.Оценки.Перезвонить))
	|	И ОбзвонДоговоровСписокДоговоров.Ссылка <> &Ссылка
	|	И НЕ ОбзвонДоговоровСписокДоговоров.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбзвонДоговоровСписокДоговоров.Клиент,
	|	ОбзвонДоговоровСписокДоговоров.Договор,
	|	ОбзвонДоговоровСписокДоговоров.Телефон,
	|	ОбзвонДоговоровСписокДоговоров.ОбщийКомментарий,
	|	ОбзвонДоговоровСписокДоговоров.Клиент.Фамилия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Перезвон.Договор,
	|	ВТ_Перезвон.Клиент,
	|	ВТ_Перезвон.Договор.Спецификация.АдресМонтажа КАК Адрес,
	|	ВТ_Перезвон.Телефон,
	|	ВТ_Перезвон.ОбщийКомментарий,
	|	ВТ_Перезвон.Фамилия,
	|	""Дизайн"" КАК ПодсказкаДизайн,
	|	""Замер"" КАК ПодсказкаЗамер,
	|	""Монтаж"" КАК ПодсказкаМонтаж,
	|	""Доставка"" КАК ПодсказкаДоставка,
	|	ВТ_Перезвон.ДатаЗвонка,
	|	ВТ_Перезвон.Договор.Офис КАК Офис,
	|	"""" КАК ПакетУслуг,
	|	ВТ_Перезвон.Договор.Представление КАК ПредставлениеДоговора
	|ИЗ
	|	ВТ_Перезвон КАК ВТ_Перезвон
	|ГДЕ
	|	ВТ_Перезвон.КоличествоПерезвонить < 2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	докДоговор.Ссылка,
	|	докДоговор.Контрагент,
	|	докДоговор.Спецификация.АдресМонтажа,
	|	докДоговор.Контрагент.Телефон + "", "" + докДоговор.Контрагент.ТелефонДополнительный,
	|	докДоговор.Спецификация.Изделие.Наименование,
	|	докДоговор.Контрагент.Фамилия,
	|	""Дизайн"",
	|	""Замер"",
	|	""Монтаж"",
	|	""Доставка"",
	|	NULL,
	|	докДоговор.Офис,
	|	докДоговор.Спецификация.ПакетУслуг,
	|	докДоговор.Представление
	|ИЗ
	|	Документ.Договор КАК докДоговор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбзвонДоговоров.СписокДоговоров КАК ОбзвонДоговоровСписокДоговоров
	|		ПО (ОбзвонДоговоровСписокДоговоров.Договор = докДоговор.Ссылка)
	|ГДЕ
	|	ОбзвонДоговоровСписокДоговоров.Договор ЕСТЬ NULL 
	|	И докДоговор.ВидОплатыДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыОплатыДоговоров.ВводОстатков)
	|	И докДоговор.Дата >= ДАТАВРЕМЯ(2013, 10, 1, 0, 0, 0)
	|	И докДоговор.Проведен
	|	И докДоговор.Спецификация.ДатаОтгрузки <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Перезвон.Фамилия";
	
	ТаблицаДоговоров = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из ТаблицаДоговоров Цикл
		
		Если ЗначениеЗаполнено(Строка.ПакетУслуг) Тогда
			Строка.ОбщийКомментарий = Строка.ОбщийКомментарий + " (" + Строка(Строка.ПакетУслуг) + ")";
		КонецЕсли;
		
		Строка.ПредставлениеДоговора = Строка.ПредставлениеДоговора + " (" + Строка.Офис + ")";
		
	КонецЦикла;
	
	Объект.СписокДоговоров.Загрузить(ТаблицаДоговоров);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СписокДоговоровЗаполнить.Доступность = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	ЗаполнитьПоля();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.СписокДоговоровЗаполнить.Доступность = НЕ ЗначениеЗаполнено(Объект.Проведен);
	ЗаполнитьПоля();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоля()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДоговоров", Объект.СписокДоговоров.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДоговоров.Договор
	|ПОМЕСТИТЬ ТаблицаДоговоров
	|ИЗ
	|	&ТаблицаДоговоров КАК ТаблицаДоговоров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДоговоров.Договор,
	|	ОбзвонДоговоровСписокДоговоров.Ссылка.Дата,
	|	ОбзвонДоговоровСписокДоговоров.Договор.Спецификация.ДатаМонтажа КАК ДатаМонтажа
	|ИЗ
	|	ТаблицаДоговоров КАК ТаблицаДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбзвонДоговоров.СписокДоговоров КАК ОбзвонДоговоровСписокДоговоров
	|		ПО ТаблицаДоговоров.Договор = ОбзвонДоговоровСписокДоговоров.Договор
	|ГДЕ
	|	ОбзвонДоговоровСписокДоговоров.Ссылка <> &Ссылка
	|	И НЕ ОбзвонДоговоровСписокДоговоров.Ссылка.ПометкаУдаления";
		
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если Объект.СписокДоговоров.Количество() > 0 Тогда
		Для Каждого Строка Из Объект.СписокДоговоров Цикл
			
			Строка.ПодсказкаДизайн = "Дизайн";
			Строка.ПодсказкаЗамер = "Замер";
			Строка.ПодсказкаМонтаж = "Монтаж";
			Строка.ПодсказкаДоставка = "Доставка";
			
			НайденнаяСтрока = ТЗ.Найти(Строка.Договор);
			Если НайденнаяСтрока <> Неопределено Тогда
				Строка.ДатаЗвонка = НайденнаяСтрока.Дата;
			КонецЕсли;
	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровПередУдалением(Элемент, Отказ)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Текст = "Удалить обзвон по данному договору?";
	
	Если Объект.СписокДоговоров.Количество() > 0 
		И Вопрос(Текст, Режим, 0) = КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры
