
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата() + 7 * 86400));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	докДоговор.Ссылка КАК Договор,
	|	докДоговор.Контрагент КАК Клиент,
	|	докДоговор.Спецификация.АдресМонтажа КАК Адрес,
	|	докДоговор.Контрагент.Телефон + "", "" + докДоговор.Контрагент.ТелефонДополнительный КАК Телефон,
	|	""Дизайн"" КАК ПодсказкаДизайн,
	|	""Замер"" КАК ПодсказкаЗамер,
	|	""Монтаж"" КАК ПодсказкаМонтаж,
	|	""Доставка"" КАК ПодсказкаДоставка
	|ИЗ
	|	Документ.Договор КАК докДоговор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбзвонДоговоров.СписокДоговоров КАК ОбзвонДоговоровСписокДоговоров
	|		ПО (ОбзвонДоговоровСписокДоговоров.Договор = докДоговор.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусСпецификации.СрезПоследних КАК СтатусСпецификацииСрезПоследних
	|		ПО докДоговор.Спецификация = СтатусСпецификацииСрезПоследних.Спецификация
	|ГДЕ
	|	ОбзвонДоговоровСписокДоговоров.Договор ЕСТЬ NULL 
	|	И СтатусСпецификацииСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификации.Установлен)
	|	И СтатусСпецификацииСрезПоследних.Период >= &Период";
	
	Объект.СписокДоговоров.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.СписокДоговоров.Количество() > 0 Тогда
		Для Каждого Строка Из Объект.СписокДоговоров Цикл
			
			Строка.ПодсказкаДизайн = "Дизайн";
			Строка.ПодсказкаЗамер = "Замер";
			Строка.ПодсказкаМонтаж = "Монтаж";
			Строка.ПодсказкаДоставка = "Доставка";
			
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Объект.СписокДоговоров.Количество() > 0 Тогда
		Для Каждого Строка Из Объект.СписокДоговоров Цикл
			
			Строка.ПодсказкаДизайн = "Дизайн";
			Строка.ПодсказкаЗамер = "Замер";
			Строка.ПодсказкаМонтаж = "Монтаж";
			Строка.ПодсказкаДоставка = "Доставка";
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
