
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата() - 8 * 86400));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбзвонДоговоровСписокДоговоров.Договор,
	|	ОбзвонДоговоровСписокДоговоров.Клиент КАК Клиент,
	|	ОбзвонДоговоровСписокДоговоров.Адрес,
	|	ОбзвонДоговоровСписокДоговоров.Телефон,
	|	ОбзвонДоговоровСписокДоговоров.ОбщийКомментарий,
	|	ОбзвонДоговоровСписокДоговоров.Клиент.Фамилия КАК Фамилия,
	|	""Дизайн"" КАК ПодсказкаДизайн,
	|	""Замер"" КАК ПодсказкаЗамер,
	|	""Монтаж"" КАК ПодсказкаМонтаж,
	|	""Доставка"" КАК ПодсказкаДоставка,
	|	ОбзвонДоговоровСписокДоговоров.Ссылка.Дата КАК ДатаЗвонка
	|ИЗ
	|	Документ.ОбзвонДоговоров.СписокДоговоров КАК ОбзвонДоговоровСписокДоговоров
	|ГДЕ
	|	ПОДСТРОКА(ОбзвонДоговоровСписокДоговоров.КомментарийЗамер, 1, 50) = """"
	|	И ПОДСТРОКА(ОбзвонДоговоровСписокДоговоров.КомментарийЗамер, 1, 50) = """"
	|	И ПОДСТРОКА(ОбзвонДоговоровСписокДоговоров.КомментарийЗамер, 1, 50) = """"
	|	И ПОДСТРОКА(ОбзвонДоговоровСписокДоговоров.КомментарийЗамер, 1, 50) = """"
	|	И ОбзвонДоговоровСписокДоговоров.Ссылка <> &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	докДоговор.Ссылка,
	|	докДоговор.Контрагент,
	|	докДоговор.Спецификация.АдресМонтажа,
	|	докДоговор.Контрагент.Телефон + "", "" + докДоговор.Контрагент.ТелефонДополнительный,
	|	NULL,
	|	докДоговор.Контрагент.Фамилия,
	|	""Дизайн"",
	|	""Замер"",
	|	""Монтаж"",
	|	""Доставка"",
	|	NULL
	|ИЗ
	|	Документ.Договор КАК докДоговор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбзвонДоговоров.СписокДоговоров КАК ОбзвонДоговоровСписокДоговоров
	|		ПО (ОбзвонДоговоровСписокДоговоров.Договор = докДоговор.Ссылка)
	|ГДЕ
	|	ОбзвонДоговоровСписокДоговоров.Договор ЕСТЬ NULL 
	|	И докДоговор.ВидОплатыДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыОплатыДоговоров.ВводОстатков)
	|	И докДоговор.Дата >= ДАТАВРЕМЯ(2013, 10, 1, 0, 0, 0)
	|	И докДоговор.Проведен
	|	И докДоговор.Спецификация.ДатаОтгрузки <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Фамилия";
	
	Объект.СписокДоговоров.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СписокДоговоровЗаполнить.Доступность = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	ЗаполнитьПоля();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.СписокДоговоровЗаполнить.Доступность = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	ЗаполнитьПоля();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоля()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДоговоров", Объект.СписокДоговоров.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДоговоров.Договор
	|ПОМЕСТИТЬ ТаблицаДоговоров
	|ИЗ
	|	&ТаблицаДоговоров КАК ТаблицаДоговоров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДоговоров.Договор,
	|	ОбзвонДоговоровСписокДоговоров.Ссылка.Дата
	|ИЗ
	|	ТаблицаДоговоров КАК ТаблицаДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбзвонДоговоров.СписокДоговоров КАК ОбзвонДоговоровСписокДоговоров
	|		ПО ТаблицаДоговоров.Договор = ОбзвонДоговоровСписокДоговоров.Договор
	|ГДЕ
	|	ОбзвонДоговоровСписокДоговоров.Ссылка <> &Ссылка";
		
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если Объект.СписокДоговоров.Количество() > 0 Тогда
		Для Каждого Строка Из Объект.СписокДоговоров Цикл
			
			Строка.ПодсказкаДизайн = "Дизайн";
			Строка.ПодсказкаЗамер = "Замер";
			Строка.ПодсказкаМонтаж = "Монтаж";
			Строка.ПодсказкаДоставка = "Доставка";
			
			НайденнаяСтрока = ТЗ.Найти(Строка.Договор);
			Если НайденнаяСтрока <> Неопределено Тогда
				Строка.ДатаЗвонка = НайденнаяСтрока.Дата;
			КонецЕсли;
	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
