
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Макет = Отчеты.ДилерскийАктСверки.ПолучитьМакет("РасшифровкаОборота");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ИтогСумма = 0;
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Контрагент", Дилер.ОбъектАвторизации);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УправленческийОбороты.СуммаОборотКт КАК Приход,
	|	УправленческийОбороты.Регистратор.Дата КАК Дата,
	|	УправленческийОбороты.Регистратор КАК Документ,
	|	NULL КАК Расход
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			,
	|			Подразделение = &Подразделение
	|				И Субконто1 = &Контрагент,
	|			,
	|			) КАК УправленческийОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	УправленческийОбороты.Регистратор.Дата,
	|	УправленческийОбороты.Регистратор,
	|	УправленческийОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			,
	|			Подразделение = &Подразделение
	|				И Субконто1 = &Контрагент
	|				И Субконто2 <> НЕОПРЕДЕЛЕНО,
	|			,
	|			) КАК УправленческийОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Оборот = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		
		Если ЗначениеЗаполнено(Выборка.Приход) Тогда
			
			Оборот = Оборот + Выборка.Приход;
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.Расход) Тогда
			
			Оборот = Оборот - Выборка.Расход;
			
		КонецЕсли;
		
		ОбластьСтрока.Параметры .Оборот = Оборот;
		ТабДок.Вывести(ОбластьСтрока);
		//ИтогСумма = ИтогСумма + Выборка.Сумма;
	КонецЦикла;
	
	//ОбластьПодвал.Параметры.ИтогСумма = ИтогСумма;
	//ТабДок.Вывести(ОбластьПодвал);
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дилер = Параметры.Дилер;
	Период = Параметры.Период;
	Подразделение = Параметры.Подразделение;
	
КонецПроцедуры
