
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ГородВладелец", Параметры.ГородВладелец);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	СохранитьВыбор();
	
КонецПроцедуры

&НаКлиенте
Функция СохранитьВыбор()

	СтруктураНаселенногоПункта = Новый Структура;
	СтруктураНаселенногоПункта.Вставить("НаселенныйПункт",Элементы.Список.ТекущиеДанные.НаселенныйПункт);
	СтруктураНаселенногоПункта.Вставить("Километраж",Элементы.Список.ТекущиеДанные.Километраж);
	СтруктураНаселенногоПункта.Вставить("КодАдресногоОбъектаВКоде", Элементы.Список.ТекущиеДанные.КодАдресногоОбъектаВКоде);
	СтруктураНаселенногоПункта.Вставить("КодГородаВКоде", Элементы.Список.ТекущиеДанные.КодГородаВКоде);
	СтруктураНаселенногоПункта.Вставить("КодНаселенногоПунктаВКоде", Элементы.Список.ТекущиеДанные.КодНаселенногоПунктаВКоде);
	СтруктураНаселенногоПункта.Вставить("КодРайона", Элементы.Список.ТекущиеДанные.КодРайона);
	Закрыть(СтруктураНаселенногоПункта);

КонецФункции // СохранитьВыбор()

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СохранитьВыбор();
	
КонецПроцедуры
