////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИзменятьВТранзакции			= Параметры.ИзменятьВТранзакции;
	ОбрабатыватьРекурсивно		= Параметры.ОбрабатыватьРекурсивно;
	НастройкаПорции				= Параметры.НастройкаПорции;
	ПроцентОбъектовВПорции		= Параметры.ПроцентОбъектовВПорции;
	ЧислоОбъектовВПорции		= Параметры.ЧислоОбъектовВПорции;
	ПрерыватьПриОшибке			= Параметры.ПрерыватьПриОшибке;
	
	Если НЕ Параметры.УчитыватьИерархию Тогда
		Элементы.ОбрабатыватьГруппыРекурсивно.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЭлементыФормы();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ИзменятьВТранзакцииПриИзменении(Элемент)
	
	УстановитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменятьПорциямиПриИзменении(Элемент)
	
	УстановитьЭлементыФормы();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	Настройки = Новый Структура;
	Настройки.Вставить("ИзменятьВТранзакции",		ИзменятьВТранзакции);
	Настройки.Вставить("ОбрабатыватьРекурсивно",	ОбрабатыватьРекурсивно);
	Настройки.Вставить("НастройкаПорции",			НастройкаПорции);
	Настройки.Вставить("ПроцентОбъектовВПорции",	ПроцентОбъектовВПорции);
	Настройки.Вставить("ЧислоОбъектовВПорции",		ЧислоОбъектовВПорции);
	Настройки.Вставить("ПрерыватьПриОшибке",		ИзменятьВТранзакции Или ПрерыватьПриОшибке);
	
	Закрыть(Настройки);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьЭлементыФормы()
	
	Если ИзменятьВТранзакции Тогда
		Элементы.ГруппаПрерываниеПриОшибке.Доступность = Ложь;
	Иначе
		Элементы.ГруппаПрерываниеПриОшибке.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры
