
&НаСервере
Процедура СформироватьНаСервере(ВремяНаКлиенте)
	
	Отчеты.ОтделТехническогоКонтроля.СформироватьОтчет(ТабличныйДокумент, Отчет.Подразделение, ВремяНаКлиенте);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере(ТекущаяДата());
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	фПодразделение = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо.Подразделение;
	Отчет.Подразделение = фПодразделение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Отчет.Подразделение) Тогда
		СформироватьНаСервере(ТекущаяДата()); // ПриСозданииНаСервере нельзя, т.к. нужна клиентская дата
	КонецЕсли;
	
КонецПроцедуры