////////////////////////////////////////////////////////////////////////////////
// Подсистема "Информация при запуске"
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Вызывается при запуске конфигурации, открывает окно информации.
//
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	Параметры = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске();
	Если Параметры.Свойство("ИнформацияПриЗапуске") И Параметры.ИнформацияПриЗапуске.Показывать Тогда
		ОткрытьФорму("Обработка.ИнформацияПриЗапуске.Форма");
	КонецЕсли;
	
КонецПроцедуры
