
Функция ПолучитьСтрокуРаскроя(Ссылка) Экспорт
	
	ТолщинаПила = 5;
	
	СписокДеталей = Ссылка.СписокМатериалы.Выгрузить(,"НомерСтроки, Материал, Номенклатура, ВысотаДетали, ШиринаДетали, Количество, 
	|Идентификатор, НоменклатураДляСклеивания, НомерИзделия, СоблюдениеТекстуры, НеТорцевать, СтруктураОтверстий, Комментарий,
	|РадиусЛевоВерх, РадиусЛевоНиз, РадиусПравоВерх, РадиусПравоНиз, КривойПилСверху, КривойПилСлева, КривойПилСнизу, КривойПилСправа,      
	|ВыборМебельнойКромкиСверху, ВыборМебельнойКромкиСлева, ВыборМебельнойКромкиСнизу, ВыборМебельнойКромкиСправа");
	СписокДеталей.Колонки.Добавить("ШиринаЛиста", Новый ОписаниеТипов("Число"));
	СписокДеталей.Колонки.Добавить("ВысотаЛиста", Новый ОписаниеТипов("Число"));
	СписокДеталей.Колонки.Добавить("НомерЛиста", Новый ОписаниеТипов("Число"));
	СписокДеталей.Колонки.Добавить("КоординатаХ", Новый ОписаниеТипов("Число"));
	СписокДеталей.Колонки.Добавить("КоординатаУ", Новый ОписаниеТипов("Число"));
	СписокДеталей.Колонки.Добавить("ПоворотДетали", Новый ОписаниеТипов("Число"));
	
	СписокЯщиков = Ссылка.СписокЯщики;                            
	                                                              
	Для Каждого Элемент Из СписокЯщиков Цикл                      
		                                                          
		//ДНО ЯЩИКА                                               
		НоваяСтрока = СписокДеталей.Добавить();                   
		НоваяСтрока.Номенклатура = Элемент.ДноНоменклатура;       
		НоваяСтрока.ВысотаДетали = Элемент.ДлинаДно;              
		НоваяСтрока.ШиринаДетали = Элемент.ШиринаДно;             
		НоваяСтрока.Количество = Элемент.КоличествоЯщиков;
		НоваяСтрока.НомерИзделия = Элемент.НомерИзделия;
		НоваяСтрока.НомерСтроки = Элемент.НомерСтроки;
		НоваяСтрока.СоблюдениеТекстуры = 1;
		
		Если Элемент.ВидЯщика = Перечисления.ВидыЯщика.Обычный Тогда
			
			Если ЗначениеЗаполнено(Элемент.ДлинаРебро) Тогда
				
				//РЕБРО ЯЩИКА
				НоваяСтрока = СписокДеталей.Добавить();
				НоваяСтрока.Номенклатура = Элемент.Номенклатура;
				НоваяСтрока.ВысотаДетали = Элемент.ДлинаРебро;
				НоваяСтрока.ШиринаДетали = Элемент.ВысотаЯщика;
				НоваяСтрока.Количество = Элемент.КоличествоЯщиков;
				НоваяСтрока.НомерИзделия = Элемент.НомерИзделия;
				НоваяСтрока.НомерСтроки = Элемент.НомерСтроки;
				НоваяСтрока.СоблюдениеТекстуры = 1;	
				НоваяСтрока.ВыборМебельнойКромкиСлева = Элемент.КромкаНоменклатура;
				
			КонецЕсли;
			
			//БОКОВАЯ СТОРОНА1
			НоваяСтрока = СписокДеталей.Добавить();
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;
			НоваяСтрока.ВысотаДетали = Элемент.ШиринаБоковойСтороны;
			НоваяСтрока.ШиринаДетали = Элемент.ВысотаБоковойСтороны;
			НоваяСтрока.Количество = Элемент.КоличествоЯщиков;
			НоваяСтрока.НомерИзделия = Элемент.НомерИзделия;
			НоваяСтрока.НомерСтроки = Элемент.НомерСтроки;
			НоваяСтрока.СоблюдениеТекстуры = 1;
			НоваяСтрока.ВыборМебельнойКромкиСлева = Элемент.КромкаНоменклатура;
			
			//БОКОВАЯ СТОРОНА2
			НоваяСтрока = СписокДеталей.Добавить();
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;
			НоваяСтрока.ВысотаДетали = Элемент.ДлинаБоковойСтороны;
			НоваяСтрока.ШиринаДетали = Элемент.ВысотаБоковойСтороны;
			НоваяСтрока.Количество = Элемент.КоличествоЯщиков;
			НоваяСтрока.НомерИзделия = Элемент.НомерИзделия;
			НоваяСтрока.НомерСтроки = Элемент.НомерСтроки;
			НоваяСтрока.СоблюдениеТекстуры = 1;
			НоваяСтрока.ВыборМебельнойКромкиСверху = Элемент.КромкаНоменклатура;
			НоваяСтрока.ВыборМебельнойКромкиСнизу = Элемент.КромкаНоменклатура;
			НоваяСтрока.ВыборМебельнойКромкиСлева = Элемент.КромкаНоменклатура;
			
		Иначе
			
			//МТБОКСЫ
			НоваяСтрока = СписокДеталей.Добавить();
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;
			НоваяСтрока.ВысотаДетали = Элемент.ШиринаБоковойСтороны;
			НоваяСтрока.ШиринаДетали = Элемент.ВысотаБоковойСтороны;
			НоваяСтрока.Количество = Элемент.КоличествоЯщиков;
			НоваяСтрока.НомерИзделия = Элемент.НомерИзделия;
			НоваяСтрока.НомерСтроки = Элемент.НомерСтроки;
			НоваяСтрока.СоблюдениеТекстуры = 1;
			НоваяСтрока.ВыборМебельнойКромкиСверху = Элемент.КромкаНоменклатура;
			НоваяСтрока.ВыборМебельнойКромкиСнизу = Элемент.КромкаНоменклатура;
			НоваяСтрока.ВыборМебельнойКромкиСлева = Элемент.КромкаНоменклатура;
			НоваяСтрока.ВыборМебельнойКромкиСправа = Элемент.КромкаНоменклатура;
			
		КонецЕсли;
		
		Если Элемент.ВидФасада <> "Нет" Тогда
			Если ЗначениеЗаполнено(Элемент.ФасадНоменклатура) Тогда
				
				//ФАСАД ЯЩИКА
				НоваяСтрока = СписокДеталей.Добавить();
				НоваяСтрока.Номенклатура = Элемент.ФасадНоменклатура;
				НоваяСтрока.ВысотаДетали = Элемент.ВысотаФасад - 2 * Элемент.КромкаФасадНоменклатура.ГлубинаДетали;
				НоваяСтрока.ШиринаДетали = Элемент.ШиринаФасад - 2 * Элемент.КромкаФасадНоменклатура.ГлубинаДетали;
				НоваяСтрока.Количество = Элемент.КоличествоЯщиков;
				НоваяСтрока.НомерИзделия = Элемент.НомерИзделия;
				НоваяСтрока.НомерСтроки = Элемент.НомерСтроки;
				НоваяСтрока.СоблюдениеТекстуры = 1;
				НоваяСтрока.ВыборМебельнойКромкиСверху = Элемент.КромкаФасадНоменклатура;
				НоваяСтрока.ВыборМебельнойКромкиСнизу = Элемент.КромкаФасадНоменклатура;
				НоваяСтрока.ВыборМебельнойКромкиСлева = Элемент.КромкаФасадНоменклатура;
				НоваяСтрока.ВыборМебельнойКромкиСправа = Элемент.КромкаФасадНоменклатура;
				
			КонецЕсли;
		КонецЕсли;		
		
	КонецЦикла;
	
	
	Для Каждого Элемент Из СписокДеталей Цикл
		
		Количество = Элемент.Количество;
		Материал = Элемент.Материал;
		
		//Разбивка клееной детали 
		Если Материал = "10 ЛДСП+10 ЛДСП" ИЛИ Материал = "16 ЛДСП+10 ЛДСП" ИЛИ Материал = "16 ЛДСП+16 ЛДСП" Тогда
			
			Элемент.Материал = Неопределено;
			НоваяСтрока = СписокДеталей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
			НоваяСтрока.Номенклатура = Элемент.НоменклатураДляСклеивания;
			НоваяСтрока.ВысотаДетали = НоваяСтрока.ВысотаДетали + 10;
			НоваяСтрока.ШиринаДетали = НоваяСтрока.ШиринаДетали + 10;

		КонецЕсли;
		
		Если Количество > 1 Тогда
			//разбиваем детали
			Элемент.Количество = 1;
			Для ы = 2 По Количество Цикл
				НоваяСтрока = СписокДеталей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
			КонецЦикла;
			
		КонецЕсли;
		
		Элемент.ШиринаЛиста = Элемент.Номенклатура.ШиринаДетали;
		Элемент.ВысотаЛиста = Элемент.Номенклатура.ДлинаДетали;
		
	КонецЦикла;
	
	СписокДеталей.Сортировать("Номенклатура, ШиринаДетали Убыв");
	
	КоординатаХ = 0;
	КоординатаУ = 0;
	ШиринаПолосы = 0;
	ВысотаПолосы = 0;
	
	Для Каждого Элемент Из СписокДеталей Цикл
		
		Если Элемент.Номенклатура <> Справочники.Номенклатура.ПустаяСсылка() Тогда
			
			Элемент.ПоворотДетали = 0;
			Элемент.НомерЛиста = 1;
			
			//Заполнение начальный остаток
			МассивОстатков = СписокДеталей.НайтиСтроки(Новый Структура("Номенклатура, НомерЛиста", Справочники.Номенклатура.ПустаяСсылка(), Элемент.НомерЛиста));
			Если МассивОстатков.Количество() = 0 Тогда
				НоваяСтрока = СписокДеталей.Добавить();
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
				НоваяСтрока.Количество = 1;
				НоваяСтрока.НомерЛиста = Элемент.НомерЛиста;
				НоваяСтрока.ВысотаДетали = Элемент.ВысотаЛиста;
				НоваяСтрока.ШиринаДетали = Элемент.ШиринаЛиста;
				НоваяСтрока.ВысотаЛиста = Элемент.ВысотаЛиста;
				НоваяСтрока.ШиринаЛиста = Элемент.ШиринаЛиста;
				НоваяСтрока.КоординатаУ = 0;
				НоваяСтрока.КоординатаХ = 0;
			КонецЕсли;
			
			ШиринаПолосы = Макс(ШиринаПолосы, Элемент.ШиринаДетали);
			ВысотаПолосы = КоординатаУ + Элемент.ВысотаДетали + ТолщинаПила;
			
			Если ВысотаПолосы < Элемент.ВысотаЛиста Тогда
				Элемент.КоординатаУ = КоординатаУ;
				Элемент.КоординатаХ = КоординатаХ;
				КоординатаУ = ВысотаПолосы;
				
			Иначе
				КоординатаУ = 0;
				КоординатаХ = ШиринаПолосы + ТолщинаПила;
				ШиринаПолосы = Элемент.ШиринаДетали;
				Элемент.КоординатаУ = КоординатаУ;
				Элемент.КоординатаХ = КоординатаХ;
				КоординатаУ  = КоординатаУ + Элемент.ВысотаДетали + ТолщинаПила;
			КонецЕсли;
			
			МассивОстатков = СписокДеталей.НайтиСтроки(Новый Структура("Номенклатура, НомерЛиста", Справочники.Номенклатура.ПустаяСсылка(), Элемент.НомерЛиста));
			Для Каждого ЭлементМассива Из МассивОстатков Цикл				
				
				Если Элемент.КоординатаУ >= ЭлементМассива.КоординатаУ И Элемент.КоординатаХ >= ЭлементМассива.КоординатаХ Тогда
					ВысотаОстатка = ЭлементМассива.ВысотаДетали;
					ШиринаОстатка = ЭлементМассива.ШиринаДетали;
					СписокДеталей.Удалить(ЭлементМассива);
					
					Если ВысотаОстатка - ВысотаПолосы > 100 Тогда
						
						НоваяСтрока = СписокДеталей.Добавить();
						НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
						НоваяСтрока.Количество = 1;
						НоваяСтрока.НомерЛиста = Элемент.НомерЛиста;
						НоваяСтрока.ВысотаДетали = Элемент.ВысотаЛиста - ВысотаПолосы;
						НоваяСтрока.ШиринаДетали = Элемент.ШиринаДетали;
						НоваяСтрока.ВысотаЛиста = Элемент.ВысотаЛиста;
						НоваяСтрока.ШиринаЛиста = Элемент.ШиринаЛиста;
						НоваяСтрока.КоординатаУ = ВысотаПолосы;
						НоваяСтрока.КоординатаХ = Элемент.КоординатаХ;
						
					КонецЕсли;
					
					ШиринаПоследнегоПила = Элемент.КоординатаХ + Элемент.ШиринаДетали + ТолщинаПила;
					Если ШиринаОстатка - ШиринаПоследнегоПила > 100 Тогда
						
						НоваяСтрока = СписокДеталей.Добавить();
						НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
						НоваяСтрока.Количество = 1;
						НоваяСтрока.НомерЛиста = Элемент.НомерЛиста;
						НоваяСтрока.ВысотаДетали = ВысотаОстатка;
						НоваяСтрока.ШиринаДетали = ШиринаОстатка - ШиринаПоследнегоПила;
						НоваяСтрока.ВысотаЛиста = Элемент.ВысотаЛиста;
						НоваяСтрока.ШиринаЛиста = Элемент.ШиринаЛиста;
						НоваяСтрока.КоординатаУ = Элемент.КоординатаУ;
						НоваяСтрока.КоординатаХ = ШиринаПоследнегоПила;
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			
			
		КонецЕсли; //Элемент.Номенклатура <> Справочники.Номенклатура.ПустаяСсылка()
		
	КонецЦикла;
	
	ДанныеДляРаскроя = "";
	
	Для Каждого Элемент Из СписокДеталей Цикл
		
		Номенклатура = ?(Элемент.Номенклатура = Справочники.Номенклатура.ПустаяСсылка(), "Остаток", Элемент.Номенклатура);
		
		ДанныеДляРаскроя = ДанныеДляРаскроя 
		+ Номенклатура + "☺" // 1 - Номенклатура
		+ "" + "☺" //2 - КлеенаяНоменклатура??? 
		+ Элемент.ВысотаДетали + "☺" //3 - Высота детали
		+ Элемент.ШиринаДетали + "☺" //4 - Ширина детали
		+ "" + "☺" //5
		+ "" + "☺" //6
		+ "" + "☺" //7
		+ "" + "☺" //8
		+ "" + "☺" //9
		+ "" + "☺" //10
		+ "" + "☺" //11
		+ "" + "☺" //12
		+ "" + "☺" //13
		+ "" + "☺" //14
		+ "" + "☺" //15
		+ "" + "☺" //16
		+ Элемент.СоблюдениеТекстуры + "☺" //17 - СоблюдениеТекстуры номенклатуры
		+ "" + "☺" //18 - СоблюдениеТекстуры Клееной номенклатуры???
		+ Элемент.Количество + "☺" //19 - Количество
		+ Элемент.Комментарий + "☺" //20 - Комментарий
		+ "" + "☺" //21
		+ Элемент.ШиринаЛиста + "☺" //22 - Ширина листа раскроя
		+ Элемент.ВысотаЛиста + "☺" //23 - Высота листа раскроя
		+ Элемент.ВыборМебельнойКромкиСверху.КраткоеНаименование + "☺" //24
		+ Элемент.ВыборМебельнойКромкиСнизу.КраткоеНаименование + "☺" //25
		+ Элемент.ВыборМебельнойКромкиСлева.КраткоеНаименование + "☺" //26
		+ Элемент.ВыборМебельнойКромкиСправа.КраткоеНаименование + "☺" //27
		+ "" + "☺" //28
		+ "" + "☺" //29
		+ "" + "☺" //30
		+ "" + "☺" //31
		+ "" + "☺" //32
		+ "" + "☺" //33
		+ "" + "☺" //34
		+ "" + "☺" //35
		+ "" + "☺" //36
		+ "" + "☺" //37
		+ Элемент.НомерЛиста + "☺" //38 - Номер листа
		+ Элемент.КоординатаУ + "☺" //39 - координата по у
		+ Элемент.КоординатаХ + "☺" //40 - координата по х
		+ Элемент.ПоворотДетали + "☺" //41 - признак поворота детали
		+ "☻";
				
	КонецЦикла;
	
	Возврат ДанныеДляРаскроя;
	
КонецФункции // ПолучитьСтрокуРаскроя()

