
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда	
		Период.Вариант = ВариантСтандартногоПериода.ЭтотГод;	
	КонецЕсли;
	
	Ошибки = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		ПолеОшибки = "Контрагент";
		Текст = "Заполните поле: Контрагент";
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПолеОшибки, Текст);		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		ПолеОшибки = "Подразделение";
		Текст = "Заполните поле: Подразделение";
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПолеОшибки, Текст);		
	КонецЕсли;
	
	Если Ошибки <> Неопределено Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		Возврат;		
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	
	ПараметрыОтчета.Вставить("Период", Период);
	ПараметрыОтчета.Вставить("Контрагент", Контрагент);
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("Подразделение", Подразделение);
	ПараметрыОтчета.Вставить("ЗаполнитьКонтрагента", ЗаполнитьКонтрагента);

	СформироватьНаСервере(ТабличныйДокумент, ПараметрыОтчета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьНаСервере(ТабличныйДокумент, ПараметрыОтчета)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент = Отчеты.АктСверки.СформироватьОтчет(ПараметрыОтчета);
	
КонецПроцедуры
