
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ВнешПольз = ПолучитьВнешнегоПользователя();
	Если НЕ ВнешПольз = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
	    ПараметрыФормы = Новый Структура("Ключ", ВнешПольз);
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", ПараметрыФормы);
	КонецЕсли; 
	КонецПроцедуры

&НаСервере
Функция ПолучитьВнешнегоПользователя()
	Возврат ПараметрыСеанса.ТекущийВнешнийПользователь.ОбъектАвторизации;	
КонецФункции
