
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для каждого Строка Из СписокДизайнеров Цикл
		
		СоздатьПроводку(Строка.Дизайнер, Перечисления.ВидыПоказателейСотрудников.ВыручкаПлан, Строка.Выручка);
		
	КонецЦикла;
	
	//Движения.Продажи.Записывать = Истина;
	Движения.Управленческий.Записывать = Истина;
	
КонецПроцедуры

Функция СоздатьПроводку(Сотрудник, Показатель, Значение)
	
	//Проводка = Движения.Продажи.Добавить();
	//Проводка.Подразделение = Подразделение;
	//Проводка.Период = Дата;
	//Проводка.Показатель = Показатель;
	//Проводка.Дизайнер = Сотрудник;
	//Проводка.Значение = Значение;
	
	Проводка = Движения.Управленческий.Добавить();
	Проводка.Подразделение = Подразделение;
	Проводка.Период = Дата;
	Проводка.Сумма = Значение;
	Проводка.СчетДт = ПланыСчетов.Управленческий.ПоказателиСотрудника;
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ВидыПоказателейСотрудников] = Показатель;
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ФизическиеЛица] = Сотрудник;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = СписокДизайнеров.Итог("Выручка");
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры
