
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для каждого Строка Из СписокДизайнеров Цикл
		
		СоздатьПроводку(Строка.Дизайнер, Перечисления.ВидыПоказателейСотрудников.ВыручкаПоДоговорам, Строка.ВыручкаПоДоговорам);
		СоздатьПроводку(Строка.Дизайнер, Перечисления.ВидыПоказателейСотрудников.КоличествоЗаключенныхДоговоров, Строка.КоличествоДоговоров);
		СоздатьПроводку(Строка.Дизайнер, Перечисления.ВидыПоказателейСотрудников.СтоимостьЗаключенныхДоговоров, Строка.СтоимостьЗаключенныхДоговоров);
		СоздатьПроводку(Строка.Дизайнер, Перечисления.ВидыПоказателейСотрудников.КоличествоЗамеров, Строка.КоличествоЗамеров);
		
	КонецЦикла;
	
	Движения.ПлановыеПоказателиДизайнеров.Записывать = Истина;
	
КонецПроцедуры

Функция СоздатьПроводку(Сотрудник, Показатель, Значение)
	
	Проводка = Движения.ПлановыеПоказателиДизайнеров.Добавить();
	Проводка.Подразделение = Подразделение;
	Проводка.Период = Дата;
	Проводка.Показатель = Показатель;
	Проводка.Дизайнер = Сотрудник;
	Проводка.Значение = Значение;
	
КонецФункции
