
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Спецификация = ПараметрКоманды;
	
	Если НЕ ЗначениеЗаполнено(Спецификация) 
		ИЛИ ТипЗнч("Спецификация") <> Тип("ДокументСсылка.Спецификация") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Ошибки = РазрешеноПередатьВПроизводство(Спецификация);
	
	
	
	//УбратьПроверкуПриМодифицированности();
	//
	//ПараметрыЗаписиДокумента = ПередатьВПроизводствоНаСервере();
	//
	//Если ПараметрыЗаписиДокумента <> Неопределено Тогда
	//	
	//	ПараметрыЗаписиДокумента = ЗаписатьРисункиРаскроя(ПараметрыЗаписиДокумента);
	//	ЗаписатьСтрокуРаскроя(ПараметрыЗаписиДокумента);
	//	
	//	Если Объект.Проведен Тогда
	//		
	//		Закрыть();
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
КонецПроцедуры

Функция РазрешеноПередатьВПроизводство(СпецификацияСсылка)
	
	Ошибки = Неопределено;
	
	ТекущийСтатус = Документы.Спецификация.ПолучитьСтатусСпецификации(СпецификацияСсылка);
	
	
	Возврат Неопределено;
	
КонецФункции
