
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = Ложь;
	
	Спецификация = ПараметрКоманды;
	
	Если НЕ ЗначениеЗаполнено(Спецификация) 
		ИЛИ ТипЗнч("Спецификация") <> Тип("ДокументСсылка.Спецификация") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Ошибки = РазрешеноПередатьВПроизводство(Спецификация);
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли;
	
	//Если НЕ Объект.Дилерский И НЕ ЗначениеЗаполнено(Объект.Технолог) Тогда
	//	//Nrn. //Дилеры в производство передают сами. Тут и случается жопа
	//	Объект.Технолог = ПользователиКлиентСервер.ТекущийПользователь().ФизическоеЛицо;
	//КонецЕсли;
	
	
	
	//НачатьТранзакцию();
	//
	//ПараметрыЗаписи = Новый Структура;
	//ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	//ПараметрыЗаписи.Вставить("ПередатьВПроизводство", Истина);
	//
	//Записать(ПараметрыЗаписи);
	//
	//ЗафиксироватьТранзакцию();
	
	
	
	//Возврат ПараметрыЗаписи;
	
	//УбратьПроверкуПриМодифицированности();
	//
	//ПараметрыЗаписиДокумента = ПередатьВПроизводствоНаСервере();
	//
	//Если ПараметрыЗаписиДокумента <> Неопределено Тогда
	//	
	//	ПараметрыЗаписиДокумента = ЗаписатьРисункиРаскроя(ПараметрыЗаписиДокумента);
	//	ЗаписатьСтрокуРаскроя(ПараметрыЗаписиДокумента);
	//	
	//	Если Объект.Проведен Тогда
	//		
	//		Закрыть();
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	
КонецПроцедуры

&НаСервере
Функция РазрешеноПередатьВПроизводство(СпецификацияСсылка)
	
	Ошибки = Неопределено;
	
	ТекущийСтатус = Документы.Спецификация.ПолучитьСтатусСпецификации(СпецификацияСсылка);
	
	Свойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СпецификацияСсылка, "Дилерский, ЕстьМатериалПодЗаказ");
	
	Если Свойства.Дилерский
		И Свойства.ЕстьМатериалПодЗаказ
		И ТекущийСтатус <> Перечисления.СтатусыСпецификации.МатериалПроверен Тогда
		ТекстСообщения = "В спецификации есть материал под заказ, согласуйте с логистом";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	
	
	Возврат Ошибки;
	
КонецФункции
