
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Ошибки = Неопределено;
	Отказ = Ложь;
	
	Спецификация = ПараметрКоманды;
	
	Если НЕ ЗначениеЗаполнено(Спецификация) 
		ИЛИ ТипЗнч("Спецификация") <> Тип("ДокументСсылка.Спецификация") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РезультатПроверки = ПроверитьВозможностьРазмещения(Спецификация, Ошибки);
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	Если РезультатПроверки.СфромироватьРаскрой Тогда
		
		СвойстваРаскроя = Новый Структура;
		
		ЗаписатьРисункиРаскроя(СвойстваРаскроя, Спецификация);
		
	КонецЕсли;
	
	//Если НЕ Объект.Дилерский И НЕ ЗначениеЗаполнено(Объект.Технолог) Тогда
	//	//Nrn. //Дилеры в производство передают сами. Тут и случается жопа
	//	Объект.Технолог = ПользователиКлиентСервер.ТекущийПользователь().ФизическоеЛицо;
	//КонецЕсли;
	
	
	
	
	
	
	//НачатьТранзакцию();
	//
	//ПараметрыЗаписи = Новый Структура;
	//ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	//ПараметрыЗаписи.Вставить("ПередатьВПроизводство", Истина);
	//
	//Записать(ПараметрыЗаписи);
	//
	//ЗафиксироватьТранзакцию();
	
	
	
	
	
	
	//Возврат ПараметрыЗаписи;
	
	//УбратьПроверкуПриМодифицированности();
	//
	//ПараметрыЗаписиДокумента = ПередатьВПроизводствоНаСервере();
	//
	//Если ПараметрыЗаписиДокумента <> Неопределено Тогда
	//	
	//	ПараметрыЗаписиДокумента = ЗаписатьРисункиРаскроя(ПараметрыЗаписиДокумента);
	//	ЗаписатьСтрокуРаскроя(ПараметрыЗаписиДокумента);
	//	
	//	Если Объект.Проведен Тогда
	//		
	//		Закрыть();
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьРазмещения(СпецификацияСсылка, Ошибки)
	
	Результат = Новый Структура;
	Результат.Вставить("ВопросНаПроверку", Ложь);
	Результат.Вставить("СформироватьРаскрой", Истина);

	ТекущийСтатус = Документы.Спецификация.ПолучитьСтатусСпецификации(СпецификацияСсылка);
	
	Свойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СпецификацияСсылка, "ЕстьМатериалПодЗаказ");
	
	Если ТекущийСтатус <> Перечисления.СтатусыСпецификации.МатериалПроверен
		И ТекущийСтатус <> Перечисления.СтатусыСпецификации.Сохранен Тогда
		
		Результат.СформироватьРаскрой = Ложь;
		
		ТекстСообщения = "Разместить спецификацию можно только со статусами 'Сохранен' и 'Материал проверен' . У %1 статус '%2'";
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СпецификацияСсылка, ТекущийСтатус);
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, СпецификацияСсылка, ТекстСообщения);
		
	КонецЕсли;
	
	Если Свойства.ЕстьМатериалПодЗаказ
		И ТекущийСтатус <> Перечисления.СтатусыСпецификации.МатериалПроверен Тогда
		
		Результат.СформироватьРаскрой = Ложь;
		
		ТекстСообщения = "В %1 есть материал под заказ. Размещение без проверки материала невозможно.";
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СпецификацияСсылка);
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, СпецификацияСсылка, ТекстСообщения);
		
		Результат.ВопросНаПроверку = ТекущийСтатус = ТекущийСтатус = Перечисления.СтатусыСпецификации.Сохранен;
		
	КонецЕсли;
	
	
	Если Результат.СфромироватьРаскрой Тогда
		
		//СпецификацияСсылка = Документы.Спецификация.НайтиПоНомеру();
		
		ДокОбъект = СпецификацияСсылка.ПолучитьОбъект();
		
		Документы.Спецификация.УстановитьСтатусСпецификации(СпецификацияСсылка, Перечисления.СтатусыСпецификации.Размещен);
		
		// Нужно ли изменять дату документа?
		// В момент проведения проходят несколько проверок.
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Результат.СформироватьРаскрой = ДокОбъект.Проведен;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗаписатьРисункиРаскроя(СвойстваРаскроя, СпецификацияСсылка)
	
	Если ЗначениеЗаполнено(СвойстваРаскроя.СтрокаКривогоПила) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Спецификация", СпецификацияСсылка);
		ПараметрыФормы.Вставить("ХранимыйФайл", "КривойПил");
		ПараметрыФормы.Вставить("СтрокаКривогоПила", СвойстваРаскроя.СтрокаКривогоПила);
		
		Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
		
		СвойстваРаскроя.Вставить("РисунокКривогоПила", Значение);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваРаскроя.ДанныеДляРаскроя) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Спецификация", СпецификацияСсылка);
		ПараметрыФормы.Вставить("ХранимыйФайл", "НовыйРаскрой");
		ПараметрыФормы.Вставить("СтрокаНовогоРаскрояЛДСП", СвойстваРаскроя.ДанныеДляРаскроя);
		ПараметрыФормы.Вставить("ВидОтображения", "1");
		
		Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
		
		СвойстваРаскроя.Вставить("РисунокРаскроя", Значение);
		
	КонецЕсли;
	
КонецФункции
