
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СвободныеМонтажники.Записывать = Истина;
	Для Каждого ТекСтрокаТабель Из Табель Цикл
		Движение = Движения.СвободныеМонтажники.Добавить();
		Движение.Город = Город;
		Движение.Период = ТекСтрокаТабель.День;
		Движение.КоличествоМонтажников = ТекСтрокаТабель.КоличествоМонтажников;
	КонецЦикла;
	
	Движения.РабочиеДниМонтажников.Записывать = Истина;
	ДнейВМесяце = (КонецМесяца(Дата) - НачалоМесяца(Дата) + 1)/60/60/24;
	Месяц = Месяц(Дата);
	Год = Формат(Год(Дата),"ЧГ=0");
	Для Каждого РабочийДень Из РабочиеДни Цикл
		Для Сч = 1 По ДнейВМесяце Цикл			
			Движение = Движения.РабочиеДниМонтажников.Добавить();
			Движение.Город = Город;
			Движение.Монтажник = РабочийДень.Монтажник;
			Движение.День = Дата(Год, Месяц, Сч);
			Движение.РабочийДень = РабочийДень["День"+Сч]; 
		КонецЦикла;		
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Дата = ТекущаяДата();
	ЗаполнитьТабель(Дата);
	
КонецПроцедуры

Процедура ЗаполнитьТабель(Период) Экспорт
	
	НачалоПериода = НачалоМесяца(Период);
	ДнейВМесяце = День(КонецМесяца(Период)) - 1;
	
	Для ы = 0 По ДнейВМесяце Цикл
		
		День = НачалоПериода + ы * 86400;
		НоваяСтрока = Табель.Добавить();
		НоваяСтрока.День = День;
		
		Если ДеньНедели(НоваяСтрока.День) = 7 Тогда
			КоличествоМонтажников = 0;
		Иначе
			КоличествоМонтажников = 4; // тут надо считать сколько монтажников в подразделении
		КонецЕсли;
		
		НоваяСтрока.КоличествоМонтажников = КоличествоМонтажников;
		НоваяСтрока.ДеньНедели = Формат(День, "ДФ=дддд");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Дата = НачалоМесяца(Дата);
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

