
&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	
	УстановитьПараметрыЗапроса();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Подразделение = ЛексСервер.ПолучитьЗначениеНастройкиПользователя(ПараметрыСеанса.ТекущийПользователь, ПланыВидовХарактеристик.НастройкиПользователей.Подразделение);
	Если НЕ ЗначениеЗаполнено(Подразделение) ИЛИ Подразделение.ВидПодразделения <> Перечисления.ВидыПодразделений.Производство Тогда
		Подразделение = СлучайноеПодразделение();
	КонецЕсли;
	
	УстановитьПараметрыЗапроса();
	
КонецПроцедуры

&НаСервере
Функция УстановитьПараметрыЗапроса()
	
	Список.Параметры.УстановитьЗначениеПараметра("Подразделение", Подразделение);
	Список.Параметры.УстановитьЗначениеПараметра("Регион", Подразделение.Регион);
	Список.Параметры.УстановитьЗначениеПараметра("ГруппаНоменклатуры", Группа);
	
КонецФункции

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	УстановитьПараметрыЗапроса();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СлучайноеПодразделение()
	
	// муахахахахаааха какая поебень
	
	Ссылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Подразделения.Ссылка
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|ГДЕ
	|	НЕ Подразделения.ПометкаУдаления
	|	И Подразделения.ВидПодразделения = ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Производство)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции
