
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПечатьОперативныйЗакуп(ТабДок, Ссылка) Экспорт
	
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0";
	
	Макет = Документы.ОперативныйЗакуп.ПолучитьМакет("ПечатьОперативныйЗакуп");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперативныйЗакуп.Автор,
		|	ОперативныйЗакуп.Дата,
		|	ОперативныйЗакуп.Номер,
		|	ОперативныйЗакуп.Подразделение,
		|	ОперативныйЗакуп.Коментарий,
		|	ОперативныйЗакуп.СуммаДокумента
		|ИЗ
		|	Документ.ОперативныйЗакуп КАК ОперативныйЗакуп
		|ГДЕ
		|	ОперативныйЗакуп.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОперативныйЗакупСписокНоменклатуры.НомерСтроки,
		|	ОперативныйЗакупСписокНоменклатуры.ЕдиницаИзмерения,
		|	ОперативныйЗакупСписокНоменклатуры.Количество,
		|	ОперативныйЗакупСписокНоменклатуры.Номенклатура,
		|	ОперативныйЗакупСписокНоменклатуры.Стоимость,
		|	ОперативныйЗакупСписокНоменклатуры.Поставщик КАК Поставщик
		|ИЗ
		|	Документ.ОперативныйЗакуп.СписокНоменклатуры КАК ОперативныйЗакупСписокНоменклатуры
		|ГДЕ
		|	ОперативныйЗакупСписокНоменклатуры.Ссылка В(&Ссылка)
		|ИТОГИ ПО
		|	Поставщик";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	МассивЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаДляШапки = МассивЗапросов[0].Выбрать();
	ВыборкаПоПоставщику = МассивЗапросов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ОперативныйЗакуп.Автор,
	//|	ОперативныйЗакуп.Дата,
	//|	ОперативныйЗакуп.Коментарий,
	//|	ОперативныйЗакуп.Номер,
	//|	ОперативныйЗакуп.Подразделение,
	//|	ОперативныйЗакуп.СуммаДокумента,
	//|	ОперативныйЗакуп.СписокНоменклатуры.(
	//|		НомерСтроки,
	//|		Номенклатура,
	//|		ЕдиницаИзмерения,
	//|		Количество,
	//|		Стоимость,
	//|		Поставщик КАК Поставщик
	//|	)
	//|ИЗ
	//|	Документ.ОперативныйЗакуп КАК ОперативныйЗакуп
	//|ГДЕ
	//|	ОперативныйЗакуп.Ссылка В(&Ссылка)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Поставщик";
	//Запрос.Параметры.Вставить("Ссылка", Ссылка);
	//Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокНоменклатурыШапка = Макет.ПолучитьОбласть("СписокНоменклатурыШапка");
	ОбластьСписокНоменклатуры = Макет.ПолучитьОбласть("СписокНоменклатуры");
	ОбластьКонтрагент = Макет.ПолучитьОбласть("Контрагент");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	//Пока Выборка.Следующий() Цикл
	//	Если ВставлятьРазделительСтраниц Тогда
	//		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	
	//	ТабДок.Вывести(ОбластьЗаголовок);
	//	
	//	Шапка.Параметры.Заполнить(Выборка);
	//	ТабДок.Вывести(Шапка, Выборка.Уровень());
	//	
	//	ТабДок.Вывести(ОбластьСписокНоменклатурыШапка);
	//	ВыборкаСписокНоменклатуры = Выборка.СписокНоменклатуры.Выбрать();
	//	Пока ВыборкаСписокНоменклатуры.Следующий() Цикл
	//		
	//		
	//		ОбластьСписокНоменклатуры.Параметры.Заполнить(ВыборкаСписокНоменклатуры);
	//		ТабДок.Вывести(ОбластьСписокНоменклатуры, ВыборкаСписокНоменклатуры.Уровень());
	//	КонецЦикла;
	//	
	//	Подвал.Параметры.ИтогСтоимость = Выборка.СуммаДокумента;
	//	Подвал.Параметры.ИтогСтоимостьПрописью = ЧислоПрописью(Выборка.СуммаДокумента, ФормСтрока, ПарПредмета);
	//	
	//	ТабДок.Вывести(Подвал, ВыборкаСписокНоменклатуры.Уровень());
	//	
	//	ВставлятьРазделительСтраниц = Истина;
	//КонецЦикла;
	ВыборкаДляШапки.Следующий();
	Если ВставлятьРазделительСтраниц Тогда
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Шапка.Параметры.Заполнить(ВыборкаДляШапки);
	ТабДок.Вывести(Шапка, ВыборкаДляШапки.Уровень());
	
	Пока ВыборкаПоПоставщику.Следующий() Цикл
		
		ОбластьКонтрагент.Параметры.Поставщик = ВыборкаПоПоставщику.Поставщик;
		ТабДок.Вывести(ОбластьКонтрагент);
		ТабДок.Вывести(ОбластьСписокНоменклатурыШапка);
		ДетальнаяВыборка = ВыборкаПоПоставщику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ДетальнаяВыборка.Следующий() Цикл
			ОбластьСписокНоменклатуры.Параметры.Заполнить(ДетальнаяВыборка);
			ТабДок.Вывести(ОбластьСписокНоменклатуры, ДетальнаяВыборка.Уровень());
		КонецЦикла;
		
	КонецЦикла;
	
	Подвал.Параметры.ИтогСтоимость = ВыборкаДляШапки.СуммаДокумента;
	Подвал.Параметры.ИтогСтоимостьПрописью = ЧислоПрописью(ВыборкаДляШапки.СуммаДокумента, ФормСтрока, ПарПредмета);
	
	ТабДок.Вывести(Подвал, ДетальнаяВыборка.Уровень());
	
	ВставлятьРазделительСтраниц = Истина;
	
	
КонецПроцедуры
