
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьОперативныйЗакуп") Тогда
		ПодготовитьПечатнуюФорму("ПечатьОперативныйЗакуп", "Оперативный закуп", "Документ.ОперативныйЗакуп.ПечатьОперативныйЗакуп",
		МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	Если ИмяМакета = "ПечатьОперативныйЗакуп" Тогда
		ТабДок = ПечатьОперативныйЗакуп(МассивОбъектов, ОбъектыПечати);
	КонецЕсли;
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
	ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
	
КонецПроцедуры

Функция ПечатьОперативныйЗакуп(Документ, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ОперативныйЗакуп";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Список.Ссылка КАК Ссылка,
	|	Список.Поставщик КАК Поставщик,
	|	Список.Номенклатура КАК Номенклатура,
	|	Список.Номенклатура.Наименование КАК Наименование,
	|	Список.Номенклатура.Код КАК НоменклатураКод,
	|	Список.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Список.КоличествоАвансовый КАК Количество,
	|	Список.Цена КАК ПлановаяЦена,
	|	NULL КАК Спецификация,
	|	ЛОЖЬ КАК ПодЗаказ,
	|   NULL КАК Комментарий
	|ПОМЕСТИТЬ вТаб
	|ИЗ
	|	Документ.ОперативныйЗакуп.СписокНоменклатуры КАК Список
	|ГДЕ
	|	Список.Ссылка = &Документ
	|	И Список.КоличествоАвансовый > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Список.Ссылка,
	|	Список.Поставщик,
	|	Список.Номенклатура,
	|   Список.Номенклатура.Наименование,
	|	Список.Номенклатура.Код,
	|	Список.ЕдиницаИзмерения,
	|	Список.КоличествоКупить,
	|	Список.Цена,
	|	Список.Спецификация,
	|	ИСТИНА КАК ПодЗаказ,
	|	Список.Комментарий
	|ИЗ
	|	Документ.ОперативныйЗакуп.НоменклатураПодЗаказ КАК Список
	|ГДЕ
	|	Список.Ссылка = &Документ
	|	И Список.КоличествоКупить > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Список.Ссылка,
	|	Список.Поставщик КАК Поставщик,
	|	Список.Номенклатура,
	|	Список.НоменклатураКод,
	|	Список.ЕдиницаИзмерения,
	|	Список.Количество,
	|	Список.ПлановаяЦена,
	|	Список.Спецификация,
	|	Список.ПодЗаказ,
	|	Список.Комментарий
	|ИЗ
	|	вТаб КАК Список
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|ИТОГИ ПО
	|	Ссылка,
	|	Поставщик";	
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СписокНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
	Инд = 0;
	
	Для Каждого Ном Из СписокНоменклатуры Цикл
		
		Если ЗначениеЗаполнено(Ном) И НЕ Ном.Базовый Тогда
			
			СписокНоменклатуры[Инд] = Ном.БазоваяНоменклатура;
			
		КонецЕсли;
		
		Инд = Инд + 1;
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Подразделение", Документ.Подразделение);
	Запрос.УстановитьПараметр("НарядЗадание", Документ.НарядЗадание);
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спец.Ссылка КАК СпецификацияСсылка
	|ПОМЕСТИТЬ втСпецификации
	|ИЗ
	|	Документ.Спецификация КАК Спец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗадание.СписокСпецификаций КАК Наряд
	|		ПО Спец.Ссылка = Наряд.Спецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусСпецификации.СрезПоследних КАК СтатусСпец
	|		ПО Спец.Ссылка = СтатусСпец.Спецификация
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &НарядЗадание <> ЗНАЧЕНИЕ(Документ.НарядЗадание.ПустаяСсылка)
	|				ТОГДА Наряд.Ссылка = &НарядЗадание
	|			ИНАЧЕ СтатусСпец.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификации.Размещен), ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификации.ПереданВЦех))
	|					И Спец.Подразделение = &Подразделение
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокНом.Номенклатура КАК Номенклатура,
	|	СписокНом.Ссылка.Номер КАК Номер
	|ИЗ
	|	Документ.Спецификация.СписокНоменклатуры КАК СписокНом
	|ГДЕ
	|	СписокНом.Ссылка В
	|			(ВЫБРАТЬ
	|				т.СпецификацияСсылка
	|			ИЗ
	|				втСпецификации КАК т)
	|	И СписокНом.Номенклатура В(&СписокНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокНом.Номенклатура,
	|	СписокНом.Ссылка.Номер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер";
	
	СписокСпецификаций = Запрос.Выполнить().Выгрузить();

	ЗаполнитьПечатьОперативныйЗакуп(ТабДок, Выборка, СписокСпецификаций, Документ);
	
	Возврат ТабДок;
	
КонецФункции

Процедура ЗаполнитьПечатьОперативныйЗакуп(ТабДок, Выборка, СписокСпецификаций, Документ)
	
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0";
	
	Макет = Документы.ОперативныйЗакуп.ПолучитьМакет("ПечатьОперативныйЗакуп");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьКонтрагент = Макет.ПолучитьОбласть("Контрагент");
	ОбластьСоставШапка = Макет.ПолучитьОбласть("СоставШапка");
	ОбластьСоставСтрока = Макет.ПолучитьОбласть("СоставСтрока");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрокаПодЗаказ = Макет.ПолучитьОбласть("СтрокаПодЗаказ");
	
	Логотип = ЛексСервер.ПолучитьЛоготипПоСсылке(Документ.Подразделение.Логотип);
		
	Пока Выборка.Следующий() Цикл
		
		СуммаДокумента = 0;
		
		МассивНоменклатурыЕстьСостав = Новый Массив;
		
		ДанныеДокумента = Выборка.Ссылка;
		
		Если ТипЗнч(Логотип) = Тип("ДвоичныеДанные") Тогда
			ОбластьШапка.Рисунки.D1.Картинка = Новый Картинка(Логотип);
			ОбластьШапка.Рисунки.D1.ВыводитьНаПечать = Истина;
		КонецЕсли;
		
		ОбластьШапка.Параметры.Подразделение = ДанныеДокумента.Подразделение;
		ОбластьШапка.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ДанныеДокумента.Номер);
		ОбластьШапка.Параметры.ДатаДокумента = Формат(ДанныеДокумента.Дата, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОбластьШапка);
		
		ТабДок.Вывести(ОбластьШапкаТаблицы);
		
		НомерСтроки = 1;
		
		ВыборкаКонтрагенты = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаКонтрагенты.Следующий() Цикл
			
			ОбластьКонтрагент.Параметры.Поставщик = ВыборкаКонтрагенты.Поставщик;
			Если ЗначениеЗаполнено(ВыборкаКонтрагенты.Поставщик.ПочтовыйАдрес) Тогда
				ОбластьКонтрагент.Параметры.АдресПоставщика = ВыборкаКонтрагенты.Поставщик.ПочтовыйАдрес;
			Иначе
				ОбластьКонтрагент.Параметры.АдресПоставщика = ВыборкаКонтрагенты.Поставщик.ЮридическийАдрес;
			КонецЕсли;
				
			ТабДок.Вывести(ОбластьКонтрагент);
			
			ВыборкаНоменклатура = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				Если ВыборкаНоменклатура.ПодЗаказ Тогда
					ОбластьСтр = ОбластьСтрокаПодЗаказ;	
				Иначе
					ОбластьСтр = ОбластьСтрока;
				КонецЕсли;
				
				ОбластьСтр.Параметры.НомерСтроки = НомерСтроки;
				ОбластьСтр.Параметры.Заполнить(ВыборкаНоменклатура);
				ОбластьСтр.Параметры.НоменклатураКод = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ВыборкаНоменклатура.НоменклатураКод);
				
				Если ВыборкаНоменклатура.ПодЗаказ Тогда
					
					Если ЗначениеЗаполнено(ВыборкаНоменклатура.Комментарий) Тогда
						ОбластьСтр.Параметры.Номенклатура = Строка(ВыборкаНоменклатура.Номенклатура) + Символы.ПС + "( "+ВыборкаНоменклатура.Комментарий+" )";
					КонецЕсли;
					
					ОбластьСтр.Параметры.Спец = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ВыборкаНоменклатура.Спецификация.Номер);
				Иначе

					СтрокаСпец = "";
					Отбор = Новый Структура();
					Если ВыборкаНоменклатура.Номенклатура.Базовый Тогда
						Отбор.Вставить("Номенклатура", ВыборкаНоменклатура.Номенклатура);
					Иначе
						Отбор.Вставить("Номенклатура", ВыборкаНоменклатура.Номенклатура.БазоваяНоменклатура);
					КонецЕсли;
						
					Строки = СписокСпецификаций.НайтиСтроки(Отбор);
					
					Для Каждого Стр ИЗ Строки Цикл
						
						СтрокаСпец = СтрокаСпец + ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Стр.Номер) + Символы.ПС; 
						
					КонецЦикла;
					
					ОбластьСтр.Параметры.Спец = СтрокаСпец;
					
				КонецЕсли;
				
				ТабДок.Вывести(ОбластьСтр);
				
				СуммаДокумента = СуммаДокумента + ВыборкаНоменклатура.ПлановаяЦена * ВыборкаНоменклатура.Количество;
				НомерСтроки = НомерСтроки + 1;
				
				Если ВыборкаНоменклатура.Номенклатура.ЕстьОписаниеСостава Тогда
					МассивНоменклатурыЕстьСостав.Добавить(ВыборкаНоменклатура.Номенклатура);
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЦикла;
		
		Подвал.Параметры.ИтогСтоимость = СуммаДокумента;
		Подвал.Параметры.ИтогСтоимостьПрописью = ЧислоПрописью(СуммаДокумента, ФормСтрока, ПарПредмета);
		ТабДок.Вывести(Подвал);
		
		// Печать состава
		Если МассивНоменклатурыЕстьСостав.Количество() > 0 Тогда
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Массив", МассивНоменклатурыЕстьСостав);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	НоменклатураОписаниеСостава.Ссылка КАК Номенклатура,
			|	НоменклатураОписаниеСостава.НомерСтроки,
			|	НоменклатураОписаниеСостава.Ингридиент,
			|	НоменклатураОписаниеСостава.Количество
			|ИЗ
			|	Справочник.Номенклатура.ОписаниеСостава КАК НоменклатураОписаниеСостава
			|ГДЕ
			|	НоменклатураОписаниеСостава.Ссылка В(&Массив)
			|ИТОГИ ПО
			|	Номенклатура";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				ОбластьСоставШапка.Параметры.Номенклатура = ВыборкаНоменклатура.Номенклатура;
				ТабДок.Вывести(ОбластьСоставШапка);
				
				ВыборкаИнгридиент = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаИнгридиент.Следующий() Цикл
					ОбластьСоставСтрока.Параметры.Заполнить(ВыборкаИнгридиент);
					ТабДок.Вывести(ОбластьСоставСтрока);
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
