
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	ЗаказНеноменклатурногоМатериалаЗаполнить();
	
	
	
КонецПроцедуры

Процедура ЗаказНеноменклатурногоМатериалаЗаполнить()
	
	Для Каждого Стр ИЗ НеноменклатурныйМатериал Цикл
		
		НаборЗаписей = РегистрыСведений.ЗаказНеноменклатурногоМатериала.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Спецификация.Установить(Стр.Спецификация);
		НаборЗаписей.Отбор.Номенклатура.Установить(Стр.Номенклатура);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
			ПерваяЗапись = Истина;
		
		Иначе			
			Запись = НаборЗаписей[0];
			ПерваяЗапись = Ложь;
		КонецЕсли;
		
		Если НЕ (НЕ Стр.Заказано И ПерваяЗапись) Тогда
			Запись.Спецификация = Стр.Спецификация;
			Запись.Номенклатура = Стр.Номенклатура;
			Запись.Заказано = Стр.Заказано;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры
