Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ТабДок = ПечатьПлатежнаяВедомость(МассивОбъектов, ОбъектыПечати);
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Т53", "Т53", ТабДок,, "Документ.ВыплатаЗаработнойПлаты.Т53");
	ТабДок.АвтоМасштаб = Истина;
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Функция ПечатьПлатежнаяВедомость(Документ, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_Т53";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.КоличествоЭкземпляров = 1;
	ТабДок.Защита = Истина;
	
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	
	Макет = Документы.ВыплатаЗаработнойПлаты.ПолучитьМакет("Т53");
	
	ШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Строка = Макет.ПолучитьОбласть("Строка");
	ИтогПоЛисту = Макет.ПолучитьОбласть("ИтогПоЛисту");	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Ссылка", Документ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыплатаЗаработнойПлаты.Ссылка,
	|	ВыплатаЗаработнойПлаты.СписокФизЛиц.(
	|		Ссылка,
	|		НомерСтроки,
	|		Выплачено,
	|		Комментарий,
	|		Сотрудник,
	|		Статья
	|	)
	|ИЗ
	|	Документ.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		ШапкаДокумента.Параметры.НазваниеОрганизации = Документ.Подразделение.ОрганизацияДляФизЛиц.ПолноеНаименование;
		ШапкаДокумента.Параметры.Подразделение = Документ.Подразделение;
		ШапкаДокумента.Параметры.СуммаДок = ЧислоПрописью(Документ.СуммаДокумента, ФормСтрока, ПарПредмета);
		ШапкаДокумента.Параметры.СуммаДокРублей = Цел(Документ.СуммаДокумента);
		ШапкаДокумента.Параметры.СуммаДокКопеек = 100 * (Документ.СуммаДокумента - Цел(Документ.СуммаДокумента));
		ШапкаДокумента.Параметры.РуководительДолжность = "Директор";
		ШапкаДокумента.Параметры.Руководитель = Документ.Подразделение.Руководитель;
		ШапкаДокумента.Параметры.ГлавныйБухгалтер = Документ.Автор;
		ШапкаДокумента.Параметры.Номер = Документ.Номер;
		ШапкаДокумента.Параметры.Дата = Формат(Документ.Дата, "ДФ=dd.MM.yyyy");
		ШапкаДокумента.Параметры.Комментарий = Документ.Комментарий;
		
		ТабДок.Вывести(ШапкаДокумента);
		//ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДок.Вывести(Шапка);

		ВыборкаСтроки = Выборка.СписокФизЛиц.Выбрать();
		
		Пока ВыборкаСтроки.Следующий() Цикл
			
			Строка.Параметры.Заполнить(ВыборкаСтроки);
			ТабДок.Вывести(Строка);
			
		КонецЦикла;
		
		ИтогПоЛисту.Параметры.ИтогоНаСтранице = Документ.СуммаДокумента; 
		ТабДок.Вывести(ИтогПоЛисту);
		
		Подвал.Параметры.ВсегоВыплачено = ЧислоПрописью(Документ.СуммаДокумента, ФормСтрока, ПарПредмета);
		Подвал.Параметры.КассирДолжность = "Бухгалтер";
		Подвал.Параметры.Кассир = Документ.Автор;
		ТабДок.Вывести(Подвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Документ);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
