
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СчетКт = ?(ТипЗнч(СчетКасса) = Тип("СправочникСсылка.Кассы"), ПланыСчетов.Управленческий.Касса, ПланыСчетов.Управленческий.РасчетныйСчет);
	СчетДт = ПланыСчетов.Управленческий.ВзаиморасчетыССотрудниками;
	
	Для Каждого ТекСтрокаСписокФизЛиц Из СписокФизЛиц Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетКт = СчетКт;
		Движение.СчетДт = СчетДт;
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение;
		Движение.Сумма = ТекСтрокаСписокФизЛиц.Выплачено;
		Движение.Содержание = ТекСтрокаСписокФизЛиц.Комментарий;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ФизическиеЛица] = ТекСтрокаСписокФизЛиц.Сотрудник;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДДС] = ТекСтрокаСписокФизЛиц.Статья;
		Движение.СубконтоКт[СчетКт.ВидыСубконто[1].ВидСубконто] = СчетКасса;
	КонецЦикла;
	
	Движения.Управленческий.Записывать = Истина;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	СуммаДокумента = СписокФизЛиц.Итог("Выплачено");
	
КонецПроцедуры

