
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого ТекСтрокаСписокФизЛиц Из СписокФизЛиц Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетКт = ПланыСчетов.Управленческий.Касса;
		Движение.СчетДт = ПланыСчетов.Управленческий.ВзаиморасчетыССотрудниками;
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение;
		Движение.Сумма = ТекСтрокаСписокФизЛиц.Выплачено;
		Движение.Содержание = ТекСтрокаСписокФизЛиц.Комментарий;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ФизическиеЛица] = ТекСтрокаСписокФизЛиц.Сотрудник;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДДС] = ТекСтрокаСписокФизЛиц.Статья;
	КонецЦикла;
	
	Движения.Управленческий.Записывать = Истина;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = СписокФизЛиц.Итог("Выплачено");
	
КонецПроцедуры

