
&НаКлиенте
Процедура СписокНоменклатурыНоменклатураИсточникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.НоменклатураПолучатель = ЛексСервер.ЗначениеРеквизитаОбъекта(ТекущиеДанные.НоменклатураИсточник, "БазоваяНоменклатура");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоОтправляемоеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	КоэффициентБазовых = ЛексСервер.ЗначениеРеквизитаОбъекта(ТекущиеДанные.НоменклатураИсточник, "КоэффициентБазовых");
	ТекущиеДанные.КоличествоПолучаемое = ТекущиеДанные.КоличествоОтправляемое * КоэффициентБазовых;
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

