
&НаКлиенте
Процедура СписокНоменклатурыНоменклатураИсточникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	Базовая = ЛексСервер.ЗначениеРеквизитаОбъекта(ТекущиеДанные.НоменклатураИсточник, "БазоваяНоменклатура");
	ЗаполнитьСписокВыбораПолучатель(Базовая);
	
	ТекущиеДанные.НоменклатураПолучатель = Базовая;
	
	ЗаполнитьКоличество();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПолучатель(Номенклатура)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("БазоваяНоменклатура", Номенклатура);
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.БазоваяНоменклатура = &БазоваяНоменклатура
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЗапретИспользования";
	
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Массив.Добавить(Номенклатура);
	Элементы.СписокНоменклатурыНоменклатураПолучатель.СписокВыбора.ЗагрузитьЗначения(Массив);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоОтправляемоеПриИзменении(Элемент)
	
	ЗаполнитьКоличество();
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьКоличество()
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	КоэффициентБазовыхИсточник = ЛексСервер.ЗначениеРеквизитаОбъекта(ТекущиеДанные.НоменклатураИсточник, "КоэффициентБазовых");
	КоэффициентБазовыхПолучатель = ЛексСервер.ЗначениеРеквизитаОбъекта(ТекущиеДанные.НоменклатураПолучатель, "КоэффициентБазовых");
	ТекущиеДанные.КоличествоПолучаемое = ТекущиеДанные.КоличествоОтправляемое * КоэффициентБазовыхИсточник / КоэффициентБазовыхПолучатель;
	
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЭтаФорма.ТолькоПросмотр Тогда
		ТолькоПросмотр = ЛексСервер.ДоступностьФормыСкладскиеДокументы(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПолучательПриИзменении(Элемент)
	
	ЗаполнитьКоличество();
	
КонецПроцедуры

