
&НаКлиенте
Процедура СписокНоменклатурыНоменклатураИсточникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.НоменклатураПолучатель = ЛексСервер.ЗначениеРеквизитаОбъекта(ТекущиеДанные.НоменклатураИсточник, "БазоваяНоменклатура");
	ЗаполнитьКоличество();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоОтправляемоеПриИзменении(Элемент)
	
	ЗаполнитьКоличество();
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьКоличество()
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	КоэффициентБазовых = ЛексСервер.ЗначениеРеквизитаОбъекта(ТекущиеДанные.НоменклатураИсточник, "КоэффициентБазовых");
	ТекущиеДанные.КоличествоПолучаемое = ТекущиеДанные.КоличествоОтправляемое * КоэффициентБазовых;
	
КонецФункции


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ДатаПередачи)
	   И ЗначениеЗаполнено(ТекущийОбъект.ОтветственныйЗаХранение) Тогда
	    ТекущийОбъект.СданВАрхив = Истина;
    Иначе
	    ТекущийОбъект.СданВАрхив = Ложь;
    КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступноПринятие = ЛексСервер.ДоступноПринятиеБухгалтером(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Объект.ДатаПередачи) 
	   И ЗначениеЗаполнено(Объект.ОтветственныйЗаХранение)
	   И НЕ ДоступноПринятие Тогда
	   
	   ЭтаФорма.ТолькоПросмотр = Истина;
	   
   КонецЕсли;
	
КонецПроцедуры

