
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", ТекущийОбъект.Номенклатура);
	Запрос.УстановитьПараметр("Регион", ТекущийОбъект.Подразделение.Регион);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦеныНоменклатурыСрезПоследних.Розничная
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Регион = &Регион) КАК ЦеныНоменклатурыСрезПоследних";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если (НЕ (Результат.Количество() > 0 И Результат[0].Розничная > 0)) И Доступность Тогда
		
		Сообщить("Не удалось записать. Необходимо установить цены номенклатуры подразделения.");
		Отказ = Истина;
		
	КонецЕсли;	
	
	
КонецПроцедуры
