
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", ТекущийОбъект.Номенклатура);
	Запрос.УстановитьПараметр("Регион", ТекущийОбъект.Подразделение.Регион);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦеныНоменклатурыСрезПоследних.Розничная
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Регион = &Регион) КАК ЦеныНоменклатурыСрезПоследних";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если ТекущийОбъект.Доступность Тогда		
		Если НЕ (Результат.Количество() > 0 И Результат[0].Розничная > 0) Тогда
		
			Сообщить("Не удалось записать. Для доступной номенклатуры необходимо установить цены по подразделению.");
			Отказ = Истина;
			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
