///////////////////////////////////////////////////////////////////////////////////
// Подсистема "Пользователи в модели сервиса".
// 
///////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Открывает форму ввода пароля пользователя сервиса
//
// Параметры:
//  ПарольПользователяСервиса - Строка - пароль пользователя сервиса
//  Отказ - Булево - флаг отказа от выполнения действия
//
Процедура ЗапроситьПарольДляАутентификацииВСервисе(ПарольПользователяСервиса, Отказ) Экспорт
	
	Если ПарольПользователяСервиса <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ОткрытьФормуМодально("ОбщаяФорма.АутентификацияВСервисе");
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		ПарольПользователяСервиса = Результат;
	Иначе
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры
