
&НаКлиенте
Процедура МесяцВперед(Команда)
	
	ИзменитьПериод(1);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНазад(Команда)
	
	ИзменитьПериод(-1);
	
КонецПроцедуры

&НаКлиенте
Функция ИзменитьПериод(Направление)

	УстановленныйМесяц = Период.ДатаНачала;
	НовыйМесяц = ДобавитьМесяц(УстановленныйМесяц, Направление);
	Период.ДатаНачала = НачалоМесяца(НовыйМесяц);
	Период.ДатаОкончания = КонецМесяца(НовыйМесяц);
	ОбновитьДанныеНаСервере();

КонецФункции // ИзменитьПериод()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	ОбновитьДанныеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дизайнер = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	МассивРолей = Новый Массив;
	МассивРолей.Добавить("АдминистраторСистемы");
	РазрешитьПросмотр = Ложь;
	
	Для каждого Элемент Из МассивРолей Цикл
		
		Если РольДоступна(Элемент) Тогда
			
			РазрешитьПросмотр = Истина;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Элементы.Дизайнер.Доступность = РазрешитьПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)

	ОбновитьДанныеНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	ВидыПараметровНачислений = Перечисления.ВидыПараметровНачислений;
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ВидыПараметровНачислений.ВыплатаДизайнерамЗаКухню);
	МассивПараметров.Добавить(ВидыПараметровНачислений.ВыплатаДизайнерамЗаШкаф);
	МассивПараметров.Добавить(ВидыПараметровНачислений.ВыплатаДизайнерамЗаЗамеры);
	МассивПараметров.Добавить(ВидыПараметровНачислений.ВыплатаДизайнерамЗаПеревыполнениеПлана);
	ТаблицаПараметров = ЛексСервер.ПолучитьЗначениеПараметров(МассивПараметров, Дизайнер.Подразделение, Период.ДатаОкончания);
	
	НайденнаяСтрока = ТаблицаПараметров.Найти(ВидыПараметровНачислений.ВыплатаДизайнерамЗаКухню);
	НачислениеЗаКухню = ?(ЗначениеЗаполнено(НайденнаяСтрока), НайденнаяСтрока.Значение, 0);
	НайденнаяСтрока = ТаблицаПараметров.Найти(ВидыПараметровНачислений.ВыплатаДизайнерамЗаШкаф);
	НачислениеЗаШкаф = ?(ЗначениеЗаполнено(НайденнаяСтрока), НайденнаяСтрока.Значение, 0);;
	НайденнаяСтрока = ТаблицаПараметров.Найти(ВидыПараметровНачислений.ВыплатаДизайнерамЗаЗамеры);
	НачислениеЗамерСверхПлана = ?(ЗначениеЗаполнено(НайденнаяСтрока), НайденнаяСтрока.Значение, 0);;
	НайденнаяСтрока = ТаблицаПараметров.Найти(ВидыПараметровНачислений.ВыплатаДизайнерамЗаПеревыполнениеПлана);
	НадбавкаОтВыручки = ?(ЗначениеЗаполнено(НайденнаяСтрока), НайденнаяСтрока.Значение, 0);;
	
	Зарплата = 0;
	
	СтруктураПоказателейДизайнера = Документы.НачислениеЗаработнойПлаты.ПолучитьПоказателиДизайнера(Период.ДатаНачала, Период.ДатаОкончания, Дизайнер, Дизайнер.Подразделение);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Дизайнер", Дизайнер);
	Запрос.УстановитьПараметр("Подразделение", Дизайнер.Подразделение);
	//RonEXI edit
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Оклад
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Подразделение = &Подразделение
		|	И ФизическиеЛица.Ссылка = &Дизайнер
		|	И ФизическиеЛица.Должность = &ЗНАЧЕНИЕ(Справочник.Должности.ДизайнерКонсультант)
		|	И ФизическиеЛица.Активность";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОкладЗаМесяц = ВыборкаДетальныеЗаписи.Оклад;
		
	КонецЦикла;
	
	
	ПланЗамеров = ?(СтруктураПоказателейДизайнера.Свойство("КоличествоПлановыхЗамеров") и ЗначениеЗаполнено(СтруктураПоказателейДизайнера.КоличествоПлановыхЗамеров), СтруктураПоказателейДизайнера.КоличествоПлановыхЗамеров, 0);
	ФактЗамеров = ?(СтруктураПоказателейДизайнера.Свойство("КоличествоФактическихЗамеров") и ЗначениеЗаполнено(СтруктураПоказателейДизайнера.КоличествоФактическихЗамеров), СтруктураПоказателейДизайнера.КоличествоФактическихЗамеров, 0);
	ПланПоВыручке = ?(СтруктураПоказателейДизайнера.Свойство("ПлановаяВыручкаПоДоговорам") и ЗначениеЗаполнено(СтруктураПоказателейДизайнера.ПлановаяВыручкаПоДоговорам), СтруктураПоказателейДизайнера.ПлановаяВыручкаПоДоговорам, 0);
	ПолученоДенегПоДоговорам = ?(СтруктураПоказателейДизайнера.Свойство("ФактическаяВыручкаПоДоговорам") и ЗначениеЗаполнено(СтруктураПоказателейДизайнера.ФактическаяВыручкаПоДоговорам), СтруктураПоказателейДизайнера.ФактическаяВыручкаПоДоговорам, 0);
	КоличествоКухонь = ?(СтруктураПоказателейДизайнера.Свойство("КоличествоКухонь") и ЗначениеЗаполнено(СтруктураПоказателейДизайнера.КоличествоКухонь), СтруктураПоказателейДизайнера.КоличествоКухонь, 0);
	КоличествоШкафов = ?(СтруктураПоказателейДизайнера.Свойство("КоличествоШкафов") и ЗначениеЗаполнено(СтруктураПоказателейДизайнера.КоличествоШкафов), СтруктураПоказателейДизайнера.КоличествоШкафов, 0);
	КоличествоЗаключенныхДоговоров = ?(СтруктураПоказателейДизайнера.Свойство("КоличествоФактическиЗаключенныхДоговоров") и ЗначениеЗаполнено(СтруктураПоказателейДизайнера.КоличествоФактическиЗаключенныхДоговоров), СтруктураПоказателейДизайнера.КоличествоФактическиЗаключенныхДоговоров, 0);
	ЭффективныхЗамеров = КоличествоЗаключенныхДоговоров;
	ОплачиваемыеЗамеры = Окр(КоличествоЗаключенныхДоговоров - ПланЗамеров, 0, РежимОкругления.Окр15как10);
	ОплатаЗаЗамерыЧисло = ОплачиваемыеЗамеры * НачислениеЗамерСверхПлана;
	ОплатаЗаЗамеры = "(" + ЭффективныхЗамеров + " - " + ПланЗамеров + ") * " + НачислениеЗамерСверхПлана + " = " + ОплатаЗаЗамерыЧисло;
	
	Если ОплачиваемыеЗамеры > 0 Тогда
		
		Зарплата = Зарплата + ОплатаЗаЗамерыЧисло;
		
	КонецЕсли;
	
	НачислениеЗаИзделия = КоличествоШкафов * НачислениеЗаШкаф + КоличествоКухонь * НачислениеЗаКухню;
	Зарплата = ?(КоличествоШкафов> 0 или КоличествоКухонь >0, Зарплата + НачислениеЗаИзделия, Зарплата);
	НадбавкаЗаВидИзделия = "" + КоличествоКухонь + " * " + НачислениеЗаКухню + " + " + КоличествоШкафов + " * " + НачислениеЗаШкаф + " = " + НачислениеЗаИзделия;
	ЗаПеревыполнениеПлана = ?(ПолученоДенегПоДоговорам - ПланПоВыручке > 0, НадбавкаОтВыручки, 0);
	Зарплата = Зарплата + ЗаПеревыполнениеПлана;
	Итого = "" + ОплатаЗаЗамерыЧисло + " + " + ЗаПеревыполнениеПлана + " + " + НачислениеЗаИзделия + " = " + Зарплата;
	
	Если Зарплата < ОкладЗаМесяц Тогда
		
		Объяснение = "Сумма сдельной з.п. меньше оклада. Будет начислена сумма оклада.";
		Зарплата = ОкладЗаМесяц;
		
	ИначеЕсли Зарплата > ОкладЗаМесяц Тогда
		
		Объяснение = "Сумма сдельной з.п. больше оклада. Будет начислена сумма сдельной з.п.";
		
	Иначе
		
		Объяснение = "Сумма сдельной з.п. равна окладу. Редкий случай :) Будет начислена сумма оклада.";
		
	КонецЕсли;
	
КонецФункции
