
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		
		Для Каждого ТекСтрокаСписокНоменклатуры Из СписокНоменклатуры Цикл
			
			Движение 							= Движения.БазовыйЛимитЦеха.Добавить();
			Движение.Период 				= Дата;
			Движение.Подразделение 	= Подразделение;
			Движение.Номенклатура 		= ТекСтрокаСписокНоменклатуры.Номенклатура;
			Движение.Количество 		= ТекСтрокаСписокНоменклатуры.Количество;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Строка Из СписокНоменклатуры Цикл
			
			Движение 																										= Движения.Управленческий.Добавить();
			Движение.Подразделение 																				= Подразделение;
			Движение.Период 																							= Дата;
			Движение.СчетДт 																							= ПланыСчетов.Управленческий.РезервныйЗапасМатериалов;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склады] 			= Склад;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] 	= Строка.Номенклатура;
			Движение.КоличествоДт 																					= Строка.Количество;
			
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры