
&НаКлиенте
Процедура МесяцВперед(Команда)
	
	ИзменитьПериод(1);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНазад(Команда)
	
	ИзменитьПериод(-1);
	
КонецПроцедуры

&НаКлиенте
Функция ИзменитьПериод(Направление)

	УстановленныйМесяц = Период.ДатаНачала;
	НовыйМесяц = ДобавитьМесяц(УстановленныйМесяц, Направление);
	Период.ДатаНачала = НачалоМесяца(НовыйМесяц);
	Период.ДатаОкончания = КонецМесяца(НовыйМесяц);
	ОбновитьДанныеНаСервере();

КонецФункции // ИзменитьПериод()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Период.ДатаНачала = ТекущаяДата();
	ИзменитьПериод(0);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//	ролями такие вещи настраивать надо :(

	МассивРолей = Новый Массив;
	МассивРолей.Добавить("ТолькоПросмотр");
	МассивРолей.Добавить("ГлавныйБухгалтер");
	МассивРолей.Добавить("Администратор");
	
	Для каждого Роль Из МассивРолей Цикл
		Если РольДоступна(Роль) Тогда
			Элементы.Дизайнер.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЦикла;

	ОбновитьДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)

	ОбновитьДанныеНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Дизайнер) Тогда
		Дизайнер = ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
	КонецЕсли;
	
	ПараметрыДолжностей = РегистрыСведений.ПараметрыДолжностей.ПолучитьПоследнее(Период.ДатаНачала, Новый Структура("Подразделение", Дизайнер.Подразделение));
	
	КоличествоЗаключенныхДоговоров = ПолучитьЗначениеПоказателя(Дизайнер, Перечисления.ВидПоказателяСотрудника.КоличествоДоговоров, Период).Факт;

	УщербОтПеределок = ПолучитьЗначениеПоказателя(Дизайнер, Перечисления.ВидПоказателяСотрудника.УщербОтПеределок, Период).Факт;
	ЗаключеноДоговоров = ПолучитьЗначениеПоказателя(Дизайнер, Перечисления.ВидПоказателяСотрудника.СтоимостьДоговоров, Период);
	ПланЗаключеноДоговоров = ЗаключеноДоговоров.План;
	ФактЗаключеноДоговоров = ЗаключеноДоговоров.Факт;
	ШтрафБонус = ЛексСервер.ПолучитьСуммуБонуса(ФактЗаключеноДоговоров, ПланЗаключеноДоговоров, ПараметрыДолжностей.ШтрафБонусДизайнеру);
	
	Если ЗначениеЗаполнено(ПланЗаключеноДоговоров) Тогда
		ПроцентВыполненияПлана = "" + Окр(ФактЗаключеноДоговоров / ПланЗаключеноДоговоров * 100, 2) + "%";
	КонецЕсли;
	
	ПолученоДенегПоДоговорам = ПолучитьЗначениеПоказателя(Дизайнер, Перечисления.ВидПоказателяСотрудника.ВыручкаПоДоговорам, Период).Факт;
	ОкладЗаМесяц = ПараметрыДолжностей.ОкладДизайнера;

	ЗарплатаОтВыручки = ПараметрыДолжностей.ПроцентСОплатыДизайнер / 100 * ПолученоДенегПоДоговорам;

КонецФункции // ОбновитьДанныеНаСервере()

&НаСервереБезКонтекста
Функция ПолучитьЗначениеПоказателя(Дизайнер, Показатель, Период)

	Ответ = Новый Структура("План, Факт", 0, 0);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Дизайнер.Подразделение);
	Запрос.УстановитьПараметр("Дизайнер", Дизайнер);
	Запрос.УстановитьПараметр("Показатель", Показатель);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоказателиСотрудниковОбороты.ЗначениеОборот КАК Факт,
	|	ПоказателиСотрудниковОбороты.ПлановоеЗначениеОборот КАК План
	|ИЗ
	|	РегистрНакопления.ПоказателиСотрудников.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Показатель = &Показатель
	|				И Сотрудник = &Дизайнер
	|				И Подразделение = &Подразделение) КАК ПоказателиСотрудниковОбороты";

	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Ответ.План = Выборка.План;
		Ответ.Факт = Выборка.Факт;
	КонецЕсли;

	Возврат Ответ;

КонецФункции // ПолучитьЗначениеПоказателя()
