
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СоздатьПроводки(ПодразделениеПолучатель, Подразделение, СтатьяПолучатель, ВидДвиженияБухгалтерии.Дебет);
	СоздатьПроводки(Подразделение, ПодразделениеПолучатель, Статья, ВидДвиженияБухгалтерии.Кредит);
	
	Движения.Управленческий.Записывать = Истина;
	
КонецПроцедуры

Функция СоздатьПроводки(ИзмерениеПодразделение, СубконтоПодразделение, Статья, ДебетКредит)
	
	Проводка = Движения.Управленческий.Добавить();
	
	Проводка.Период = Дата;
	Проводка.Сумма = Сумма;
	Проводка.Подразделение = ИзмерениеПодразделение;
	
	Если ВидДвиженияБухгалтерии.Дебет = ДебетКредит Тогда
		
		Проводка.СчетДт = ПланыСчетов.Управленческий.ВзаиморасчетыСПодразделениями;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Подразделения] = СубконтоПодразделение;
		
		Проводка.СчетКт = ПланыСчетов.Управленческий.Доходы;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = Статья;
		
	ИначеЕсли ВидДвиженияБухгалтерии.Кредит = ДебетКредит Тогда
		
		Проводка.СчетКт = ПланыСчетов.Управленческий.ВзаиморасчетыСПодразделениями;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Подразделения] = СубконтоПодразделение;
		
		Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = Статья;
		
	КонецЕсли;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры
