
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ПрисоединенныеФайлы.ПриСозданииНаСервереПрисоединенныйФайл(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПерейтиКФормеФайла(Команда)
	
	ПрисоединенныеФайлыКлиент.ПерейтиКФормеПрисоединенногоФайла(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
