
Функция ВернутьЕдиницуХраненияПоУмолчанию(Номенклатура) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕдиницыХранения.Ссылка КАК ЕдиницаХранения,
	|	ЕдиницыХранения.Коэффициент КАК Коэффициент
	|ИЗ
	|	Справочник.ЕдиницыХранения КАК ЕдиницыХранения
	|ГДЕ
	|	ЕдиницыХранения.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Коэффициент";
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() 	Тогда
		Упаковка = Выборка.ЕдиницаХранения;
	Иначе
		Упаковка = Справочники.ЕдиницыХранения.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Упаковка;
	
КонецФункции

