////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Список.Отбор.Элементы.Очистить();
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ПравоеЗначение = Параметры.Отбор;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РезультатВыбора = Неопределено;
	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		РезультатВыбора = Новый Структура("КлючеваяОперация, Приоритет, ЦелевоеВремя");
		РезультатВыбора.КлючеваяОперация = ТД.Ссылка;
		РезультатВыбора.Приоритет = ТД.Приоритет;
		РезультатВыбора.ЦелевоеВремя = ТД.ЦелевоеВремя;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(РезультатВыбора);
	
КонецПроцедуры
