
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;
	//ПечатьУведомлениеОЗадолженности(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();

КонецПроцедуры

//&НаСервере
//Процедура ПечатьУведомлениеОЗадолженности(ТабДок, ПараметрКоманды)
//	Документы.Договор.ПечатьУведомлениеОЗадолженности(ТабДок, ПараметрКоманды);
//КонецПроцедуры
