
&НаКлиенте
Процедура Перенести(Команда)
	
	Данные = Новый Структура();
	Данные.Вставить("Наименование", Наименование);
	Данные.Вставить("ИНН", ИНН);
	Данные.Вставить("КПП", КПП);
	Данные.Вставить("ОГРН", ОГРН);
	Данные.Вставить("ЮридическийАдрес", ЮридическийАдрес);
	Данные.Вставить("ПочтовыйАдрес", ПочтовыйАдрес);
	Данные.Вставить("Руководитель", Руководитель);
	Данные.Вставить("ПолноеНаименование", ПолноеНаименование);
	
	ОповеститьОВыборе(Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Наименование = Параметры.Наименование;
	ИНН = Параметры.ИНН;
	КПП = Параметры.КПП;
	ОГРН = Параметры.ОГРН;
	ЮридическийАдрес = Параметры.ЮридическийАдрес;
	ПочтовыйАдрес = Параметры.ПочтовыйАдрес;
	Руководитель = Параметры.Руководитель;
	ПолноеНаименование = Параметры.ПолноеНаименование;
	
	НаименованиеСтарый = Параметры.НаименованиеСтарый;
	ИННСтарый = Параметры.ИННСтарый;
	КППСтарый = Параметры.КППСтарый;
	ОГРНСтарый = Параметры.ОГРНСтарый;
	ЮридическийАдресСтарый = Параметры.ЮридическийАдресСтарый;
	ПочтовыйАдресСтарый = Параметры.ПочтовыйАдресСтарый;
	РуководительСтарый = Параметры.РуководительСтарый;
	ПолноеНаименованиеСтарый = Параметры.ПолноеНаименованиеСтарый;
	
КонецПроцедуры
