
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата() - 5 * 86400));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	докСпецификация.Ссылка КАК Спецификация,
	|	докСпецификация.Телефон,
	|	""По сроку"" КАК ПодсказкаСрока,
	|	""По качеству"" КАК ПодсказкаКачества
	|ИЗ
	|	Документ.Спецификация КАК докСпецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Договор КАК докДоговор
	|		ПО (докДоговор.Спецификация = докСпецификация.Ссылка)
	|ГДЕ
	|	докСпецификация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ЧастноеЛицо)
	|	И докДоговор.Спецификация ЕСТЬ NULL 
	|	И докСпецификация.Изделие = ЗНАЧЕНИЕ(Справочник.Изделия.Детали)
	|	И докСпецификация.Проведен
	|	И докСпецификация.ДатаОтгрузки <= &Дата";
	
	Объект.СписокСпецификаций.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.СписокСпецификаций.Количество() > 0 Тогда
		Для Каждого Строка Из Объект.СписокСпецификаций Цикл
			
			Строка.ПодсказкаСрока = "По сроку";
			Строка.ПодсказкаКачества = "По качеству";
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Объект.СписокСпецификаций.Количество() > 0 Тогда
		Для Каждого Строка Из Объект.СписокСпецификаций Цикл
			
			Строка.ПодсказкаСрока = "Дизайн";
			Строка.ПодсказкаКачества = "Замер";
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
