
&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата() - 5 * 86400));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(докСпецификация.Ссылка) КАК Спецификация,
	|	докСпецификация.Контрагент,
	|	докСпецификация.Контрагент.Телефон + "", "" + докСпецификация.Контрагент.ТелефонДополнительный КАК Телефон,
	|	МАКСИМУМ(докСпецификация.ДатаОтгрузки) КАК ДатаОтгрузки,
	|	""Дилерский"" КАК Комментарий
	|ИЗ
	|	Документ.Спецификация КАК докСпецификация
	|ГДЕ
	|	докСпецификация.Проведен
	|	И докСпецификация.ДатаОтгрузки <= &Дата
	|	И докСпецификация.Дилерский
	|
	|СГРУППИРОВАТЬ ПО
	|	докСпецификация.Контрагент,
	|	докСпецификация.Контрагент.Телефон + "", "" + докСпецификация.Контрагент.ТелефонДополнительный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 30
	|	докСпецификация.Ссылка,
	|	NULL,
	|	докСпецификация.Телефон,
	|	докСпецификация.ДатаОтгрузки,
	|	""""
	|ИЗ
	|	Документ.Спецификация КАК докСпецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Договор КАК докДоговор
	|		ПО (докДоговор.Спецификация = докСпецификация.Ссылка)
	|ГДЕ
	|	докСпецификация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ЧастноеЛицо)
	|	И докДоговор.Спецификация ЕСТЬ NULL 
	|	И докСпецификация.Изделие = ЗНАЧЕНИЕ(Справочник.Изделия.Детали)
	|	И докСпецификация.Проведен
	|	И докСпецификация.ДатаОтгрузки <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтгрузки";
	
	ТаблицаСпецификаций = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из ТаблицаСпецификаций Цикл
		
			Строка.Комментарий = Строка.Комментарий + " (Отгрузка: " + Формат(Строка.ДатаОтгрузки, "ДФ=dd.MM.yyyy") + ")";
		
	КонецЦикла;
	
	Объект.СписокСпецификаций.Загрузить(ТаблицаСпецификаций);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСпецификацийПередУдалением(Элемент, Отказ)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Текст = "Удалить обзвон по данной спецификации?";
	
	Если Объект.СписокСпецификаций.Количество() > 0 
		И Вопрос(Текст, Режим, 0) = КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры
