
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ВернутьОтступ(Сторона)
	
	Если Сторона > 1800 Тогда
		
		Возврат 150;
		
	ИначеЕсли Сторона > 900 Тогда
		
		Возврат 120;
		
	ИначеЕсли Сторона > 600 Тогда
		
		Возврат 70;
		
	ИначеЕсли Сторона > 300 Тогда
		
		Возврат 64;
		
	ИначеЕсли Сторона > 200 Тогда
		
		Возврат 50;
		
	Иначе
		
		Возврат 45;
		
	КонецЕсли;
	
КонецФункции

Функция ВзаиморасчетыПроводки()
	
	Отказ = Ложь;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Управленческий");
	ЭлементБлокировки.УстановитьЗначение("Подразделение", Подразделение);
	ЭлементБлокировки.УстановитьЗначение("Счет", ПланыСчетов.Управленческий.ВзаиморасчетыСПокупателями);
	ЭлементБлокировки.УстановитьЗначение("Субконто1", Контрагент);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Субконто1", Контрагент);
	Если Дилерский Тогда
		Запрос.УстановитьПараметр("Субконто2", Неопределено);
	Иначе
		Запрос.УстановитьПараметр("Субконто2", Ссылка);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УправленческийОстатки.СуммаОстатокКт КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Остатки(
	|			&МоментВремени,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ВзаиморасчетыСПокупателями),
	|			,
	|			Подразделение = &Подразделение
	|				И Субконто1 = &Субконто1
	|				И Субконто2 = &Субконто2) КАК УправленческийОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТекстСообщения = "";
	Если РезультатЗапроса.Пустой() Тогда // денег нет совсем
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Отсутствует аванса у контрагента %1, для проведения спецификации необходимо %2", Контрагент, СуммаДокумента);
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОстатокПоСчету = Выборка.Сумма;
		
		Если ОстатокПоСчету < СуммаДокумента Тогда // аванс недостаточен
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Суммы аванса %1 у контрагента %2 недостаточно для проведения спецификации, необходимо %3", ОстатокПоСчету, Контрагент, СуммаДокумента);
		Иначе
			
			Если Дилерский Тогда
				Движение = Движения.Управленческий.Добавить();
				Движение.Период = Дата;
				Движение.Подразделение = Подразделение;
				Движение.СчетКт = ПланыСчетов.Управленческий.ВзаиморасчетыСПокупателями;
				Движение.СчетДт = ПланыСчетов.Управленческий.ВспомогательныйСчет;
				Движение.СубконтоКт.Контрагенты = Контрагент;
				Движение.Сумма = -СуммаДокумента;
				Движение.Содержание = "Дилер разместил Спецификацию № " + Строка(Номер);
				
				Движение = Движения.Управленческий.Добавить();
				Движение.Период = Дата;
				Движение.Подразделение = Подразделение;
				Движение.СчетКт = ПланыСчетов.Управленческий.ВзаиморасчетыСПокупателями;
				Движение.СчетДт = ПланыСчетов.Управленческий.ВспомогательныйСчет;
				Движение.СубконтоКт.Контрагенты = Контрагент;
				Движение.СубконтоКт.СпецификацияДоговор = Ссылка;
				Движение.Сумма = СуммаДокумента;
				
			КонецЕсли;
		КонецЕсли; // аванс недостаточен
	КонецЕсли; // денег нет совсем
	
	Если ТекстСообщения <> "" Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Документы.Спецификация.ПолучитьСтатусСпецификации(Ссылка)) Тогда
		
		Если Изделие = Справочники.Изделия.ШкафКупеПоКаталогу Тогда
			
			Документы.Спецификация.УстановитьСтатусСпецификации(Ссылка, Перечисления.СтатусыСпецификации.Проверен);
			
		Иначе
			
			Документы.Спецификация.УстановитьСтатусСпецификации(Ссылка, Перечисления.СтатусыСпецификации.Сохранен);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СтатусВышеРазмещен()
	
	СтатусыДляПроведения = Новый Массив;
	СтатусыДляПроведения.Добавить(Перечисления.СтатусыСпецификации.Изготовлен);
	СтатусыДляПроведения.Добавить(Перечисления.СтатусыСпецификации.Отгружен);
	СтатусыДляПроведения.Добавить(Перечисления.СтатусыСпецификации.ПереданВЦех);
	СтатусыДляПроведения.Добавить(Перечисления.СтатусыСпецификации.Размещен);
	СтатусыДляПроведения.Добавить(Перечисления.СтатусыСпецификации.Установлен);
	
	СтатусСпецификации = Документы.Спецификация.ПолучитьСтатусСпецификации(Ссылка);
	Проводить = Ложь;
	
	Для каждого Строка Из СтатусыДляПроведения Цикл
		Если СтатусСпецификации = Строка Тогда
			Проводить = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Проводить;
	
КонецФункции

Функция ПревышенЛимитНарядов()
	
	Ответ = Ложь;
	
	СтоимостьУслуг = Документы.Спецификация.ПолучитьСтоимостьУслугБезВнешних(СписокНоменклатуры.Выгрузить());
	СтруктураНорматива = Документы.Спецификация.ПолучитьСтруктуруНорматива(ДатаИзготовления, Производство);
	
	НарядВЭтойСпецификации = СтоимостьУслуг.ЗарплатаЦеха;
	
	НормативныйМаксимум = СтруктураНорматива.НормативныйМаксимум;
	НарядовНаДень = СтруктураНорматива.ОборотЗаДень;
	
	Если НарядВЭтойСпецификации <> 0 Тогда
		Если НарядВЭтойСпецификации + НарядовНаДень > НормативныйМаксимум Тогда
			Ответ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Отказ = НЕ ПроверитьЗаполнение();
	
	Производство = ЛексСервер.ПолучитьОсновноеПроизводство(Подразделение);
	
	//////////////////////////////////////////////////////////
	//ПРЕВЫШЕНИЕ ЛИМИТА
	
	Если НЕ Ссылка.Проведен И ЗначениеЗаполнено(ДатаИзготовления) И Изделие <> Справочники.Изделия.Переделка Тогда
		
		Если ПревышенЛимитНарядов() Тогда
			Отказ = Истина;
			
			ТекстСообщения = "На %1 превышен максимум нарядов на изготовление. Выберите другой день отгрузки.";
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДатаИзготовления);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "ДатаОтгрузки");
			
		КонецЕсли;
	
	КонецЕсли;
	
	//ПРЕВЫШЕНИЕ ЛИМИТА
	//////////////////////////////////////////////////////////
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВнутренняяСтоимостьСпецификации = СписокНоменклатуры.Итог("ВнутренняяСтоимость");
	СуммаНарядаСпецификации = Документы.Спецификация.ПолучитьЗарплатуЦеха(СписокНоменклатуры.Выгрузить());
	СуммаДокумента = СписокНоменклатуры.Итог("РозничнаяСтоимость");
	
	//////////////////////////////////////////////////////////////
	// Раскрой
	
	//Создаем строку раскроя ЛДСП
	
	Если ЭтотОбъект.Дилерский Тогда
		
		ПутьЛоготипа = "%РОСПИЛ%";
		
	Иначе
		
		ПутьЛоготипа = "%ЛЕКС%"
		
	КонецЕсли;
	
	ДанныеДляРаскроя = "";
	ДанныеДляРаскроя = ДанныеДляРаскроя + ПутьЛоготипа + "☻";
	ДанныеДляПередачиСтекла = "";
	ДанныеДляПередачиСтекла = ДанныеДляПередачиСтекла + ПутьЛоготипа + "☻";
	ЕстьРадиус 	= Ложь; //Для радиуса стеклянной детали
	Реквизиты 		= Новый Структура;//Массив;
	Срочность = ?(Срочный, " СРОЧНЫЙ", "");
	
	Реквизиты.Вставить("Толщина", "");
	Реквизиты.Вставить("Номенклатура", "");
	Реквизиты.Вставить("СокращенноеНом", "");
	Реквизиты.Вставить("Кант", "");
	Реквизиты.Вставить("СокрКант", "");
	Реквизиты.Вставить("ВторойКант", "");
	Реквизиты.Вставить("СокрВторойКант", "");
	Реквизиты.Вставить("Кромка045мм", "");
	Реквизиты.Вставить("Сокр045мм", "");
	Реквизиты.Вставить("Кромка2мм", "");
	Реквизиты.Вставить("Сокр2мм", "");
	Реквизиты.Вставить("АдресМонтажа", "");
	Реквизиты.Вставить("Контрагент", "");
	
	// Есть детальки -- определяем самую частую мебельную кромку
	Если ЭтотОбъект.СписокМатериалы.Количество() > 0 Тогда
		
		Реквизиты.Номенклатура = СписокМатериалы[0].Номенклатура;
		Реквизиты.СокращенноеНом = СписокМатериалы[0].Номенклатура.КраткоеНаименование;
		
		СписокНоменклатурныхГрупп = Новый СписокЗначений;
		СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Кант);
		СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Кромка045_19);
		СписокНоменклатурныхГрупп.Добавить(Справочники.НоменклатурныеГруппы.Кромка2_19);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("НоменклатурнаяГруппа", СписокНоменклатурныхГрупп);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СпецификацияСписокНоменклатуры.Номенклатура,
		|	СпецификацияСписокНоменклатуры.Номенклатура.Наименование КАК Наименование,
		|	СпецификацияСписокНоменклатуры.Номенклатура.КраткоеНаименование КАК КраткоеНаименование,
		|	КОЛИЧЕСТВО(СпецификацияСписокНоменклатуры.Номенклатура) КАК Количество,
		|	СпецификацияСписокНоменклатуры.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|ИЗ
		|	Документ.Спецификация.СписокНоменклатуры КАК СпецификацияСписокНоменклатуры
		|ГДЕ
		|	СпецификацияСписокНоменклатуры.Ссылка = &Ссылка
		|	И СпецификацияСписокНоменклатуры.Номенклатура.НоменклатурнаяГруппа В ИЕРАРХИИ(&НоменклатурнаяГруппа)
		|
		|СГРУППИРОВАТЬ ПО
		|	СпецификацияСписокНоменклатуры.Номенклатура,
		|	СпецификацияСписокНоменклатуры.Номенклатура.Наименование,
		|	СпецификацияСписокНоменклатуры.Номенклатура.КраткоеНаименование,
		|	СпецификацияСписокНоменклатуры.Номенклатура.НоменклатурнаяГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Количество УБЫВ
		|ИТОГИ ПО
		|	НоменклатурнаяГруппа";
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если Выборка.Следующий() Тогда
			
			ДетальнаяВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Если ДетальнаяВыборка.Следующий() Тогда
				
				Реквизиты.Кант 			= ДетальнаяВыборка.Наименование;
				Реквизиты.СокрКант 	= ДетальнаяВыборка.КраткоеНаименование;
				
			КонецЕсли;;
			
		КонецЕсли;
		
		Если Выборка.Следующий() Тогда
			
			ДетальнаяВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Если ДетальнаяВыборка.Следующий() Тогда
				
				Реквизиты.Кромка045мм 	= ДетальнаяВыборка.Наименование;
				Реквизиты.Сокр045мм 		= ДетальнаяВыборка.КраткоеНаименование;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Выборка.Следующий() Тогда
			
			ДетальнаяВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Если ДетальнаяВыборка.Следующий() Тогда
				
				Реквизиты.Кромка2мм 	= ДетальнаяВыборка.Наименование;
				Реквизиты.Сокр2мм 		= ДетальнаяВыборка.КраткоеНаименование;
				
			КонецЕсли;;
			
		КонецЕсли;
		
	КонецЕсли;
	//Данные завода
	ТолщинаПропила 			= 5;
	Sотхода 						= 0.150;
	ПроцентРазличияОтхода 	= 5;
	ПроцентКривойПил 		= 30;
	
	Если ЗначениеЗаполнено(Производство.ТолщинаПропила) Тогда
		
		Если Производство.ТолщинаПропила > 0 Тогда
			
			ТолщинаПропила = Производство.ТолщинаПропила;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого Элемент Из Реквизиты Цикл
		
		ДанныеДляРаскроя = ДанныеДляРаскроя + Элемент.Значение + "☺";
		
	КонецЦикла;
	
	ДанныеДляРаскроя = ДанныеДляРаскроя + Ссылка +"☺" + Строка(Номер) + Срочность + Комментарий + "☻";
	
	ДанныеДляРаскроя = ДанныеДляРаскроя + ТолщинаПропила +"☺" + Sотхода + "☺" + ПроцентРазличияОтхода + "☺" + ПроцентКривойПил+ "☺" + 0 + "☺" + 3600 + "☻";
	
	Для Каждого Строка Из ЭтотОбъект.СписокМатериалы Цикл
		
		Материал 					= Строка.Материал;
		ОсновныеРеквизиты 	= Новый Массив;
		ОбычныйФасад 			= Материал = "ФасадАГТ" ИЛИ Материал = "ФасадЛДСП" ИЛИ Материал = "ФасадМДФ" ИЛИ Материал = "ФасадАлюминиевый" ИЛИ Материал = "ФасадСтеклянный" ИЛИ Материал = "ФасадСтеклянныйЗакругленный";
		ОбычныйМатериал		= Материал = "10 ЛДСП" Или Материал = "16 ЛДСП" Или Материал = "10 ЛДСП+10 ЛДСП" Или  Материал = "16 ЛДСП+10 ЛДСП" Или 
		Материал = "16 ЛДСП+16 ЛДСП" Или Материал = "ДВП" ИЛИ Материал = "Столешница" ИЛИ Материал = "Стекло" ИЛИ Материал = "Пристенок" ИЛИ Материал = "МДФ";
		
		//Строка вида НомерСтроки/НомерИздели/ИдентификаторПоКаталогу
		СтрокаИдентификатор = Строка(Строка.НомерСтроки) + ?(ЗначениеЗаполнено(Строка.НомерИзделия), "/" + Строка.НомерИзделия, "") + ?(ЗначениеЗаполнено(Строка.Идентификатор), "/" + Строка.Идентификатор, "");
		
		Если ОбычныйМатериал Тогда
			
			ПравыйНижнийРадиус = Строка.РадиусПравоНиз;
			
			ОсновныеРеквизиты.Добавить(Строка.Номенклатура);
			ОсновныеРеквизиты.Добавить(Строка.НоменклатураДляСклеивания);
			ОсновныеРеквизиты.Добавить(Строка.ВысотаДетали);
			ОсновныеРеквизиты.Добавить(Строка.ШиринаДетали);
			ОсновныеРеквизиты.Добавить(Строка.РадиусЛевоВерх);
			ОсновныеРеквизиты.Добавить(Строка.РадиусПравоВерх);
			
			Если Строка.Срез И ПравыйНижнийРадиус > 0 Тогда
				
				ОсновныеРеквизиты.Добавить("" + ПравыйНижнийРадиус + "_1");
				
			Иначе
				
				ОсновныеРеквизиты.Добавить(ПравыйНижнийРадиус);
				
			КонецЕсли;
			
			ОсновныеРеквизиты.Добавить(Строка.РадиусЛевоНиз);
			ОсновныеРеквизиты.Добавить(Строка.КривойПилСверху);
			ОсновныеРеквизиты.Добавить(Строка.КривойПилСнизу);
			ОсновныеРеквизиты.Добавить(Строка.КривойПилСлева);
			ОсновныеРеквизиты.Добавить(Строка.КривойПилСправа);
			ОсновныеРеквизиты.Добавить(0); //Эксц1,
			ОсновныеРеквизиты.Добавить(0); //Эксц2,
			ОсновныеРеквизиты.Добавить(0); //Эксц3,
			ОсновныеРеквизиты.Добавить(0); //Эксц4,
			ОсновныеРеквизиты.Добавить(Число(Строка.СоблюдениеТекстуры));
			ОсновныеРеквизиты.Добавить(Число(Строка.СоблюдениеТекстуры));  //СоблюдениеТекстуры2
			ОсновныеРеквизиты.Добавить(Строка.Количество);
			КантПоМесту = Ложь;
			
			Если Строка.ПереключательКромкаСверху = "По месту" ИЛИ Строка.ПереключательКромкаСнизу = "По месту" ИЛИ Строка.ПереключательКромкаСлева = "По месту"
				ИЛИ Строка.ПереключательКромкаСправа = "По месту" Тогда
				
				ОсновныеРеквизиты.Добавить(Строка.Комментарий + " кант по месту");
				КантПоМесту = Истина;
				
			Иначе
				
				ОсновныеРеквизиты.Добавить(Строка.Комментарий);
				
			КонецЕсли;
			
			Надпись = ?(КантПоМесту, "Кант по месту. ", "");
			
			Если Строка.Обтачивать И Материал = "Столешница" Тогда
				
				Надпись = Надпись + "Ст (Скр)";
				
			ИначеЕсли Строка.Обтачивать И (Материал = "Стекло" ИЛИ Материал = "ФасадСтеклянный") Тогда
				
				Надпись = Надпись + "Обтачивать";
				
			ИначеЕсли НЕ Строка.Обтачивать И (Материал = "Стекло" ИЛИ Материал = "ФасадСтеклянный") Тогда
				
				Надпись = Надпись + "Без обточки";
				
			Иначе
				
				Надпись = Надпись + СтрокаИдентификатор;
				
			КонецЕсли;
			
			Если Строка.НеТорцевать Тогда
				
				Надпись = Надпись + ", НЕ ТОРЦЕВАТЬ ПО ДЛИНЕ";
				
			КонецЕсли;
			
			ОсновныеРеквизиты.Добавить(Надпись);
			ОсновныеРеквизиты.Добавить(Строка.Номенклатура.ШиринаДетали); //ШиринаПолотна,
			ОсновныеРеквизиты.Добавить(Строка.Номенклатура.ДлинаДетали); //ДлинаПолотна,
			ОсновныеРеквизиты.Добавить(Строка.ВыборМебельнойКромкиСверху.КраткоеНаименование);
			ОсновныеРеквизиты.Добавить(Строка.ВыборМебельнойКромкиСнизу.КраткоеНаименование);
			ОсновныеРеквизиты.Добавить(Строка.ВыборМебельнойКромкиСлева.КраткоеНаименование);
			ОсновныеРеквизиты.Добавить(Строка.ВыборМебельнойКромкиСправа.КраткоеНаименование);
			ОсновныеРеквизиты.Добавить(0); //Нх1,
			ОсновныеРеквизиты.Добавить(0); //Нх2,
			ОсновныеРеквизиты.Добавить(0); //Нх3,
			ОсновныеРеквизиты.Добавить(0); //Нх4,
			СтрокаОтверстий = "";
			
			ЕвропазСверху 	= 0;
			ЕвропазСнизу 	= 0;
			ЕвропазСлева 	= 0;
			ЕвропазСправа 	= 0;
			
			Если ЗначениеЗаполнено(Строка.СтруктураОтверстий) Тогда
				
				Если НЕ ЗначениеЗаполнено(Строка.Идентификатор) Тогда
					СтрокаОтверстий = ЛексСервер.ЗаполнитьРеквизитОтверстиями(СтрокаОтверстий, Строка.СтруктураОтверстий, Строка.ШиринаДетали, Строка.ВысотаДетали);
				КонецЕсли;
				СтруктураЕвропазов 	= ЛексСервер.ПолучитьСтруктуруЕвропазов(Строка.СтруктураОтверстий);
				ЕвропазСверху 			= СтруктураЕвропазов.Сверху;
				ЕвропазСнизу 			= СтруктураЕвропазов.Снизу;
				ЕвропазСлева 			= СтруктураЕвропазов.Слева;
				ЕвропазСправа 			= СтруктураЕвропазов.Справа;
			КонецЕсли;
			
			ОсновныеРеквизиты.Добавить(СтрокаОтверстий);
			ОсновныеРеквизиты.Добавить(ЕвропазСверху); //(Отверстие европаз)
			ОсновныеРеквизиты.Добавить(ЕвропазСнизу); //(Отверстие европаз)
			ОсновныеРеквизиты.Добавить(ЕвропазСлева); //(Отверстие европаз)
			ОсновныеРеквизиты.Добавить(ЕвропазСправа); //(Отверстие европаз)
			ОсновныеРеквизиты.Добавить("☻"); //КонецДетали
			
			
			Для каждого Элемент Из ОсновныеРеквизиты Цикл
				
				Данные = "";
				
				Если Не Элемент = "☻" Тогда
					
					Данные = Данные + Элемент + "☺";
					
				Иначе
					
					Если Строка.НеТорцевать Тогда
						
						Данные = Данные + "1" + Элемент;
						
					Иначе
						
						Данные = Данные + Элемент;
						
					КонецЕсли;
					
				КонецЕсли;
				
				ДанныеДляРаскроя = ДанныеДляРаскроя + Данные;
				
			КонецЦикла;
			
			// Фасады в раскрой
		ИначеЕсли ОбычныйФасад Тогда
			
			РеквизитыФасадов = Новый Массив;
			РеквизитыФасадов.Добавить(Строка.Номенклатура);
			РеквизитыФасадов.Добавить("");
			
			РеквизитыФасадов.Добавить(Строка.ВысотаДетали);
			РеквизитыФасадов.Добавить(Строка.ШиринаДетали);
			
			РеквизитыФасадов.Добавить("");
			РеквизитыФасадов.Добавить("");
			РеквизитыФасадов.Добавить("");
			РеквизитыФасадов.Добавить("");
			РеквизитыФасадов.Добавить("");
			РеквизитыФасадов.Добавить("");
			РеквизитыФасадов.Добавить("");
			РеквизитыФасадов.Добавить("");
			РеквизитыФасадов.Добавить("");
			РеквизитыФасадов.Добавить("");
			РеквизитыФасадов.Добавить("");
			РеквизитыФасадов.Добавить("");
			РеквизитыФасадов.Добавить(Число(Строка.СоблюдениеТекстуры));
			РеквизитыФасадов.Добавить("");  //СоблюдениеТекстуры2
			РеквизитыФасадов.Добавить(Строка.Количество);
			РеквизитыФасадов.Добавить(Строка.Комментарий);
			Надпись = "";
			
			Если Материал = "ФасадСтеклянныйЗакругленный" Тогда
				
				Надпись = Надпись + СтрокаИдентификатор + "Скр. " + Строка.РадиусФасада;
				
			Иначе
				
				Надпись = Надпись + СтрокаИдентификатор;
				
			КонецЕсли;
			
			РеквизитыФасадов.Добавить(Надпись);
			РеквизитыФасадов.Добавить(Строка.Номенклатура.ШиринаДетали); //ШиринаПолотна,
			РеквизитыФасадов.Добавить(Строка.Номенклатура.ДлинаДетали); //ДлинаПолотна,
			РеквизитыФасадов.Добавить(Строка.ВыборМебельнойКромкиСверху.КраткоеНаименование);
			РеквизитыФасадов.Добавить(Строка.ВыборМебельнойКромкиСнизу.КраткоеНаименование);
			РеквизитыФасадов.Добавить(Строка.ВыборМебельнойКромкиСлева.КраткоеНаименование);
			РеквизитыФасадов.Добавить(Строка.ВыборМебельнойКромкиСправа.КраткоеНаименование);
			РеквизитыФасадов.Добавить(""); //Нх1,
			РеквизитыФасадов.Добавить(""); //Нх2,
			РеквизитыФасадов.Добавить(""); //Нх3,
			РеквизитыФасадов.Добавить(""); //Нх4,
			СтрокаОтверстий = "";
			
			ЕвропазСверху = 0;
			ЕвропазСнизу = 0;
			ЕвропазСлева = 0;
			ЕвропазСправа = 0;
			
			/////////////////////////////Петли/////////////////
			КоличествоПетель = Строка.КоличествоПетель;
			
			Если КоличествоПетель > 0 И (Материал = "ФасадЛДСП" ИЛИ Материал = "ФасадМДФ" ИЛИ Материал = "ФасадСтеклянный") Тогда
				
				Стороны = Перечисления.Стороны;
				
				Если Строка.РасположениеПазов = Стороны.Слева Тогда
					
					Сторона 	= "3";
					РазмерСтороны = Строка.ВысотаДетали;
					
				ИначеЕсли Строка.РасположениеПазов = Стороны.Справа Тогда
					
					Сторона = "4";
					РазмерСтороны = Строка.ВысотаДетали;
					
				ИначеЕсли Строка.РасположениеПазов = Стороны.Сверху Тогда
					
					Сторона = "1";
					РазмерСтороны = Строка.ШиринаДетали;
					
				ИначеЕсли Строка.РасположениеПазов = Стороны.Снизу Тогда
					
					Сторона = "2";
					РазмерСтороны = Строка.ШиринаДетали;
					
				КонецЕсли;
				
				Отступ = ВернутьОтступ(РазмерСтороны);
				
				Если КоличествоПетель < 2 Тогда
					
					КоличествоПетель = 2;
					
				КонецЕсли;
					
				Шаг = Окр((РазмерСтороны - 2 * Отступ) / (КоличествоПетель - 1) , 0);
				
				СтрокаОтверстий = "3_"+ Сторона + "_" + КоличествоПетель + "_" + Отступ + "_" + Шаг + "_0#";
				
			КонецЕсли;
			
			////////////////////////////////////////////////////
			
			Если ЗначениеЗаполнено(Строка.СтруктураОтверстий) Тогда
				Если НЕ ЗначениеЗаполнено(Строка.Идентификатор) Тогда
					СтрокаОтверстий = ЛексСервер.ЗаполнитьРеквизитОтверстиями(СтрокаОтверстий, Строка.СтруктураОтверстий, Строка.ШиринаДетали, Строка.ВысотаДетали);
				КонецЕсли;
				СтруктураЕвропазов = ЛексСервер.ПолучитьСтруктуруЕвропазов(Строка.СтруктураОтверстий);
				ЕвропазСверху = СтруктураЕвропазов.Сверху;
				ЕвропазСнизу = СтруктураЕвропазов.Снизу;
				ЕвропазСлева = СтруктураЕвропазов.Слева;
				ЕвропазСправа = СтруктураЕвропазов.Справа;
			КонецЕсли;
			
			РеквизитыФасадов.Добавить(СтрокаОтверстий);
			РеквизитыФасадов.Добавить(ЕвропазСверху); //(Отверстие европаз)
			РеквизитыФасадов.Добавить(ЕвропазСнизу); //(Отверстие европаз)
			РеквизитыФасадов.Добавить(ЕвропазСлева); //(Отверстие европаз)
			РеквизитыФасадов.Добавить(ЕвропазСправа); //(Отверстие европаз)
			
			РеквизитыФасадов.Добавить("☻"); //КонецДетали
			
			Данные = "";
			
			Для каждого Элемент Из РеквизитыФасадов Цикл
				
				Если Не Элемент = "☻" Тогда
					
					Данные = Данные + Элемент + "☺";
					
				Иначе
					
					Данные = Данные + Элемент;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ДанныеДляРаскроя = ДанныеДляРаскроя + Данные;   // "☺" +
			
		КонецЕсли;
		
	КонецЦикла;
	
	/////////////////////////////////////////////////////////////////Раскрой ящиков//////////////////////////////////////////////
	Для Каждого Строка Из ЭтотОбъект.СписокЯщики Цикл
		
		СтрокаИдентификатор = "" + Строка.НомерСтроки + ?(ЗначениеЗаполнено(Строка.НомерИзделия), "/" + Строка.НомерИзделия, "")  + "ящ."; //+ ?(ЗначениеЗаполнено(Строка.Идентификатор), "/" + Строка.Идентификатор, "")
		
		/////////////////////////////////////////////////////////////Дно/////////////////////////////////////////////////////////////
		РеквизитыЯщика = Новый Массив;
		РеквизитыЯщика.Добавить(Строка.ДноНоменклатура);
		РеквизитыЯщика.Добавить(""); //клееная 
		РеквизитыЯщика.Добавить(Строка.ДлинаДно);
		РеквизитыЯщика.Добавить(Строка.ШиринаДно);
		РеквизитыЯщика.Добавить(""); //R1
		РеквизитыЯщика.Добавить(""); //R2
		РеквизитыЯщика.Добавить(""); //R3
		РеквизитыЯщика.Добавить(""); //R4
		РеквизитыЯщика.Добавить(""); //КрПил1
		РеквизитыЯщика.Добавить(""); //КрПил2
		РеквизитыЯщика.Добавить(""); //КрПил3
		РеквизитыЯщика.Добавить(""); //КрПил4
		РеквизитыЯщика.Добавить(""); //Эксц1
		РеквизитыЯщика.Добавить(""); //Эксц2
		РеквизитыЯщика.Добавить(""); //Эксц3
		РеквизитыЯщика.Добавить(""); //Эксц4
		РеквизитыЯщика.Добавить(Строка.НомерСтроки);
		РеквизитыЯщика.Добавить("");  //СоблюдениеТекстуры2
		РеквизитыЯщика.Добавить(Строка.КоличествоЯщиков);
		РеквизитыЯщика.Добавить(""); //Комментарий
		РеквизитыЯщика.Добавить(СтрокаИдентификатор); //Скругление
		РеквизитыЯщика.Добавить(Строка.ДноНоменклатура.ШиринаДетали); //ШиринаПолотна,
		РеквизитыЯщика.Добавить(Строка.ДноНоменклатура.ДлинаДетали); //ДлинаПолотна,
		РеквизитыЯщика.Добавить(""); //кромка
		РеквизитыЯщика.Добавить(""); //кромка
		РеквизитыЯщика.Добавить(""); //кромка
		РеквизитыЯщика.Добавить(""); //кромка
		РеквизитыЯщика.Добавить(""); //Нх1,
		РеквизитыЯщика.Добавить(""); //Нх2,
		РеквизитыЯщика.Добавить(""); //Нх3,
		РеквизитыЯщика.Добавить(""); //Нх4,
		РеквизитыЯщика.Добавить(""); //Отверстия
		РеквизитыЯщика.Добавить(""); //Нх5,
		РеквизитыЯщика.Добавить(""); //Нх6,
		РеквизитыЯщика.Добавить(""); //Нх7,
		РеквизитыЯщика.Добавить(""); //Нх8,
		РеквизитыЯщика.Добавить("☻"); //КонецДетали
		
		Для каждого Элемент Из РеквизитыЯщика Цикл
			Данные = "";
			Если Не Элемент = "☻" Тогда
				Данные = Данные + Элемент + "☺";
			Иначе
				Данные = Данные + Элемент;
			КонецЕсли;
			ДанныеДляРаскроя = ДанныеДляРаскроя + Данные;
		КонецЦикла;
		
		Если Строка.ВидЯщика = Перечисления.ВидыЯщика.Обычный Тогда
			/////////////////////////////////////////////////////////////Ребро/////////////////////////////////////////////////////////////
			Если ЗначениеЗаполнено(Строка.ДлинаРебро) Тогда
				РеквизитыЯщика = Новый Массив;
				РеквизитыЯщика.Добавить(Строка.Номенклатура);
				РеквизитыЯщика.Добавить(""); //клееная 
				РеквизитыЯщика.Добавить(Строка.ДлинаРебро);
				РеквизитыЯщика.Добавить(Строка.ВысотаЯщика);
				РеквизитыЯщика.Добавить(""); //R1
				РеквизитыЯщика.Добавить(""); //R2
				РеквизитыЯщика.Добавить(""); //R3
				РеквизитыЯщика.Добавить(""); //R4
				РеквизитыЯщика.Добавить(""); //КрПил1
				РеквизитыЯщика.Добавить(""); //КрПил2
				РеквизитыЯщика.Добавить(""); //КрПил3
				РеквизитыЯщика.Добавить(""); //КрПил4
				РеквизитыЯщика.Добавить(""); //Эксц1
				РеквизитыЯщика.Добавить(""); //Эксц2
				РеквизитыЯщика.Добавить(""); //Эксц3
				РеквизитыЯщика.Добавить(""); //Эксц4
				РеквизитыЯщика.Добавить(Строка.НомерСтроки);
				РеквизитыЯщика.Добавить("");  //СоблюдениеТекстуры2
				РеквизитыЯщика.Добавить(Строка.КоличествоЯщиков);
				РеквизитыЯщика.Добавить(""); //Комментарий
				РеквизитыЯщика.Добавить(СтрокаИдентификатор); //Скругление
				РеквизитыЯщика.Добавить(Строка.Номенклатура.ШиринаДетали); //ШиринаПолотна,
				РеквизитыЯщика.Добавить(Строка.Номенклатура.ДлинаДетали); //ДлинаПолотна,
				РеквизитыЯщика.Добавить(""); //кромка
				РеквизитыЯщика.Добавить(""); //кромка
				РеквизитыЯщика.Добавить(Строка.КромкаНоменклатура.КраткоеНаименование); //кромка
				РеквизитыЯщика.Добавить(""); //кромка
				РеквизитыЯщика.Добавить(""); //Нх1,
				РеквизитыЯщика.Добавить(""); //Нх2,
				РеквизитыЯщика.Добавить(""); //Нх3,
				РеквизитыЯщика.Добавить(""); //Нх4,
				РеквизитыЯщика.Добавить(""); //Отверстия
				РеквизитыЯщика.Добавить(""); //Нх5,
				РеквизитыЯщика.Добавить(""); //Нх6,
				РеквизитыЯщика.Добавить(""); //Нх7,
				РеквизитыЯщика.Добавить(""); //Нх8,
				РеквизитыЯщика.Добавить("☻"); //КонецДетали
				Для каждого Элмент Из РеквизитыЯщика Цикл
					Данные = "";
					Если Не Элмент = "☻" Тогда
						Данные = Данные + Элмент + "☺";
					Иначе
						Данные = Данные + Элмент;
					КонецЕсли;
					ДанныеДляРаскроя = ДанныеДляРаскроя + Данные;
				КонецЦикла;
				
			КонецЕсли;
			/////////////////////////////////////////////////////////////Боковая Сторона1/////////////////////////////////////////////////////////////
			РеквизитыЯщика = Новый Массив;
			РеквизитыЯщика.Добавить(Строка.Номенклатура);
			РеквизитыЯщика.Добавить(""); //клееная 
			РеквизитыЯщика.Добавить(Строка.ШиринаБоковойСтороны);
			РеквизитыЯщика.Добавить(Строка.ВысотаБоковойСтороны);
			РеквизитыЯщика.Добавить(""); //R1
			РеквизитыЯщика.Добавить(""); //R2
			РеквизитыЯщика.Добавить(""); //R3
			РеквизитыЯщика.Добавить(""); //R4
			РеквизитыЯщика.Добавить(""); //КрПил1
			РеквизитыЯщика.Добавить(""); //КрПил2
			РеквизитыЯщика.Добавить(""); //КрПил3
			РеквизитыЯщика.Добавить(""); //КрПил4
			РеквизитыЯщика.Добавить(""); //Эксц1
			РеквизитыЯщика.Добавить(""); //Эксц2
			РеквизитыЯщика.Добавить(""); //Эксц3
			РеквизитыЯщика.Добавить(""); //Эксц4
			РеквизитыЯщика.Добавить(Строка.НомерСтроки);
			РеквизитыЯщика.Добавить("");  //СоблюдениеТекстуры2
			РеквизитыЯщика.Добавить(2 * Строка.КоличествоЯщиков);
			РеквизитыЯщика.Добавить(""); //Комментарий
			РеквизитыЯщика.Добавить(СтрокаИдентификатор); //Скругление
			РеквизитыЯщика.Добавить(Строка.Номенклатура.ШиринаДетали); //ШиринаПолотна,
			РеквизитыЯщика.Добавить(Строка.Номенклатура.ДлинаДетали); //ДлинаПолотна,
			РеквизитыЯщика.Добавить(""); //кромка
			РеквизитыЯщика.Добавить(""); //кромка
			РеквизитыЯщика.Добавить(Строка.КромкаНоменклатура.КраткоеНаименование); //кромка
			РеквизитыЯщика.Добавить(""); //кромка
			РеквизитыЯщика.Добавить(""); //Нх1,
			РеквизитыЯщика.Добавить(""); //Нх2,
			РеквизитыЯщика.Добавить(""); //Нх3,
			РеквизитыЯщика.Добавить(""); //Нх4,
			РеквизитыЯщика.Добавить(""); //Отверстия
			РеквизитыЯщика.Добавить(""); //Нх5,
			РеквизитыЯщика.Добавить(""); //Нх6,
			РеквизитыЯщика.Добавить(""); //Нх7,
			РеквизитыЯщика.Добавить(""); //Нх8,
			РеквизитыЯщика.Добавить("☻"); //КонецДетали
			Для каждого Элмент Из РеквизитыЯщика Цикл
				Данные = "";
				Если Не Элмент = "☻" Тогда
					Данные = Данные + Элмент + "☺";
				Иначе
					Данные = Данные + Элмент;
				КонецЕсли;
				ДанныеДляРаскроя = ДанныеДляРаскроя + Данные;
			КонецЦикла;
			/////////////////////////////////////////////////////////////Боковая Сторона2/////////////////////////////////////////////////////////////
			РеквизитыЯщика = Новый Массив;
			РеквизитыЯщика.Добавить(Строка.Номенклатура);
			РеквизитыЯщика.Добавить(""); //клееная 
			РеквизитыЯщика.Добавить(Строка.ДлинаБоковойСтороны);
			РеквизитыЯщика.Добавить(Строка.ВысотаБоковойСтороны);
			РеквизитыЯщика.Добавить(""); //R1
			РеквизитыЯщика.Добавить(""); //R2
			РеквизитыЯщика.Добавить(""); //R3
			РеквизитыЯщика.Добавить(""); //R4
			РеквизитыЯщика.Добавить(""); //КрПил1
			РеквизитыЯщика.Добавить(""); //КрПил2
			РеквизитыЯщика.Добавить(""); //КрПил3
			РеквизитыЯщика.Добавить(""); //КрПил4
			РеквизитыЯщика.Добавить(""); //Эксц1
			РеквизитыЯщика.Добавить(""); //Эксц2
			РеквизитыЯщика.Добавить(""); //Эксц3
			РеквизитыЯщика.Добавить(""); //Эксц4
			РеквизитыЯщика.Добавить(Строка.НомерСтроки);
			РеквизитыЯщика.Добавить("");  //СоблюдениеТекстуры2
			РеквизитыЯщика.Добавить(2 * Строка.КоличествоЯщиков);
			РеквизитыЯщика.Добавить(""); //Комментарий
			РеквизитыЯщика.Добавить(СтрокаИдентификатор); //Скругление
			РеквизитыЯщика.Добавить(Строка.Номенклатура.ШиринаДетали); //ШиринаПолотна,
			РеквизитыЯщика.Добавить(Строка.Номенклатура.ДлинаДетали); //ДлинаПолотна,
			РеквизитыЯщика.Добавить(Строка.КромкаНоменклатура.КраткоеНаименование); //кромка
			РеквизитыЯщика.Добавить(Строка.КромкаНоменклатура.КраткоеНаименование); //кромка
			РеквизитыЯщика.Добавить(Строка.КромкаНоменклатура.КраткоеНаименование); //кромка
			РеквизитыЯщика.Добавить(""); //кромка
			РеквизитыЯщика.Добавить(""); //Нх1,
			РеквизитыЯщика.Добавить(""); //Нх2,
			РеквизитыЯщика.Добавить(""); //Нх3,
			РеквизитыЯщика.Добавить(""); //Нх4,
			РеквизитыЯщика.Добавить(""); //Отверстия
			РеквизитыЯщика.Добавить(""); //Нх5,
			РеквизитыЯщика.Добавить(""); //Нх6,
			РеквизитыЯщика.Добавить(""); //Нх7,
			РеквизитыЯщика.Добавить(""); //Нх8,
			РеквизитыЯщика.Добавить("☻"); //КонецДетали
			Для каждого Элмент Из РеквизитыЯщика Цикл
				Данные = "";
				Если Не Элмент = "☻" Тогда
					Данные = Данные + Элмент + "☺";
				Иначе
					Данные = Данные + Элмент;
				КонецЕсли;
				ДанныеДляРаскроя = ДанныеДляРаскроя + Данные;
			КонецЦикла;
		Иначе
			/////////////////////////////////////////////////////////////////////////////МТбоксы//////////////////////////////////////////////////////////
			РеквизитыЯщика = Новый Массив;
			РеквизитыЯщика.Добавить(Строка.Номенклатура);
			РеквизитыЯщика.Добавить(""); //клееная 
			РеквизитыЯщика.Добавить(Строка.ШиринаБоковойСтороны);
			РеквизитыЯщика.Добавить(Строка.ВысотаБоковойСтороны);
			РеквизитыЯщика.Добавить(""); //R1
			РеквизитыЯщика.Добавить(""); //R2
			РеквизитыЯщика.Добавить(""); //R3
			РеквизитыЯщика.Добавить(""); //R4
			РеквизитыЯщика.Добавить(""); //КрПил1
			РеквизитыЯщика.Добавить(""); //КрПил2
			РеквизитыЯщика.Добавить(""); //КрПил3
			РеквизитыЯщика.Добавить(""); //КрПил4
			РеквизитыЯщика.Добавить(""); //Эксц1
			РеквизитыЯщика.Добавить(""); //Эксц2
			РеквизитыЯщика.Добавить(""); //Эксц3
			РеквизитыЯщика.Добавить(""); //Эксц4
			РеквизитыЯщика.Добавить(Строка.НомерСтроки);
			РеквизитыЯщика.Добавить("");  //СоблюдениеТекстуры2
			РеквизитыЯщика.Добавить(Строка.КоличествоЯщиков);
			РеквизитыЯщика.Добавить(""); //Комментарий
			РеквизитыЯщика.Добавить(СтрокаИдентификатор); //Скругление
			РеквизитыЯщика.Добавить(Строка.Номенклатура.ШиринаДетали); //ШиринаПолотна,
			РеквизитыЯщика.Добавить(Строка.Номенклатура.ДлинаДетали); //ДлинаПолотна,
			РеквизитыЯщика.Добавить(Строка.КромкаНоменклатура.КраткоеНаименование); //кромка
			РеквизитыЯщика.Добавить(Строка.КромкаНоменклатура.КраткоеНаименование); //кромка
			РеквизитыЯщика.Добавить(Строка.КромкаНоменклатура.КраткоеНаименование); //кромка
			РеквизитыЯщика.Добавить(Строка.КромкаНоменклатура.КраткоеНаименование); //кромка
			РеквизитыЯщика.Добавить(""); //Нх1,
			РеквизитыЯщика.Добавить(""); //Нх2,
			РеквизитыЯщика.Добавить(""); //Нх3,
			РеквизитыЯщика.Добавить(""); //Нх4,
			РеквизитыЯщика.Добавить(""); //Отверстия
			РеквизитыЯщика.Добавить(""); //Нх5,
			РеквизитыЯщика.Добавить(""); //Нх6,
			РеквизитыЯщика.Добавить(""); //Нх7,
			РеквизитыЯщика.Добавить(""); //Нх8,
			РеквизитыЯщика.Добавить("☻"); //КонецДетали
			Для каждого Элмент Из РеквизитыЯщика Цикл
				Данные = "";
				Если Не Элмент = "☻" Тогда
					Данные = Данные + Элмент + "☺";
				Иначе 
					Данные = Данные + Элмент;
				КонецЕсли;
				ДанныеДляРаскроя = ДанныеДляРаскроя + Данные;
			КонецЦикла;
		КонецЕсли;
		//////////////////////////////////////////////////////////////////////////////Фасады к ящикам/////////////////////////////////////////////////////////////////////\
		Если Строка.ВидФасада <> "Нет" Тогда
			Если ЗначениеЗаполнено(Строка.ФасадНоменклатура) Тогда 
				НоменклатурнаяГруппаФасада = Строка.ФасадНоменклатура.НоменклатурнаяГруппа;
				
				//Если НоменклатурнаяГруппаФасада = Справочники.НоменклатурныеГруппы.ЛДСП16 ИЛИ НоменклатурнаяГруппаФасада = Справочники.НоменклатурныеГруппы.МДФ Тогда
				РеквизитыЯщика = Новый Массив;
				РеквизитыЯщика.Добавить(Строка.ФасадНоменклатура);
				РеквизитыЯщика.Добавить(""); //клееная 
				РеквизитыЯщика.Добавить(Строка.ВысотаФасад - 2 * Строка.КромкаФасадНоменклатура.ГлубинаДетали);
				РеквизитыЯщика.Добавить(Строка.ШиринаФасад -2 * Строка.КромкаФасадНоменклатура.ГлубинаДетали);
				РеквизитыЯщика.Добавить(""); //R1
				РеквизитыЯщика.Добавить(""); //R2
				РеквизитыЯщика.Добавить(""); //R3
				РеквизитыЯщика.Добавить(""); //R4
				РеквизитыЯщика.Добавить(""); //КрПил1
				РеквизитыЯщика.Добавить(""); //КрПил2
				РеквизитыЯщика.Добавить(""); //КрПил3
				РеквизитыЯщика.Добавить(""); //КрПил4
				РеквизитыЯщика.Добавить(""); //Эксц1
				РеквизитыЯщика.Добавить(""); //Эксц2
				РеквизитыЯщика.Добавить(""); //Эксц3
				РеквизитыЯщика.Добавить(""); //Эксц4
				РеквизитыЯщика.Добавить(Строка.НомерСтроки);
				РеквизитыЯщика.Добавить("");  //СоблюдениеТекстуры2
				РеквизитыЯщика.Добавить(Строка.КоличествоЯщиков);
				РеквизитыЯщика.Добавить(""); //Комментарий
				РеквизитыЯщика.Добавить(СтрокаИдентификатор); //Скругление
				РеквизитыЯщика.Добавить(Строка.ФасадНоменклатура.ШиринаДетали); //ШиринаПолотна,
				РеквизитыЯщика.Добавить(Строка.ФасадНоменклатура.ДлинаДетали); //ДлинаПолотна,
				РеквизитыЯщика.Добавить(Строка.КромкаФасадНоменклатура.КраткоеНаименование); //кромка
				РеквизитыЯщика.Добавить(Строка.КромкаФасадНоменклатура.КраткоеНаименование); //кромка
				РеквизитыЯщика.Добавить(Строка.КромкаФасадНоменклатура.КраткоеНаименование); //кромка
				РеквизитыЯщика.Добавить(Строка.КромкаФасадНоменклатура.КраткоеНаименование); //кромка
				РеквизитыЯщика.Добавить(""); //Нх1,
				РеквизитыЯщика.Добавить(""); //Нх2,
				РеквизитыЯщика.Добавить(""); //Нх3,
				РеквизитыЯщика.Добавить(""); //Нх4,
				РеквизитыЯщика.Добавить(""); //Отверстия
				РеквизитыЯщика.Добавить(""); //Нх5,
				РеквизитыЯщика.Добавить(""); //Нх6,
				РеквизитыЯщика.Добавить(""); //Нх7,
				РеквизитыЯщика.Добавить(""); //Нх8,
				РеквизитыЯщика.Добавить("☻"); //КонецДетали
				Для каждого Элмент Из РеквизитыЯщика Цикл
					Данные = "";
					Если Не Элмент = "☻" Тогда
						Данные = Данные + Элмент + "☺";
					Иначе 
						Данные = Данные + Элмент;
					КонецЕсли;
					ДанныеДляРаскроя = ДанныеДляРаскроя + Данные;
				КонецЦикла;
				//КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ДанныеДляРаскроя <> "☻☺☺☺☺☺☺☺☺☺☺☺☺☺☻☺☺☺☺☺☻" Тогда
		
		ЭтотОбъект.СтрокаРаскрояЛДСП = ЛексКлиентСервер.ПеревестиСтрокуВКодыСимволов(ДанныеДляРаскроя);
		
	Иначе 
		
		ЭтотОбъект.СтрокаРаскрояЛДСП = Неопределено;
		
	КонецЕсли;
	
	ЭтотОбъект.СтрокаРаскрояСтекла = Неопределено;
	
	//Создаем строку для кривого пила
	
	СтрокаДляПередачиКривойПил 	= "";
	СтрокаДляПередачиКривойПил 	= СтрокаДляПередачиКривойПил + ПутьЛоготипа + "☻";
	РеквизитыКривогоПила 				= Новый Массив;
	
	Для Каждого Элемент Из ЭтотОбъект.СписокМатериалы Цикл
		
		Материал = Элемент.Материал;
		
		Если ЗначениеЗаполнено(Элемент.СтрокаДляФлэш) Тогда
			
			РеквизитыКривогоПила.Добавить(Элемент.Номенклатура);
			РеквизитыКривогоПила.Добавить(Элемент.ВыборМебельнойКромкиСверху.КраткоеНаименование);
			РеквизитыКривогоПила.Добавить(Элемент.ВыборМебельнойКромкиСнизу.КраткоеНаименование);
			РеквизитыКривогоПила.Добавить(Элемент.ВыборМебельнойКромкиСлева.КраткоеНаименование);
			РеквизитыКривогоПила.Добавить(Элемент.ВыборМебельнойКромкиСправа.КраткоеНаименование);
			РеквизитыКривогоПила.Добавить("Спецификация " + ЭтотОбъект.Номер);
			РеквизитыКривогоПила.Добавить("Количество деталей: " + Элемент.Количество);
			РеквизитыКривогоПила.Добавить("№ детали " + Элемент.НомерСтроки + " Комментарий: " + Элемент.Комментарий);
			
			Если Элемент.Обтачивать И Элемент.Материал = "Стекло" Тогда
				
				РеквизитыКривогоПила.Добавить("Обтачивать");
				
			ИначеЕсли НЕ Элемент.Обтачивать И Элемент.Материал = "Стекло" Тогда
				
				РеквизитыКривогоПила.Добавить("Без обточки");
				
			Иначе
				
				РеквизитыКривогоПила.Добавить("");
				
			КонецЕсли;
			
			РеквизитыКривогоПила.Добавить(Элемент.НомерСтроки);
			РеквизитыКривогоПила.Добавить(Элемент.СтрокаДляФлэш);
			РеквизитыКривогоПила.Добавить("☻");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Строка Из РеквизитыКривогоПила Цикл
		
		Если Не Строка = "☻" Тогда
			
			СтрокаДляПередачиКривойПил = СтрокаДляПередачиКривойПил + Строка + "☺";
			
		Иначе
			
			СтрокаДляПередачиКривойПил = СтрокаДляПередачиКривойПил + Строка;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ СтрокаДляПередачиКривойПил = "%РОСПИЛ%☻" И НЕ СтрокаДляПередачиКривойПил = "%ЛЕКС%☻" Тогда
		
		ЭтотОбъект.СтрокаКривогоПила = ЛексКлиентСервер.ПеревестиСтрокуВКодыСимволов(СтрокаДляПередачиКривойПил);
		
	Иначе
		
		ЭтотОбъект.СтрокаКривогоПила = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Замер") Тогда
		
		ДокументОснование	= ДанныеЗаполнения;
		АдресМонтажа			= ДанныеЗаполнения.АдресЗамера;
		Километраж				= ДанныеЗаполнения.Километраж;
		Офис = ДанныеЗаполнения.Офис;
		
	КонецЕсли;
	
	Дилерский = РольДоступна("ДилерскийДоступКСпецификации");
	
	Если Дилерский И ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		
		Контрагент = ПараметрыСеанса.ТекущийВнешнийПользователь.ОбъектАвторизации;
		ПакетУслуг = Перечисления.ПакетыУслуг.СамовывозОтПроизводителя;
		Офис = Подразделение.ОсновнойОфис;
		Изделие = Справочники.Изделия.Детали;
		
		// { Васильев Александр Леонидович [12.11.2013]
		// удалить позже
		Доставка = Ложь;
		Монтаж = Ложь;
		// } Васильев Александр Леонидович [12.11.2013]
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ СтатусВышеРазмещен() Тогда
		Отказ = Истина;
		ТекстСообщения = "Проведение разрешено только для размещенных документов";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Движения.Записать();
	
	Если Изделие = Справочники.Изделия.Детали Тогда
		
		Отказ = ВзаиморасчетыПроводки();
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Проводка = Движения.Управленческий.Добавить();
	Проводка.Период = Ссылка.ДатаИзготовления;
	Проводка.Подразделение = Производство;
	Проводка.СчетДт = ПланыСчетов.Управленческий.ПоказателиПодразделения;
	Проводка.СубконтоДт.ВидыПоказателейПодразделений = Перечисления.ВидыПоказателейПодразделений.СуммаНарядов;
	Проводка.Сумма = СуммаНарядаСпецификации;
	
	Если ЗначениеЗаполнено(Виновный) Тогда
		
		Проводка = Движения.ОшибкиСотрудников.Добавить();
		Проводка.Период = Дата;
		Проводка.Сотрудник = Виновный;
		Проводка.Количество = 1;
		Проводка.Сумма = СуммаДокумента;
		
	КонецЕсли;
	
	Если Быстрый Тогда
		МассивСпецификаций = Новый Массив;
		МассивСпецификаций.Добавить(Ссылка);
		ЛексСервер.УвеличитьДополнительныйЛимит(МассивСпецификаций, Движения, Дата, Производство);
	КонецЕсли;
	
	Движения.Управленческий.Записывать = Истина;
	Движения.ОшибкиСотрудников.Записывать = Истина;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Дилерский Тогда
		
		// Дату отгрузки для всех проверять надо...
		
		Если Дата > КонецДня(ДатаОтгрузки) Тогда
			
			Отказ = Истина;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Дата отгрузки (%1) не может быть раньше даты размещения (%2)%3Выберите другую дату отгрузки" , Формат(ДатаОтгрузки, "ДЛФ=DD"), Формат(Дата, "ДЛФ=DD"), Символы.ПС);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ДатаОтгрузки");
			
		КонецЕсли;
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Офис"));
		Если ПакетУслуг = Перечисления.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для дилеров услуга монтажа не доступна",,"Объект.ПакетУслуг");
		КонецЕсли;
		
	Иначе
		
		Если Контрагент.Дилер Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено создавать спецификации для дилеров");
		КонецЕсли;
		
		Если Контрагент = Справочники.Контрагенты.ЧастноеЛицо И Изделие = Справочники.Изделия.Детали Тогда
			
			ПроверяемыеРеквизиты.Добавить("Телефон");
			
		КонецЕсли;
		
		Если Изделие = Справочники.Изделия.Переделка Тогда
			
			// только инженер отдела качества может создавать переделки
			
			ПроверяемыеРеквизиты.Добавить("Виновный");
			ПроверяемыеРеквизиты.Добавить("ЗамечанияИнженера");
			
			Если НЕ ЗначениеЗаполнено(ДокументОснование) ИЛИ ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.Спецификация") Тогда
				Отказ = Истина;
				ТекстСообщения = "Укажите спецификацию для которой вводится переделка";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ДокументОснование");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДеньНедели(ДатаОтгрузки) = 7 Тогда
		
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В воскресенье изделия не отгружаем. Выберите другой день",,"Объект.ДатаОтгрузки");
		
	КонецЕсли;
	
	Если (ПакетУслуг = Перечисления.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж ИЛИ ПакетУслуг = Перечисления.ПакетыУслуг.ДоставкаДоКлиента) И АдресМонтажа = "Введите адрес" Тогда
		
		Отказ = Истина;
		ТекстСообщения = "Не указан адрес";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.АдресМонтажа");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	ПользовательАдминистратор = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Администратор);
	
	Если НЕ ПользовательАдминистратор И СтатусВышеРазмещен() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено отменять проведение документа со статусом выше 'Размещен'");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
