
&НаСервере
Перем ТаблицаДеталиЯщиков;

#Область Заполнение_документа_при_записи

&НаСервере
Функция ЗаполнитьХлыстовойМатериал(фнОбъект)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Подразделение", фнОбъект.Подразделение);
	Запрос.УстановитьПараметр("тзНоменклатура", фнОбъект.СписокНоменклатуры.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзНоменклатура.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	тзНоменклатура.КоличествоТребуется
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	&тзНоменклатура КАК тзНоменклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиНоменклатуры.Номенклатура,
	|	НастройкиНоменклатуры.ОкруглятьДоЛистов
	|ПОМЕСТИТЬ рсНастройкиНоменклатуры
	|ИЗ
	|	РегистрСведений.НастройкиНоменклатуры.СрезПоследних(, Подразделение = &Подразделение) КАК НастройкиНоменклатуры
	|ГДЕ
	|	НастройкиНоменклатуры.Номенклатура В
	|			(ВЫБРАТЬ
	|				т.Номенклатура
	|			ИЗ
	|				втНоменклатура КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоменклатура.Номенклатура КАК Номенклатура,
	|	втНоменклатура.Номенклатура КАК Кратность,
	|	втНоменклатура.КоличествоТребуется,
	|	ЕСТЬNULL(рсНастройкиНоменклатуры.ОкруглятьДоЛистов, ИСТИНА) КАК ОкруглятьДоЛистов
	|ИЗ
	|	втНоменклатура КАК втНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ рсНастройкиНоменклатуры КАК рсНастройкиНоменклатуры
	|		ПО втНоменклатура.Номенклатура = рсНастройкиНоменклатуры.Номенклатура
	|ГДЕ
	|	втНоменклатура.Номенклатура.НоменклатурнаяГруппа.ВидМатериала = ЗНАЧЕНИЕ(Перечисление.ВидыМатериалов.Хлыстовой)
	|	И втНоменклатура.Номенклатура.Кратность > 0
	|ИТОГИ
	|	МАКСИМУМ(Кратность),
	|	МАКСИМУМ(ОкруглятьДоЛистов)
	|ПО
	|	Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		МассивОтрезков = Новый Массив;
		
		ОсновнаяПоСкладу = ЛексСервер.ПолучитьОсновнуюПоСкладу(фнОбъект.Подразделение, ВыборкаНоменклатура.Номенклатура);
		Если НЕ ЗначениеЗаполнено(ОсновнаяПоСкладу)
			ИЛИ ОсновнаяПоСкладу.Базовый Тогда
			ДлинаХлыста = ВыборкаНоменклатура.Номенклатура.ДлинаДетали;
		Иначе
			ДлинаХлыста = ОсновнаяПоСкладу.КоэффициентБазовых * 1000;
		КонецЕсли;
		
		Кратность = ВыборкаНоменклатура.Номенклатура.Кратность * 1000;
		КоличествоДобавления = 0;
		
		НомГруппа = ВыборкаНоменклатура.Номенклатура.НоменклатурнаяГруппа;
		Спр = Справочники.НоменклатурныеГруппы;
		Выборка = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			
			Отрезок = Выборка.КоличествоТребуется * 1000;
			
			Если Отрезок > ДлинаХлыста Тогда
				
				КоличествоЦелыхКусков = Цел(Отрезок/ДлинаХлыста);
				Отрезок = Отрезок % ДлинаХлыста;
				
				Отбор = Новый Структура();
				Отбор.Вставить("Номенклатура",Выборка.Номенклатура);
				Отбор.Вставить("КоличествоТребуется",Выборка.КоличествоТребуется);
				
				Строка = фнОбъект.СписокНоменклатуры.НайтиСтроки(Отбор)[0];
				фнОбъект.СписокНоменклатуры.Удалить(Строка);
				
				Инд = 0;
				
				Пока Инд < КоличествоЦелыхКусков Цикл
					
					ДобавитьСтроку(фнОбъект, ВыборкаНоменклатура.Номенклатура, ДлинаХлыста/1000,,,,,,,, ДлинаХлыста/1000);
					Инд = Инд + 1;
					
				КонецЦикла;
				
				Если Отрезок > 0 Тогда
					ДобавитьСтроку(фнОбъект, ВыборкаНоменклатура.Номенклатура, Отрезок/1000,,,,,,,, Отрезок/1000);
				КонецЕсли;
				
			КонецЕсли;
			
			Если Отрезок > 0 Тогда
				МассивОтрезков.Добавить(Отрезок);
			КонецЕсли;
			
		КонецЦикла;
		
		Пока МассивОтрезков.Количество() > 0 Цикл
			
			РезультатРаскроя = Раскрой.МаксимальнаяСуммаПодмножеств(МассивОтрезков, ДлинаХлыста);
			
			Если ВыборкаНоменклатура.ОкруглятьДоЛистов Тогда
				КоличествоДобавления = КоличествоДобавления + ДлинаХлыста - РезультатРаскроя.Сумма;
			ИначеЕсли РезультатРаскроя.Сумма % Кратность > 0 Тогда
				КратныхОтрезков = Цел(РезультатРаскроя.Сумма / Кратность); // Кратных отрезков
				ПродатьХлыстов = (КратныхОтрезков + 1) * Кратность;
				КоличествоДобавления = КоличествоДобавления + ПродатьХлыстов - РезультатРаскроя.Сумма;
			КонецЕсли;
			
			Для каждого РазмещеннаяДеталь Из РезультатРаскроя.Массив Цикл
				
				Индекс = МассивОтрезков.Найти(РазмещеннаяДеталь);
				МассивОтрезков.Удалить(Индекс);
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если КоличествоДобавления > 0 Тогда
			
			КоличествоДобавления = КоличествоДобавления / 1000;
			ДобавитьСтроку(фнОбъект, ВыборкаНоменклатура.Номенклатура, КоличествоДобавления,,,,,,,, 0);
			
		КонецЕсли;
		
	КонецЦикла; // ВыборкаНоменклатура.Следующий()
	
КонецФункции

&НаСервере
Функция СформироватьВТНоменклатура(Запрос, ТекущийОбъект)
	
	ТаблицаСпискаНоменклатуры = ТекущийОбъект.СписокНоменклатуры.Выгрузить();
	Запрос.УстановитьПараметр("тзНоменклатура", ТаблицаСпискаНоменклатуры);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзНоменклатура.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	тзНоменклатура.Количество,
	|	тзНоменклатура.КоличествоТребуется,
	|	тзНоменклатура.Цена,
	|	тзНоменклатура.ЗарплатаЦеха,
	|	тзНоменклатура.НомерИзделия,
	|	тзНоменклатура.НомерСтроки,
	|	тзНоменклатура.ИспользуетсяВКоробе,
	|	тзНоменклатура.УслугаСМатериаломЗаказчика,
	|	тзНоменклатура.ЧерезСклад,
	|	тзНоменклатура.ПредоставитЗаказчик,
	|	тзНоменклатура.РозничнаяСтоимость,
	|	тзНоменклатура.СуммаБезНаценкиОфиса,
	|	тзНоменклатура.ПоКаталогуМестоОбработки,
	|	тзНоменклатура.Двери,
	|	тзНоменклатура.КриволинейнаяКромка
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	&тзНоменклатура КАК тзНоменклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура";
	
	Запрос.Выполнить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеДетали(ТипДетали)
	
	Стр = Новый Структура;
	
	Стр.Вставить("Клееная", ТипДетали.Клееная);
	Стр.Вставить("ОбтачиватьПоУмолчанию", ТипДетали.ОбтачиватьПоУмолчанию);
	Стр.Вставить("ИспользоватьСоответствиеНоменклатуры", ТипДетали.ИспользоватьСоответствиеНоменклатуры);
	Стр.Вставить("МатериалСтрока", ТипДетали.МатериалСтрока);
	Стр.Вставить("ПрипускСклейка", ТипДетали.ПрипускСклейка);
	Стр.Вставить("ПрипускПостформинг", ТипДетали.ПрипускПостформинг);
	Стр.Вставить("ЭтоФасад", ТипДетали.ЭтоФасад);
	Стр.Вставить("ЭтоСтолешница", ТипДетали.ЭтоСтолешница);
	Стр.Вставить("ЭтоСтекло", ТипДетали.ЭтоСтекло);
	Стр.Вставить("МинимальнаяШирина", ТипДетали.МинимальнаяШирина);
	Стр.Вставить("МинимальнаяВысота", ТипДетали.МинимальнаяВысота);
	Стр.Вставить("СчитатьПлощадь", ТипДетали.СчитатьПлощадь);
	Стр.Вставить("РазмерТекстура", ТипДетали.РазмерТекстура);
	Стр.Вставить("РазмерДопНоменклатура", ТипДетали.РазмерДопНоменклатура);
	Стр.Вставить("УчитыватьКратность", ТипДетали.УчитыватьКратность);
	Стр.Вставить("СпецФасад", ТипДетали.СпецФасад);
	Стр.Вставить("ПрипускРамкаФасада", ТипДетали.ПрипускРамкаФасада);
	Стр.Вставить("ЗапрашиватьМежцентровоеРасстояние", ТипДетали.ЗапрашиватьМежцентровоеРасстояние);
	
	НомГруппы = Новый СписокЗначений;
	
	Для Каждого Эл Из ТипДетали.НоменклатурныеГруппы Цикл
		
		Стр2 = Новый Структура;
		Стр2.Вставить("ПолеВыбора", Эл.ПолеВыбора);
		Стр2.Вставить("Группа", Эл.Группа);
		
		НомГруппы.Добавить(Стр2);
		
	КонецЦикла;
	
	Стр.Вставить("НомГруппы", НомГруппы);
	
	Услуги = Новый СписокЗначений;
	
	Для Каждого Эл Из ТипДетали.Услуги Цикл
		
		Стр2 = Новый Структура;
		Стр2.Вставить("Услуга", Эл.Услуга);
		Стр2.Вставить("Количество", Эл.Количество);
		
		Услуги.Добавить(Стр2);
		
	КонецЦикла;
	
	Стр.Вставить("Услуги", Услуги);
	
	Комплектация = Новый СписокЗначений;
	
	Для Каждого Эл Из ТипДетали.Комплектация Цикл
		
		Стр2 = Новый Структура;
		Стр2.Вставить("Номенклатура", Эл.Номенклатура);
		Стр2.Вставить("Количество", Эл.Количество);
		
		Комплектация.Добавить(Стр2);
		
	КонецЦикла;
	
	Стр.Вставить("Комплектация", Комплектация);
	
	СтрДоступность = Новый Структура;
	
	Для Каждого Рек Из Метаданные.Справочники.ВидыДеталей.Реквизиты Цикл
		
		Если Лев(Рек.Имя,15) = "ДоступностьПоля" Тогда
			
			СтрДоступность.Вставить(Рек.Имя,ТипДетали[Рек.Имя]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Стр.Вставить("ДоступностьПолей", СтрДоступность);
	
	СтрОбязательныеПоля = Новый Структура;
	
	Для Каждого Рек Из Метаданные.Справочники.ВидыДеталей.Реквизиты Цикл
		
		Если Лев(Рек.Имя,16) = "ОбязательноеПоле" Тогда
			
			СтрОбязательныеПоля.Вставить(Рек.Имя,ТипДетали[Рек.Имя]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Стр.Вставить("ОбязательныеПоля", СтрОбязательныеПоля);
	
	Возврат Стр;
	
КонецФункции

&НаСервере
Функция ОбновитьСписокНоменклатурыЗаказчика(фнОбъект)
	
	МассивНоменклатуры = Новый Массив;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СписокНоменклатуры", фнОбъект.СписокНоменклатуры.Выгрузить());
	Запрос.УстановитьПараметр("Выбранные", фнОбъект.СписокМатериаловЗаказчика.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Подразделение", фнОбъект.Подразделение);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Список.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Список
	|ИЗ
	|	&СписокНоменклатуры КАК Список
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Список.Номенклатура КАК Номенклатура
	|ИЗ
	|	Список КАК Список
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(, &Подразделение = Подразделение) КАК НастройкиНоменклатуры
	|		ПО Список.Номенклатура = НастройкиНоменклатуры.Номенклатура
	|ГДЕ
	|	НастройкиНоменклатуры.МожетПредоставитьЗаказчик
	|	И НЕ Список.Номенклатура В (&Выбранные)";
	
	МассивНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
	СписокВыбора = Элементы.СписокМатериаловЗаказчикаНоменклатура.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.ЗагрузитьЗначения(МассивНоменклатуры);
	
КонецФункции

&НаСервере
Функция ПроставитьФлагЭтоКухня(ТекущийОбъект)
	
	ТекущийОбъект.ЭтоКухня = Ложь;
	
	Для каждого ИзделиеПоКаталогу Из ТекущийОбъект.СписокИзделийПоКаталогу Цикл
		Если ИзделиеПоКаталогу.Изделие.ВидИзделияПоКаталогу = Справочники.ВидыИзделийПоКаталогу.КухняВерхний
			ИЛИ ИзделиеПоКаталогу.Изделие.ВидИзделияПоКаталогу = Справочники.ВидыИзделийПоКаталогу.КухняНижний Тогда
			ТекущийОбъект.ЭтоКухня = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ЗаполнитьОсновныеЦвета(ТекущийОбъект)
	
	ТекущийОбъект.ЦветВертикальногоПрофиля = Неопределено;
	ТекущийОбъект.ЦветЛДСПОсновной = Неопределено;
	ТекущийОбъект.ЦветЛДСПДополнительный = Неопределено;
	
	Запрос = Новый Запрос;
	
	НоменклатурныеГруппы = Новый Массив;
	НоменклатурныеГруппы.Добавить(Справочники.НоменклатурныеГруппы.ВертикальныйПрофильСимметричный);
	НоменклатурныеГруппы.Добавить(Справочники.НоменклатурныеГруппы.ВертикальныйПрофильАсимметричный);
	НоменклатурныеГруппы.Добавить(Справочники.НоменклатурныеГруппы.ЛДСП16);
	
	Запрос.УстановитьПараметр("СписокНоменклатуры", ТекущийОбъект.СписокНоменклатуры);
	Запрос.УстановитьПараметр("НоменклатурныеГруппы", НоменклатурныеГруппы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	СписокНоменклатуры.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&СписокНоменклатуры КАК СписокНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ.Количество) КАК Количество,
	|	ВЫРАЗИТЬ(ВТ.Номенклатура КАК Справочник.Номенклатура).НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВЫРАЗИТЬ(ВТ.Номенклатура КАК Справочник.Номенклатура).НоменклатурнаяГруппа В (&НоменклатурныеГруппы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Номенклатура,
	|	ВЫРАЗИТЬ(ВТ.Номенклатура КАК Справочник.Номенклатура).НоменклатурнаяГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатурнаяГруппа,
	|	Количество УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ВертикальныйПрофильСимметричный
				ИЛИ Выборка.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ВертикальныйПрофильАсимметричный Тогда
				
				ТекущийОбъект.ЦветВертикальногоПрофиля = Выборка.Номенклатура;
				
			ИначеЕсли Выборка.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ЛДСП16 Тогда
				
				Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ЦветЛДСПОсновной) Тогда
					
					ТекущийОбъект.ЦветЛДСПОсновной = Выборка.Номенклатура;
					
				ИначеЕсли НЕ ЗначениеЗаполнено(ТекущийОбъект.ЦветЛДСПДополнительный) Тогда
					
					ТекущийОбъект.ЦветЛДСПДополнительный = Выборка.Номенклатура;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполнитьКоличествоКоробов(ТекущийОбъект)
	
	Если ТекущийОбъект.СписокИзделийПоКаталогу.Количество() = 0 Тогда
		ТекущийОбъект.КоличествоКоробов = 0;
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ВидыИзделий = Новый Массив;
	ВидыИзделий.Добавить(Справочники.ВидыИзделийПоКаталогу.КорпуснаяМебель);
	ВидыИзделий.Добавить(Справочники.ВидыИзделийПоКаталогу.КухняВерхний);
	ВидыИзделий.Добавить(Справочники.ВидыИзделийПоКаталогу.КухняНижний);
	ВидыИзделий.Добавить(Справочники.ВидыИзделийПоКаталогу.Комод);
	
	Запрос.УстановитьПараметр("СписокИзделийПоКаталогу", ТекущийОбъект.СписокИзделийПоКаталогу);
	Запрос.УстановитьПараметр("ВидыИзделий", ВидыИзделий);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокИзделийПоКаталогу.Изделие КАК Изделие,
	|	1 КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&СписокИзделийПоКаталогу КАК СписокИзделийПоКаталогу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Изделие,
	|	ВТ.Количество КАК Количество
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВЫРАЗИТЬ(ВТ.Изделие КАК Справочник.КаталогИзделий).ВидИзделияПоКаталогу В (&ВидыИзделий)
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выборка.Следующий();
	ТекущийОбъект.КоличествоКоробов = Выборка.Количество;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьПустуюСпецификацию()
	
	//Предварительная запись ПУСТОЙ спецификации при добавлении дверей или открытия формы ШкафПоКаталогу
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьУслугуДляМебельнойКромки(ТекущийОбъект, Строка, ИмяПоля, МалоразмернаяДеталь, КоэфКрупнаяДеталь)
	
	МебельнаяКромка = Строка[ИмяПоля];
	НоменклатурныеГруппы = Справочники.НоменклатурныеГруппы;
	ГруппаКромки = МебельнаяКромка.НоменклатурнаяГруппа;
	Услуга = Неопределено;
	МатериалЗаказчика = ТекущийОбъект.СписокМатериаловЗаказчика.Найти(МебельнаяКромка, "Номенклатура") <> Неопределено;
	
	Если НЕ ЗначениеЗаполнено(МебельнаяКромка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Срез = Ложь;
	
	ИмяПоля = ВРег(ИмяПоля);
	Если Найти(ИмяПоля,"ВЕРХ") <> 0 Тогда
		Радиус1 = "РадиусПравоВерх";
		Радиус2 = "РадиусЛевоВерх";
		Сторона = "ШиринаДетали";
	ИначеЕсли Найти(ИмяПоля, "НИЗ") <> 0 Тогда
		Радиус1 = "РадиусПравоНиз";
		Радиус2 = "РадиусЛевоНиз";
		Сторона = "ШиринаДетали";
		Срез = Строка["Срез"];
		
	ИначеЕсли Найти(ИмяПоля, "ЛЕВ") <> 0 Тогда
		Радиус1 = "РадиусЛевоНиз";
		Радиус2 = "РадиусЛевоВерх";
		Сторона = "ВысотаДетали";
	ИначеЕсли Найти(ИмяПоля, "ПРАВ") <> 0 Тогда
		Радиус1 = "РадиусПравоНиз";
		Радиус2 = "РадиусПравоВерх";
		Сторона = "ВысотаДетали";
		Срез = Строка["Срез"];
	КонецЕсли;
	
	Если ГруппаКромки = НоменклатурныеГруппы.КантАлюминиевый
		ИЛИ ГруппаКромки = НоменклатурныеГруппы.ТорцеваяРучка16мм
		ИЛИ ГруппаКромки = НоменклатурныеГруппы.ТорцеваяРучка18мм Тогда
		КоличествоУслуги = Строка.Количество; // по единице за сторону
	Иначе
		КоличествоУслуги = Строка[Сторона] * Строка.Количество / 1000;
	КонецЕсли;
	
	Радиус = Строка[Радиус1] + Строка[Радиус2];
	
	Если Радиус = 0 ИЛИ Срез Тогда
		Услуга = ПолучитьУслугуКромления(МебельнаяКромка, ОбщаяНоменклатура);
	Иначе
		Услуга = ОбщаяНоменклатура.КриволинейноеКромление;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Услуга) Тогда
		
		Если КоэфКрупнаяДеталь > 1 Тогда
			КоличествоУслуги = КоличествоУслуги * КоэфКрупнаяДеталь;
		КонецЕсли;
		
		ДобавитьСтроку(ТекущийОбъект, Услуга, КоличествоУслуги, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
		
	КонецЕсли;
	
	// Добавление отдельной услуги 'Кромление малоразмерной детали'
	
	Если МалоразмернаяДеталь Тогда
		
		КоличествоУслуги = Строка.Количество;
		Услуга = ОбщаяНоменклатура.КромлениеМалоразмернойДетали;
		ДобавитьСтроку(ТекущийОбъект, Услуга, КоличествоУслуги, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполнитьУслугиМебельнойКромки(ТекущийОбъект, Строка)
	
	Массив = Новый Массив;
	Массив.Добавить("ВыборМебельнойКромкиСверху");
	Массив.Добавить("ВыборМебельнойКромкиСнизу");
	Массив.Добавить("ВыборМебельнойКромкиСлева");
	Массив.Добавить("ВыборМебельнойКромкиСправа");
	МалоразмернаяДеталь = Строка.ШиринаДетали < 70 ИЛИ Строка.ВысотаДетали < 70;
	
	КрупнаяДеталь = (Строка.ШиринаДетали >= 1500 И Строка.ВысотаДетали >= 1200) ИЛИ (Строка.ШиринаДетали >= 1200 И Строка.ВысотаДетали >= 1500);
	
	Если КрупнаяДеталь Тогда
		КоэфКрупнаяДеталь = ЛексСервер.ПолучитьНастройкуПодразделения(ТекущийОбъект.Подразделение, Перечисления.ВидыНастроекПодразделений.КоэффициентНаКрупнуюДеталь);
		Если НЕ ЗначениеЗаполнено(КоэфКрупнаяДеталь) Тогда
			КоэфКрупнаяДеталь = 0;
		КонецЕсли;
	Иначе
		КоэфКрупнаяДеталь = 0;
	КонецЕсли;
	
	Для каждого ъ Из Массив Цикл
		ДобавитьУслугуДляМебельнойКромки(ТекущийОбъект, Строка, ъ, МалоразмернаяДеталь, КоэфКрупнаяДеталь);
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТаблицуСкладГотовойПродукции(фнОбъект)
	
	фнОбъект.СкладГотовойПродукции.Очистить();
	фнОбъект.ТребуетсяКомплектация = Ложь;
	
	Для каждого Строка Из фнОбъект.СписокНоменклатуры Цикл
		
		Номенклатура = Строка.Номенклатура;
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура,
		"ВидНоменклатуры, ПроцентОтхода, МестоОбработки, ЕдиницаИзмерения, НоменклатурнаяГруппа");
		
		Если (СтруктураРеквизитов.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Материал
			ИЛИ НЕ Строка.ЧерезСклад)
			И НЕ ЗначениеЗаполнено(Строка.ПоКаталогуМестоОбработки) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		фнОбъект.ТребуетсяКомплектация = Истина;
		Хлыстовой = СтруктураРеквизитов.НоменклатурнаяГруппа.ВидМатериала = Перечисления.ВидыМатериалов.Хлыстовой;
		КоличествоБезОтхода = Строка.КоличествоТребуется;
		КоличествоЦех = 0;
		КоличествоСклад = 0;
		
		Если ЗначениеЗаполнено(Строка.ПоКаталогуМестоОбработки) Тогда
			
			Если Строка.ПоКаталогуМестоОбработки = "Цех" Тогда
				
				КоличествоСклад = 0;
				КоличествоЦех = КоличествоБезОтхода;
				
			ИначеЕсли Строка.ПоКаталогуМестоОбработки = "Склад" Тогда
				
				КоличествоЦех = 0;
				КоличествоСклад = КоличествоБезОтхода;
				
			КонецЕсли
			
		Иначе
			
			Если СтруктураРеквизитов.МестоОбработки = Перечисления.МестоОбработки.Отгрузка
				ИЛИ Строка.НомерИзделия = 0 Тогда
				
				КоличествоЦех = 0;
				КоличествоСклад = КоличествоБезОтхода;
				
			ИначеЕсли СтруктураРеквизитов.МестоОбработки = Перечисления.МестоОбработки.ПоКаталогуВЦех
				И Строка.НомерИзделия <> 0 Тогда
				
				КоличествоСклад = 0;
				КоличествоЦех = КоличествоБезОтхода;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если КоличествоЦех > 0 ИЛИ КоличествоСклад > 0 Тогда
			
			СтрокаТЗ = фнОбъект.СкладГотовойПродукции.Найти(Номенклатура, "Номенклатура");
			
			Если СтрокаТЗ = Неопределено ИЛИ Хлыстовой Тогда
				
				НоваяСтрока = фнОбъект.СкладГотовойПродукции.Добавить();
				НоваяСтрока.Номенклатура = Номенклатура;
				НоваяСтрока.ЕдиницаИзмерения = СтруктураРеквизитов.ЕдиницаИзмерения;
				НоваяСтрока.КоличествоСклад = КоличествоСклад;
				НоваяСтрока.КоличествоЦех = КоличествоЦех;
				
			Иначе
				
				Если КоличествоСклад > 0 Тогда
					
					СтрокаТЗ.КоличествоСклад = СтрокаТЗ.КоличествоСклад + КоличествоСклад;
					
				ИначеЕсли КоличествоЦех > 0 Тогда
					
					СтрокаТЗ.КоличествоЦех = СтрокаТЗ.КоличествоЦех + КоличествоЦех;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// { Васильев Александр Леонидович [07.09.2017]
		// Добавляем обрезок от кратности.
		// Чтобы списалось комплектацией.
		Если Хлыстовой
			И КоличествоБезОтхода = 0
			И Строка.Количество > 0 Тогда
			
			НоваяСтрока = фнОбъект.СкладГотовойПродукции.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
			НоваяСтрока.ЕдиницаИзмерения = СтруктураРеквизитов.ЕдиницаИзмерения;
			НоваяСтрока.КоличествоСклад = Строка.Количество;
			НоваяСтрока.КоличествоЦех = 0;
			НоваяСтрока.ЭтоОбрезок = Истина;
			
		КонецЕсли;
		// } Васильев Александр Леонидович [07.09.2017]
		
	КонецЦикла;
	
	фнОбъект.СкладГотовойПродукции.Сортировать("Номенклатура Возр");
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаписатьСтрокуРаскроя(Спецификация, СвойстваРаскроя)
	
	НаборЗаписей = РегистрыСведений.РаскройДеталей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Спецификация); 
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	Запись.СтрокаРаскрой = СвойстваРаскроя.ДанныеДляРаскроя;
	Запись.ТекущаяСтрокаРаскроя = СвойстваРаскроя.ДанныеДляРаскроя;
	Запись.ТаблицаДеталей = СвойстваРаскроя.ТаблицаДеталей;
	Запись.СтрокаКривогоПилаФРС = СвойстваРаскроя.СтрокаКривогоПилаФРС;
	Запись.СтрокаКривогоПилаСтеколка = СвойстваРаскроя.СтрокаКривогоПилаСтеколка;
	Запись.Объект = Спецификация;
	Запись.АлгоритмРаскроя = СвойстваРаскроя.АлгоритмРаскроя;
	Запись.ВремяФормирования = ?(СвойстваРаскроя.ВремяФормирования > 0, СвойстваРаскроя.ВремяФормирования, Запись.ВремяФормирования);
	Запись.КоличествоДеталей = СвойстваРаскроя.КоличествоДеталей; 
	
	// В старом раскрое нет этого свойства.
	Если СвойстваРаскроя.Свойство("ЛучшийПроцентОтхода") Тогда
		Запись.ИдеальныйПроцентОтхода = СвойстваРаскроя.ЛучшийПроцентОтхода;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецФункции

&НаСервере
Функция ПосчитатьПрисадкиКриволинейнаяДеталь(СтрокаФлэш)
	
	ВсегоОтверстий = 0;
	ВсегоЕвропазов = 0;
	ВсегоОтверстийСтекло5_50 = 0;
	ВсегоОтверстийСтекло64 = 0;
	
	МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаФлэш, "#");
	ОтверстияКривДеталь = Новый Структура;
	
	Если МассивПодстрок.Количество() > 0 Тогда
		
		НужнаяСтрока = МассивПодстрок[2];
		ВторойМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НужнаяСтрока, "*");
		
		Если ВторойМассив.Количество() > 0 Тогда
			
			Для каждого Массив Из ВторойМассив Цикл
				
				Подмассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Массив, "_");
				
				Если Подмассив.Количество() > 0 Тогда
					
					Определитель = Подмассив[0];
					КоличествоОтверстийВРяду = 0;
					КоличествоРядовОтверстий = 0;
					КоличествоЕвропазов = 0;
					
					Если Определитель = "10" или Определитель = "11" или Определитель = "14" Тогда
						
						КоличествоОтверстийВРяду =Число(Подмассив[4]);
						КоличествоРядовОтверстий = Число(Подмассив[5]);
						
					ИначеЕсли Определитель = "12" Тогда
						
						КоличествоОтверстийВРяду = Число(Подмассив[3]);
						КоличествоРядовОтверстий = Число(Подмассив[5]);
						
					ИначеЕсли Определитель = "13" Тогда
						
						КоличествоЕвропазов = 1;
						
					ИначеЕсли (Определитель = "18" ИЛИ Определитель = "19" ИЛИ Определитель = "20" ИЛИ Определитель = "22") Тогда
						
						КоличествоОтверстийВРяду = 1;
						
					ИначеЕсли Определитель = "21" Тогда
						
						КоличествоОтверстийВРяду = 2;
						
					ИначеЕсли Определитель = "23" Тогда
						
						Диаметр = Число(Подмассив[3]);
						
						Если Диаметр = 64 Тогда
							
							ВсегоОтверстийСтекло64 = ВсегоОтверстийСтекло64 + 1;
							
						ИначеЕсли Диаметр >= 5 И Диаметр <= 50 Тогда
							
							ВсегоОтверстийСтекло5_50 = ВсегоОтверстийСтекло5_50 + 1;
							
						КонецЕсли;
						
					КонецЕсли;
					//КоличествоРядовОтверстий нельзя выносить, хоть и одинаковая строка. "Определитель" может быть не только эти цифры
					Попытка
						
						Если КоличествоОтверстийВРяду > 0 и КоличествоРядовОтверстий > 0 Тогда
							
							ВсегоОтверстий = ВсегоОтверстий + КоличествоОтверстийВРяду * КоличествоРядовОтверстий;
							
						ИначеЕсли КоличествоОтверстийВРяду > 0 Тогда
							
							ВсегоОтверстий = ВсегоОтверстий + КоличествоОтверстийВРяду;
							
						КонецЕсли;
						
						Если КоличествоЕвропазов > 0 Тогда
							
							ВсегоЕвропазов = ВсегоЕвропазов + КоличествоЕвропазов;
							
						КонецЕсли;
						
					Исключение
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В криволинейной детали выбрали ПРИСАДКУ ПОД ЕВРОВИНТ ТОРЦЕВУЮ");
						
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОтверстияКривДеталь.Вставить("КоличествоПрисадок", ВсегоОтверстий);
	ОтверстияКривДеталь.Вставить("КоличествоЕвропазов", ВсегоЕвропазов);
	ОтверстияКривДеталь.Вставить("ВсегоОтверстийСтекло5_50", ВсегоОтверстийСтекло5_50);
	ОтверстияКривДеталь.Вставить("ВсегоОтверстийСтекло64", ВсегоОтверстийСтекло64);
	
	Возврат ОтверстияКривДеталь;
	
КонецФункции

&НаСервере
Функция ИзделиеКрупногабаритное(ТекущийОбъект, ПлощадьИзготавливаемыхМатериалов)
	
	Крупное = Ложь;
	
	Для Каждого Деталь ИЗ ТекущийОбъект.СписокДеталей Цикл
		
		Площадь = (Деталь.ВысотаДетали * Деталь.ШиринаДетали) / (1000 * 1000);
		
		Если Площадь > 3 Тогда
			 Крупное = Истина;
			 Возврат Крупное;
		КонецЕсли;
		 
		Если Деталь.ВысотаДетали > 3500 ИЛИ Деталь.ШиринаДетали > 3500 Тогда
			 Крупное = Истина;
			 Возврат Крупное;
		КонецЕсли;
		 
	КонецЦикла;
	
	КоличествоМетров = ЛексСервер.ПолучитьНастройкуПодразделения(ТекущийОбъект.Подразделение, Перечисления.ВидыНастроекПодразделений.БольшойШкаф, ТекущийОбъект.Дата);
				
	Если ПлощадьИзготавливаемыхМатериалов > КоличествоМетров Тогда
		 Крупное = Истина;
	КонецЕсли;
	 
	Возврат Крупное;
	
КонецФункции

&НаСервере
Функция ЗаполнитьУслуги(ТекущийОбъект)
	
	Метр = 1000;
	МетрКв = Метр * Метр;
	
	Номенклатура = ОбщаяНоменклатура;
	
	СправочникиНоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы;
	ПлощадьУпаковываемыхМатериалов = 0;
	ПлощадьИзготавливаемыхМатериалов = 0;
	ПлощадьГравировок = 0;
	
	ИзделиеДетали = ТекущийОбъект.Изделие.ЭтоДетали;
	ИзделиеШкаф = (ТекущийОбъект.Изделие.ВидИзделия = Перечисления.ВидыИзделий.ШкафКупе);
	ИзделиеКорпуснаяМебель = (ТекущийОбъект.Изделие.ВидИзделия = Перечисления.ВидыИзделий.КорпуснаяМебель);
	
	//Получить данные об упаковке и сборке коробов
	
	УпаковкаПоКаталогу = Новый Структура;
	
	Для Каждого ИзделиеК Из ТекущийОбъект.СписокИзделийПоКаталогу Цикл
		
		Стр = Новый Структура;
		Стр.Вставить("Сборка", ИзделиеК.Сборка);
		
		УпаковкаПоКаталогу.Вставить("Строка" + ИзделиеК.НомерСтроки, Стр);
		
	КонецЦикла;
	
	Если ТекущийОбъект.Изделие.Серийное Тогда
		
		КоличествоЧасов = 0;
		Для каждого Строка Из ТекущийОбъект.СписокИзделийПоКаталогу Цикл
			КоличествоЧасов = КоличествоЧасов + Строка.Изделие.КоличествоЧасов;
		КонецЦикла;
		
		ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.НормоЧасСерийногоИзделия, КоличествоЧасов, 0);
		
	Иначе
		
		#ОБЛАСТЬ ОСНОВНОЙ_ЦИКЛ
		
		Для каждого Строка Из ТекущийОбъект.СписокДеталей Цикл
			
			ЗаполнитьОбгонкуУгловКромки(ТекущийОбъект, Строка);
			
			МатериалЗаказчика = ТекущийОбъект.СписокМатериаловЗаказчика.Найти(Строка.Номенклатура, "Номенклатура") <> Неопределено;
			
			КосойПил = Строка.КосойПил;
			КантыИзРедактора = Строка.КантыИзРедактора;
			
			Если КосойПил > 0 Тогда
				
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.КосойПил, КосойПил * Строка.Количество, Строка.НомерИзделия,,,,,,МатериалЗаказчика);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КантыИзРедактора) Тогда
				
				КантыИзРедактора = ЗначениеИзСтрокиВнутр(КантыИзРедактора);
				МассивКантов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КантыИзРедактора, "|");
				
				Для Каждого СтрокаКант Из МассивКантов Цикл
					
					ПараметрыКанта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаКант , "_");
					НоменклатурныйНомер = ПараметрыКанта[0];
					ДлинаКанта = Число(ПараметрыКанта[1]);
					ТипКромления = Число(ПараметрыКанта[2]);
					
					Если НоменклатурныйНомер = "bevelCut" Тогда
						
						Услуга = ОбщаяНоменклатура.ПилПодУглом;
						ДобавитьСтроку(ТекущийОбъект, Услуга, Строка.Количество, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
						
					Иначе
						
						НоменклатураКант = Справочники.Номенклатура.НайтиПоКоду(НоменклатурныйНомер);
						
						Если ТипКромления = 0 Тогда
							Услуга = ПолучитьУслугуКромления(НоменклатураКант, ОбщаяНоменклатура);
						Иначе
							Услуга = ОбщаяНоменклатура.КриволинейноеКромление;
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Услуга) Тогда
							ДобавитьСтроку(ТекущийОбъект, Услуга, ДлинаКанта / 1000 * Строка.Количество, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			ДанныеДетали = ПолучитьДанныеДетали(Строка.ВидДетали);
			СтрокаНоменклатура = Строка.Номенклатура;
			НоменклатураДляСклеивания = Строка.НоменклатураДляСклеивания;
			Ручка = Строка.Ручка;
			НоменклатурнаяГруппа = СтрокаНоменклатура.НоменклатурнаяГруппа;
			
			Клееная = ДанныеДетали.Клееная;
			КоличествоДеталей = Строка.Количество;
			ВысотаДетали = Строка.ВысотаДетали;
			ШиринаДетали = Строка.ШиринаДетали;
			ДлинаКривогоПила = Число(Строка.ДлинаКривогоПила);
			Периметр = Число(Строка.Периметр);
			Обтачивать = Строка.Обтачивать;
			Постформинг = Строка.Постформинг;
			ЭтоФасад = ДанныеДетали.ЭтоФасад;
			
			Если ЭтоФасад И ЗначениеЗаполнено(Ручка) Тогда
				
				ДопУслуга = Ручка.ДополнительнаяУслуга;
				
				Если ЗначениеЗаполнено(ДопУслуга) Тогда
					ДобавитьСтроку(ТекущийОбъект, ДопУслуга, Строка.Количество, Строка.НомерИзделия);
				КонецЕсли;
				
			КонецЕсли;
			
			ШиринаВставки = СтрокаНоменклатура.ГлубинаДетали;
			ШиринаПаза = ?(ЗначениеЗаполнено(Строка.УниверсальнаяКромка), Строка.УниверсальнаяКромка.ШиринаПаза, 0);
			
			ОтверстийподРучку = 0;
			
			Если ДанныеДетали.ЭтоСтекло И ЗначениеЗаполнено(Ручка) Тогда
				
				ОтверстийподРучку = 2;
				
			КонецЕсли;
			
			КоличествоПетель = Строка.КоличествоПетель;
			
			ПлощадьГравировки = 0;
			КоличествоПрисадок = 0;
			КоличествоЕвропазов = 0;
			
			Если ЗначениеЗаполнено(Строка.СтрокаДляФлэш) Тогда
				
				СтруктураПрисадок = ПосчитатьПрисадкиКриволинейнаяДеталь(Строка.СтрокаДляФлэш);
				КоличествоПрисадок = СтруктураПрисадок.КоличествоПрисадок;
				КоличествоЕвропазов = СтруктураПрисадок.КоличествоЕвропазов;
				КоличествоОтверстийСтекло5_50 = СтруктураПрисадок.ВсегоОтверстийСтекло5_50;
				КоличествоОтверстийСтекло64 = СтруктураПрисадок.ВсегоОтверстийСтекло64;
				
				Если КоличествоПрисадок > 0 Тогда
					
					Если НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.СтеклоДляСкругляемогоФасада
						ИЛИ НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.Стекло
						ИЛИ НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.Зеркало Тогда
						
						ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.СверлениеВСтеклеДо5мм, КоличествоПрисадок * Строка.Количество, Строка.НомерИзделия);
						
					Иначе
						
						ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ПрисадкаИндивидуальная, КоличествоПрисадок * Строка.Количество, Строка.НомерИзделия);
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если КоличествоЕвропазов > 0 Тогда
					
					ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.УслугаЕвропаз, КоличествоЕвропазов * Строка.Количество, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
					
				КонецЕсли;
				
				Если КоличествоОтверстийСтекло5_50 > 0 Тогда
					
					ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.СверлениеВСтеклеСвыше5мм, КоличествоОтверстийСтекло5_50 * Строка.Количество, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
					
				КонецЕсли;
				
				Если КоличествоОтверстийСтекло64 > 0 Тогда
					
					ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.СверлениеВСтеклеПодРозетку64, КоличествоОтверстийСтекло64 * Строка.Количество, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
					
				КонецЕсли;
				
			КонецЕсли;
			
			МассивСтроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка.СтрокаДляФлэш, "#");
			
			Если МассивСтроки.Количество() > 3 Тогда
				
				ПлощадьГравировки = Число(МассивСтроки[3]) / 1000000 * КоличествоДеталей;
				
				Если ПлощадьГравировки > 0 Тогда
					
					ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.Гравировка, ПлощадьГравировки, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДанныеДетали.СчитатьПлощадь Тогда
				
				ПлощадьИзготавливаемыхМатериалов = ПлощадьИзготавливаемыхМатериалов + ВысотаДетали * ШиринаДетали * КоличествоДеталей / МетрКв;
				
			КонецЕсли;
			
			Для Каждого Эл Из ДанныеДетали.Услуги Цикл
				
				Эл = Эл.Значение;
				КоличествоУслуги = 0;
				
				Попытка
					
					Выполнить("КоличествоУслуги = " + Эл.Количество);
					КоличествоУслуги = КоличествоУслуги * КоличествоДеталей;
					
					Если КоличествоУслуги > 0 Тогда
						
						ЭлУслуга = Эл.Услуга;
						
						Если ТипЗнч(ЭлУслуга) = Тип("СправочникСсылка.ОбщаяНоменклатура") Тогда
							ЭлУслуга = ЛексСервер.ПолучитьНоменклатуру(ОбщаяНоменклатура, ЭлУслуга);
						КонецЕсли;
						
						ДобавитьСтроку(ТекущийОбъект, ЭлУслуга, КоличествоУслуги, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
						
					КонецЕсли;
					
				Исключение
					
					Сообщить("Ошибка при формировании формулы: №001");
					
				КонецПопытки;
				
			КонецЦикла;
			
			Если НЕ ДанныеДетали.СпецФасад Тогда
				
				ЗаполнитьУслугиМебельнойКромки(ТекущийОбъект, Строка);
				
			КонецЕсли;
			
			//RonEXI: Удалить позже когда Костя перенесет эти услуги в другое место.
			
			СтруктураОтверстий = Строка.СтруктураОтверстий;
			
			Если НЕ ДанныеДетали.ЭтоФасад И ЗначениеЗаполнено(СтруктураОтверстий) Тогда
				
				ТаблицаОтверстий = ЗначениеИзСтрокиВнутр(СтруктураОтверстий);
				
				Для Каждого Элемент Из ТаблицаОтверстий Цикл
					
					Если Элемент.ВидОтверстий = Перечисления.ВидыОтверстий.Европаз Тогда
						Услуга = ОбщаяНоменклатура.УслугаЕвропаз;
					ИначеЕсли Элемент.ВидОтверстий=Перечисления.ВидыОтверстий.ОбратнаяПрисадка Тогда
						Услуга = ОбщаяНоменклатура.ОбратнаяПрисадка;
					ИначеЕсли Элемент.ВидОтверстий=Перечисления.ВидыОтверстий.ПрисадкаПодСтяжки Тогда
						Услуга = ОбщаяНоменклатура.ПрисадкаПодСтяжки;
					Иначе
						Услуга = ОбщаяНоменклатура.УслугаПрисадка;
					КонецЕсли;
					
					Если НЕ Услуга = ОбщаяНоменклатура.УслугаЕвропаз Тогда
						ДобавитьСтроку(ТекущийОбъект, Услуга, Элемент.Количество * Строка.Количество, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			//RonEXI Новый европаз из формы детали.
			
			КоличествоЕвропазов = (Строка.ЕвропазВерх > 0) + (Строка.ЕвропазНиз > 0) + (Строка.ЕвропазЛево > 0) + (Строка.ЕвропазПраво > 0);
			
			Если КоличествоЕвропазов > 0 Тогда
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.УслугаЕвропаз, КоличествоЕвропазов * Строка.Количество, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
			КонецЕсли;
			
			Если Строка.НомерИзделия = 0 Тогда
				
				ПлощадьУпаковываемыхМатериалов = ПлощадьУпаковываемыхМатериалов + ВысотаДетали * ШиринаДетали * (Клееная + 1) * КоличествоДеталей / МетрКв;
				
			Иначе
				
				ДанныеИзделия = УпаковкаПоКаталогу["Строка"+Строка.НомерИзделия];
				
				Если НЕ ДанныеИзделия.Сборка Тогда
					
					ПлощадьУпаковываемыхМатериалов = ПлощадьУпаковываемыхМатериалов + ВысотаДетали * ШиринаДетали * (Клееная + 1) * КоличествоДеталей / МетрКв;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		#КОНЕЦОБЛАСТИ
		
		#ОБЛАСТЬ ЯЩИКИ
		
		Для каждого Строка Из ТекущийОбъект.СписокЯщики Цикл
			
			//Изготовление
			УслугаИзготовления = ЛексСерверПовтИсп.ПолучитьОбщуюНоменклатуру(Строка.СхемаЯщика.УслугаИзготовления, ТекущийОбъект.Подразделение);
			Если ЗначениеЗаполнено(УслугаИзготовления) Тогда
				ДобавитьСтроку(ТекущийОбъект, УслугаИзготовления, Строка.КоличествоЯщиков, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
			Иначе
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ИзготовлениеЯщика, Строка.КоличествоЯщиков, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
			КонецЕсли;
			
			//Склеивание и торцовка для пластика
			Если Строка.ВидФасада <> "Нет" И Строка.ФасадНоменклатура.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.Пластик Тогда 
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.СклеиваниеЛДСПЗонаКромки, Строка.КоличествоЯщиков, Строка.НомерИзделия);
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ТорцовкаСклеенойДеталиЗонаФРС, Строка.КоличествоЯщиков, Строка.НомерИзделия);
			КонецЕсли;
			
			//Криволинейный выпил под ручку
			Если Строка.КриволинейныйВыпилПодРучку И (Строка.ВидФасада <> "Нет") Тогда
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.КриволинейныйВыпилПодРучку, Строка.КоличествоЯщиков, Строка.НомерИзделия);
			КонецЕсли;
			
			//Накручивание ручки
			Если Строка.КоличествоЯщиков > 0 И Строка.КоличествоРучек > 0 И (НЕ Строка.КриволинейныйВыпилПодРучку) Тогда
				
				Если (Строка.ВидФасада <> "Нет") И ЗначениеЗаполнено(Строка.РучкаНоменклатура) Тогда
					
					ДопУслуга = Строка.РучкаНоменклатура.ДополнительнаяУслуга;
					
					Если ЗначениеЗаполнено(ДопУслуга) Тогда
						ДобавитьСтроку(ТекущийОбъект, ДопУслуга, Строка.КоличествоЯщиков * Строка.КоличествоРучек, Строка.НомерИзделия);
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Строка.НомерИзделия) Тогда
					
					ЕстьСборкаКороба = Ложь;
					Если ИзделиеКорпуснаяМебель Тогда
						
						ИзделиеПоКаталогуЯщика = ТекущийОбъект.СписокИзделийПоКаталогу.Найти(Строка.НомерИзделия, "НомерСтроки");
						
						Если ЗначениеЗаполнено(ИзделиеПоКаталогуЯщика) Тогда
							ЕстьСборкаКороба = ИзделиеПоКаталогуЯщика.Сборка;
						КонецЕсли;
						
					КонецЕсли;
					
					Если ИзделиеДетали ИЛИ ИзделиеШкаф ИЛИ (ИзделиеКорпуснаяМебель И ЕстьСборкаКороба) Тогда
						ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.НакручиваниеРучкиНаЛДСПФасадЯщика, Строка.КоличествоЯщиков * Строка.КоличествоРучек, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
					КонецЕсли;
					
				Иначе
					
					Если Строка.ВидФасада <> "Нет" Тогда
						ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.НакручиваниеРучкиНаЛДСПФасадЯщика, Строка.КоличествоЯщиков * Строка.КоличествоРучек, Строка.НомерИзделия,,,,,, МатериалЗаказчика);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			//////////////////
			
			НомерСтрокиЯщика = Строка.НомерСтроки;
			
			Для Каждого ДетальЯщика Из ТаблицаДеталиЯщиков Цикл
				
				Если ДетальЯщика.НомерСтроки = НомерСтрокиЯщика Тогда
					
					//Фасад распил
					Если ДетальЯщика.Тип = Перечисления.ВидыДеталейЯщиков.Фасад Тогда
						
						Если ЗначениеЗаполнено(ДетальЯщика.КромкаНоменклатура)
							И ДетальЯщика.КромкаНоменклатура.ГлубинаДетали >=1 Тогда
							
							ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ОбгонкаУглов, 4*Строка.КоличествоЯщиков, ДетальЯщика.НомерИзделия);
							
						КонецЕсли;
						
						Если ЗначениеЗаполнено(ДетальЯщика.КромкаНоменклатура) И ДетальЯщика.КромкаНоменклатура.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.АГТПрофиль Тогда
							
							ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.СборкаАГТФасада, ДетальЯщика.Количество, ДетальЯщика.НомерИзделия,,,,,, МатериалЗаказчика);
							ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ИзготовлениеДеревяннойДеталиСтекольнаяЗона, ДетальЯщика.Количество, ДетальЯщика.НомерИзделия,,,,,, МатериалЗаказчика);
							
							ШиринаВставки = ДетальЯщика.Номенклатура.ГлубинаДетали;
							ШиринаПаза = ДетальЯщика.КромкаНоменклатура.ШиринаПаза;
							
							Если ШиринаПаза < ШиринаВставки Тогда
								
								ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ФрезеровкаДеталиЗонаКухонь, ДетальЯщика.Количество, ДетальЯщика.НомерИзделия,,,,,, МатериалЗаказчика);
								
							КонецЕсли;
							
						Иначе
							
							ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.РаспилЗаДеталь, ДетальЯщика.Количество, ДетальЯщика.НомерИзделия,,,,,, МатериалЗаказчика);
							
						КонецЕсли;
						
					КонецЕсли;
					
					//Дно распил
					Если ДетальЯщика.Тип = Перечисления.ВидыДеталейЯщиков.Дно Тогда
						Если ДетальЯщика.Номенклатура.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ЛДСП10 Тогда
							ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ИзготовлениеДеревяннойДеталиСтекольнаяЗона, ДетальЯщика.Количество, ДетальЯщика.НомерИзделия,,,,,, МатериалЗаказчика);
						Иначе
							ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.РаспилЗаДеталь, ДетальЯщика.Количество, ДетальЯщика.НомерИзделия,,,,,, МатериалЗаказчика);
						КонецЕсли;
					КонецЕсли;
					
					//Корпус распил
					Если ДетальЯщика.НомерСтроки = НомерСтрокиЯщика
						И ДетальЯщика.Тип = Перечисления.ВидыДеталейЯщиков.Корпус Тогда
						ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.РаспилЗаДеталь, ДетальЯщика.Количество, ДетальЯщика.НомерИзделия,,,,,, МатериалЗаказчика);
					КонецЕсли;
					
					//Кромление
					Если ЗначениеЗаполнено(ДетальЯщика.КромкаНоменклатура) Тогда
						Если ДетальЯщика.КромкаНоменклатура.ГлубинаДетали > 1 Тогда
							УслугаКромки = ОбщаяНоменклатура.КромлениеТолстойКромки;
						ИначеЕсли ДетальЯщика.КромкаНоменклатура.ГлубинаДетали = 1 Тогда
							УслугаКромки = ОбщаяНоменклатура.КромлениеСреднейКромки;
						Иначе
							УслугаКромки = ОбщаяНоменклатура.КромлениеТонкойКромки;
						КонецЕсли;
					Иначе
						УслугаКромки = Неопределено;
					КонецЕсли;
					
					//Отверстия
					
					СтруктураОтверстийЯщик = ДетальЯщика.СтруктураОтверстий;
					
					Если ЗначениеЗаполнено(СтруктураОтверстийЯщик) Тогда
						
						ТаблицаОтверстийЯщик = ЗначениеИзСтрокиВнутр(СтруктураОтверстийЯщик);
						
						Для Каждого Элемент Из ТаблицаОтверстийЯщик Цикл
							
							Если Элемент.ВидОтверстий = Перечисления.ВидыОтверстий.Европаз Тогда
								Услуга = ОбщаяНоменклатура.УслугаЕвропаз;
							ИначеЕсли Элемент.ВидОтверстий=Перечисления.ВидыОтверстий.ОбратнаяПрисадка Тогда
								Услуга = ОбщаяНоменклатура.ОбратнаяПрисадка;
							ИначеЕсли Элемент.ВидОтверстий=Перечисления.ВидыОтверстий.ПрисадкаПодСтяжки Тогда
								Услуга = ОбщаяНоменклатура.ПрисадкаПодСтяжки;
							Иначе
								Услуга = ОбщаяНоменклатура.УслугаПрисадка;
							КонецЕсли;
							
							Если НЕ (Услуга = ОбщаяНоменклатура.УслугаЕвропаз) Тогда
								ДобавитьСтроку(ТекущийОбъект, Услуга, Элемент.Количество * ДетальЯщика.Количество, ДетальЯщика.НомерИзделия);
							КонецЕсли;
								
						КонецЦикла;
						
					КонецЕсли;
					
					ДлинаКромки = ?(ЗначениеЗаполнено(ДетальЯщика.ВыборМебельнойКромкиСверху), ДетальЯщика.ШиринаДетали, 0) +
					?(ЗначениеЗаполнено(ДетальЯщика.ВыборМебельнойКромкиСнизу), ДетальЯщика.ШиринаДетали,0) +
					?(ЗначениеЗаполнено(ДетальЯщика.ВыборМебельнойКромкиСлева), ДетальЯщика.ВысотаДетали,0) +
					?(ЗначениеЗаполнено(ДетальЯщика.ВыборМебельнойКромкиСправа), ДетальЯщика.ВысотаДетали,0);
					
					Если ЗначениеЗаполнено(УслугаКромки) Тогда
						ДобавитьСтроку(ТекущийОбъект, УслугаКромки, ДетальЯщика.Количество * ДлинаКромки / 1000, ДетальЯщика.НомерИзделия);
					КонецЕсли;
					
					ПлощадьИзготавливаемыхМатериалов = ПлощадьИзготавливаемыхМатериалов + ДетальЯщика.Количество * (ДетальЯщика.ШиринаДетали * ДетальЯщика.ВысотаДетали) / 1000000;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		#КОНЕЦОБЛАСТИ
		
		Если ТекущийОбъект.ПакетУслуг = Перечисления.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж Тогда
			
			ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.СборкаИзделия, ПлощадьИзготавливаемыхМатериалов, 0);
			
			Если НЕ ТекущийОбъект.Изделие.ВидИзделия = Перечисления.ВидыИзделий.Кухня Тогда
				
				УслугаТарифЗаСборку = ОбщаяНоменклатура.ТарифЗаСборку;
				
				БольшоеИзделие = Ложь;
				
				КоличествоМетров = ЛексСервер.ПолучитьНастройкуПодразделения(ТекущийОбъект.Подразделение, Перечисления.ВидыНастроекПодразделений.БольшойШкаф, ТекущийОбъект.Дата);
				
				Если ЗначениеЗаполнено(КоличествоМетров) Тогда
					
					БольшоеИзделие = ПлощадьИзготавливаемыхМатериалов > КоличествоМетров;
					
				КонецЕсли;
				
				Если БольшоеИзделие Тогда 
					ДобавитьСтроку(ТекущийОбъект, УслугаТарифЗаСборку, 1, 0);
				КонецЕсли;
				
			Иначе
				
				УслугаТарифЗаСборку = ОбщаяНоменклатура.ТарифЗаСборкуКухни;
				
			КонецЕсли;
			
			ДобавитьСтроку(ТекущийОбъект, УслугаТарифЗаСборку, 1, 0);
			
			Если ТекущийОбъект.Километраж > 0 Тогда
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ПроездМонтажникаЗаГородом, Объект.Километраж, 0);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекущийОбъект.Упаковка Тогда
			
			ЛистГофрокартона = 2800 * 1000 / МетрКв;
			ПолЛистаГофрокартона = ЛистГофрокартона / 2;
			ЧетвертьЛистаГофрокартона = ПолЛистаГофрокартона / 2;
			
			//Упаковка отдельных деталей
			ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.УпаковкаДеталей, ПлощадьУпаковываемыхМатериалов, 0);
			
			Если ПлощадьУпаковываемыхМатериалов > 0 Тогда
				
				КартонДляДеталей = ОкрВверх(ПлощадьУпаковываемыхМатериалов) * ЧетвертьЛистаГофрокартона;
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.Гофрокартон, КартонДляДеталей, 0);
				
			КонецЕсли;
			
			// Упаковка дверей
			КоличествоДверей = 0;
			Для каждого Дверь ИЗ ТекущийОбъект.СписокДверей Цикл
				КоличествоДверей = КоличествоДверей + ЛексСервер.ЗначениеРеквизитаОбъекта(Дверь.Двери, "Количество");
			КонецЦикла;
			
			Если КоличествоДверей > 0 Тогда
				
				КоличествоУпаковок = Окр(КоличествоДверей / 2 + 0.5, 0, РежимОкругления.Окр15как10);
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.УпаковкаДверей, КоличествоУпаковок, 0);
				
				КартонДляДверей = ?(КоличествоДверей < 3, ЛистГофрокартона * 3,ЛистГофрокартона * 4);
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.Гофрокартон, КартонДляДверей, 0);
				
			КонецЕсли;
			
			//Упаковка ящиков
			Для Каждого Строка Из ТекущийОбъект.СписокЯщики Цикл
				
				Если Строка.НомерИзделия = 0 Тогда
					
					ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.Гофрокартон, ПолЛистаГофрокартона * Строка.КоличествоЯщиков, 0);
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Упаковка кухонных коробов.
			КоличествоКоробовДляУпаковки = 0;
			Для каждого Строка Из ТекущийОбъект.СписокИзделийПоКаталогу Цикл
				
				Если Строка.Сборка Тогда
					КоличествоКоробовДляУпаковки = КоличествоКоробовДляУпаковки + 1;
				КонецЕсли;
				
			КонецЦикла;
			
			Если КоличествоКоробовДляУпаковки > 0 Тогда
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.УпаковкаКороба, КоличествоКоробовДляУпаковки, 0);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекущийОбъект.ПакетУслуг <> Перечисления.ПакетыУслуг.СамовывозОтПроизводителя Тогда
			
			Если ТекущийОбъект.ПакетУслуг = Перечисления.ПакетыУслуг.ДоставкаДоТранспортнойКомпании Тогда
				Этаж = 1;
			Иначе
				
				АдресСтруктурой = ЛексСервер.ПолучитьСтруктуруИзАдреса(ТекущийОбъект.АдресМонтажа);
				
				Если ЗначениеЗаполнено(АдресСтруктурой.Этаж) Тогда
					Этаж = Число(АдресСтруктурой.Этаж);
				Иначе 
					Этаж = 1;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТекущийОбъект.ПакетУслуг = Перечисления.ПакетыУслуг.ДоставкаДоОфиса Тогда
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ДоставкаДоОфиса, 1, 0);
			Иначе
				
				Если ИзделиеКрупногабаритное(ТекущийОбъект, ПлощадьИзготавливаемыхМатериалов) Тогда
					ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ПодъемКрупногабаритногоИзделия, Этаж, 0);
				Иначе
					ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ПодъемИзделияНаЭтаж, Этаж, 0);
				КонецЕсли;
				
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ДоставкаПоГороду, 1, 0);
			КонецЕсли;
			
			РасстояниеДоЗавода = ТекущийОбъект.Офис.РасстояниеДоЗавода;
			
			Если ТекущийОбъект.ПакетУслуг <> Перечисления.ПакетыУслуг.ДоставкаДоТранспортнойКомпании
				И (ТекущийОбъект.Километраж > 0 ИЛИ РасстояниеДоЗавода > 0) Тогда
				ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ДоставкаЗаГородом, ТекущийОбъект.Километраж + РасстояниеДоЗавода, 0);
			КонецЕсли;
			
		КонецЕсли;
		
		// Сборка Коробов
		
		ТекущийОбъект.КоробаРедактированы = Ложь;
		
		СписокДеталей = ТекущийОбъект.СписокДеталей.Выгрузить();
		СписокИзделий = ТекущийОбъект.СписокИзделийПоКаталогу.Выгрузить();
		
		Для Каждого ИзделиеК ИЗ СписокИзделий Цикл
			
			РасположениеСлева = (ИзделиеК.Расположение = Перечисления.ВидыПрисоединенныхФайлов.КартинкаЛевая);
			
			Если ИзделиеК.Сборка
				И (ИзделиеК.Изделие.ВидИзделияПоКаталогу = Справочники.ВидыИзделийПоКаталогу.КухняВерхний 
				ИЛИ ИзделиеК.Изделие.ВидИзделияПоКаталогу = Справочники.ВидыИзделийПоКаталогу.КухняНижний) Тогда
				
				СписокДеталейКороба = ИзделиеК.Изделие.СписокДеталей.Выгрузить();
				ДетальРедактированная = Ложь;
				
				//Размеры изделия
				ШиринаИзделия = ИзделиеК.ШиринаИзделия;
				ВысотаИзделия = ИзделиеК.ВысотаИзделия;
				ГлубинаИзделия = ИзделиеК.ГлубинаИзделия;
				Европаз = ИзделиеК.Европаз;
				Столешница = ИзделиеК.Столешница;
				ГлубинаМатериала = ИзделиеК.НоменклатураЛДСП.ГлубинаДетали;
				ГлубинаМатериалаДоп = ИзделиеК.НоменклатураЛДСПДоп.ГлубинаДетали;
				
				Для Каждого ЭлементКороба Из СписокДеталейКороба Цикл
					
					МассивДеталиКороба = СписокДеталей.НайтиСтроки(Новый Структура("НомерИзделия, НомерДеталиИзделия", ИзделиеК.НомерСтроки, ЭлементКороба.НомерСтроки));
					
					Если МассивДеталиКороба.Количество() = 1 Тогда
						
						ТекущаяДеталь = МассивДеталиКороба[0];
						
						ТорцеваяЛента = Новый Структура;
						
						ТорцеваяЛента.Вставить("ТорцеваяЛентаСверху", ТекущаяДеталь.ВыборМебельнойКромкиСверху);
						ТорцеваяЛента.Вставить("ТорцеваяЛентаСнизу", ТекущаяДеталь.ВыборМебельнойКромкиСнизу);
						ТорцеваяЛента.Вставить("ТорцеваяЛентаСлева", ТекущаяДеталь.ВыборМебельнойКромкиСлева);
						ТорцеваяЛента.Вставить("ТорцеваяЛентаСправа", ТекущаяДеталь.ВыборМебельнойКромкиСправа);
						
						РазмерыКромок = Документы.Спецификация.ПолучитьРазмерыМатериалов(ТекущаяДеталь.Номенклатура, ТорцеваяЛента);
						
						НоваяВысотаДетали = 0;
						НоваяШиринаДетали = 0;
						НоваяКоличество = 0;
						
						Попытка
							Выполнить("НоваяВысотаДетали = " + ЭлементКороба.ВысотаДетали);
							НоваяВысотаДетали = НоваяВысотаДетали - РазмерыКромок.ВычитаемоеДляВысоты;
						Исключение
							НоваяВысотаДетали = ТекущаяДеталь.ВысотаДетали;
						КонецПопытки;
						
						Попытка
							Выполнить("НоваяШиринаДетали = " + ЭлементКороба.ШиринаДетали);
							НоваяШиринаДетали = НоваяШиринаДетали - РазмерыКромок.ВычитаемоеДляШирины;
						Исключение
							НоваяШиринаДетали = ТекущаяДеталь.ШиринаДетали;
						КонецПопытки;
						
						Попытка
							Выполнить("НоваяКоличество = " + ЭлементКороба.Количество);
						Исключение
							НоваяКоличество = ТекущаяДеталь.Количество;
						КонецПопытки;
						
						//RonEXI: Не проверяем петли и пазы. Не проверяем если удалили фасад.
						
						ДетальРедактированная = (НЕ ТекущаяДеталь.ВидДетали.ЭтоФасад И ТекущаяДеталь.ВидДетали <> ЭлементКороба.ВидДетали)
						//ИЛИ ТекущаяДеталь.ДиаметрПазов <> ЭлементКороба.ДиаметрПазов
						//ИЛИ ТекущаяДеталь.КоличествоПетель <> ЭлементКороба.КоличествоПетель
						ИЛИ ТекущаяДеталь.Обтачивать <> ЭлементКороба.Обтачивать
						//ИЛИ ТекущаяДеталь.Петли <> ЭлементКороба.Петли
						ИЛИ ТекущаяДеталь.Срез <> ЭлементКороба.Срез;
						//RonEXI: Вернуть когда придумаем как обойти нулевые детали.
						//ИЛИ ТекущаяДеталь.Количество <> НоваяКоличество;
						
						Если НЕ ДетальРедактированная Тогда
							
							Если Окр(ТекущаяДеталь.ВысотаДетали) <> Окр(НоваяВысотаДетали)
								ИЛИ Окр(ТекущаяДеталь.ШиринаДетали) <> Окр(НоваяШиринаДетали) Тогда
								
								ДетальРедактированная = Истина;
								
							КонецЕсли;
							
							//RonEXI: Тут проверка на повернутый фасад. У нас нет этой галочки в списке деталей. А из каталога дергать геморно.
							
							Если ДетальРедактированная И ТекущаяДеталь.ВидДетали.ЭтоФасад Тогда
								
								Если Окр(ТекущаяДеталь.ВысотаДетали) = Окр(НоваяШиринаДетали)
									И Окр(ТекущаяДеталь.ШиринаДетали) = Окр(НоваяВысотаДетали) Тогда
									
									ДетальРедактированная = Ложь;
									
								КонецЕсли;
								
							КонецЕсли;
							
							///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
							
						КонецЕсли;
						
						Если ДетальРедактированная Тогда
							Прервать;
						КонецЕсли;
						
					Иначе
						
						Если НЕ ЭлементКороба.ВидДетали.ЭтоФасад Тогда	
							ДетальРедактированная = Истина;
							Прервать;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ДетальРедактированная Тогда
					
					ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.НадбавкаЗаИзменениеКонструкции, 1, ИзделиеК.НомерСтроки);
					ТекущийОбъект.КоробаРедактированы = Истина;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИзделиеК.Изделие.УслугаСборки) Тогда
					УслугаСборки = ЛексСервер.ПолучитьНоменклатуру(Номенклатура, ИзделиеК.Изделие.УслугаСборки);
					ДобавитьСтроку(ТекущийОбъект, УслугаСборки, 1, ИзделиеК.НомерСтроки);
				КонецЕсли;
				
			ИначеЕсли ИзделиеК.Сборка И ЗначениеЗаполнено(ИзделиеК.Изделие.УслугаСборки) Тогда 	
				УслугаСборки = ЛексСервер.ПолучитьНоменклатуру(Номенклатура, ИзделиеК.Изделие.УслугаСборки);
				ДобавитьСтроку(ТекущийОбъект, ИзделиеК.Изделие.УслугаСборки, 1, ИзделиеК.НомерСтроки);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПодготовкаЛистовогоМатериала(ТекущийОбъект);
		
	КонецЕсли; // НЕ ТекущийОбъект.Изделие.Серийное
	
	ТекущийОбъект.ПлощадьСборкиИзделия = ПлощадьИзготавливаемыхМатериалов;
	
КонецФункции // ЗаполнитьУслуги()

&НаСервере
Процедура ЗаполнитьОбгонкуУгловКромки(ТекущийОбъект, Деталь)
	
	КоличествоУслуги = 0;
	
	Если Деталь.РадиусЛевоВерх = 0
		И ЗначениеЗаполнено(Деталь.ВыборМебельнойКромкиСверху)
		И Деталь.ВыборМебельнойКромкиСверху.ГлубинаДетали >= 1
		И ЗначениеЗаполнено(Деталь.ВыборМебельнойКромкиСлева)
		И Деталь.ВыборМебельнойКромкиСлева.ГлубинаДетали >= 1 Тогда
		
		КоличествоУслуги = КоличествоУслуги + Деталь.Количество;
		
	КонецЕсли;
	
	Если Деталь.РадиусЛевоНиз = 0
		И ЗначениеЗаполнено(Деталь.ВыборМебельнойКромкиСнизу)
		И Деталь.ВыборМебельнойКромкиСнизу.ГлубинаДетали >= 1
		И ЗначениеЗаполнено(Деталь.ВыборМебельнойКромкиСлева)
		И Деталь.ВыборМебельнойКромкиСлева.ГлубинаДетали >= 1 Тогда
		
		КоличествоУслуги = КоличествоУслуги + Деталь.Количество;
		
	КонецЕсли;
	
	Если Деталь.РадиусПравоВерх = 0
		И ЗначениеЗаполнено(Деталь.ВыборМебельнойКромкиСверху)
		И Деталь.ВыборМебельнойКромкиСверху.ГлубинаДетали >= 1
		И ЗначениеЗаполнено(Деталь.ВыборМебельнойКромкиСправа)
		И Деталь.ВыборМебельнойКромкиСправа.ГлубинаДетали >= 1 Тогда
		
		КоличествоУслуги = КоличествоУслуги + Деталь.Количество;
		
	КонецЕсли;
	
	Если Деталь.РадиусПравоНиз = 0
		И ЗначениеЗаполнено(Деталь.ВыборМебельнойКромкиСнизу)
		И Деталь.ВыборМебельнойКромкиСнизу.ГлубинаДетали >= 1
		И ЗначениеЗаполнено(Деталь.ВыборМебельнойКромкиСправа)
		И Деталь.ВыборМебельнойКромкиСправа.ГлубинаДетали >= 1 Тогда
		
		КоличествоУслуги = КоличествоУслуги + Деталь.Количество;
		
	КонецЕсли;
	
	ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ОбгонкаУглов, КоличествоУслуги, Деталь.НомерИзделия);
	
КонецПроцедуры

&НаСервере
Функция ПодготовкаЛистовогоМатериала(фнОбъект)
	
	КоличествоЛистов = 0;
	КоличествоЛистовЗаказчика = 0;
	
	Для каждого Строка Из фнОбъект.СписокЛистовНоменклатуры Цикл
		
		Если Строка.ПредоставитЗаказчик Тогда
			КоличествоЛистовЗаказчика = КоличествоЛистовЗаказчика + Строка.Количество;
		Иначе
			КоличествоЛистов = КоличествоЛистов + Строка.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоЛистов > 0 Тогда
		ДобавитьСтроку(фнОбъект, ОбщаяНоменклатура.ПодготовкаЛистовогоМатериала, КоличествоЛистов, 0);
	КонецЕсли;
	
	Если КоличествоЛистовЗаказчика > 0 Тогда
		ДобавитьСтроку(фнОбъект, ОбщаяНоменклатура.ПодготовкаЛистовогоМатериала, КоличествоЛистовЗаказчика, 0,,,,,, Истина);
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОкрВверх(Знч)
	
	Возврат Цел(Знч)+?(Знч % 1, 1, 0);
	
КонецФункции

&НаСервере
Функция ЗаполнитьОсобыеУслуги(фнОбъект)
	
	// { Васильев Александр Леонидович [05.04.2016]
	// Сделать.
	// По хорошему бы запросом сделать.
	// Отобрать нужные строки и выбрать различные.
	// } Васильев Александр Леонидович [05.04.2016]
	
	МассивОсобыхУслуг = Новый Массив;
	
	Для Каждого Строка Из фнОбъект.СписокНоменклатуры Цикл
		Если Строка.Номенклатура.ВыделитьВНаряде Тогда
			
			Наименование = Строка.Номенклатура.Наименование;
			
			// Избавляемся от дублей
			
			Если МассивОсобыхУслуг.Найти(Наименование) = Неопределено Тогда
				МассивОсобыхУслуг.Добавить(Наименование);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из фнОбъект.Комплектация Цикл
		Если Строка.Номенклатура.ВыделитьВНаряде Тогда
			
			Наименование = Строка.Номенклатура.Наименование;
			
			// Избавляемся от дублей
			
			Если МассивОсобыхУслуг.Найти(Наименование) = Неопределено Тогда
				МассивОсобыхУслуг.Добавить(Наименование);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОсобыхУслуг.Количество() > 0 Тогда
		фнОбъект.ОсобыеУслуги = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивОсобыхУслуг, ", ");
	Иначе
		фнОбъект.ОсобыеУслуги = "";
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ОкруглитьКоличествоМатериаловПоНомГруппе(фнОбъект)
	
	// Округление по настройке в справочнике Номенклатурные группы.
	// Требовалось для кромки, но сделали универсальный механизм.
	
	ТаблицаСпискаНоменклатуры = фнОбъект.СписокНоменклатуры.Выгрузить();
	ТаблицаСпискаНоменклатуры.Свернуть("Номенклатура, КриволинейнаяКромка", "Количество");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаСпискаНоменклатуры", ТаблицаСпискаНоменклатуры);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаСпискаНоменклатуры.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаСпискаНоменклатуры.Количество,
	|	ТаблицаСпискаНоменклатуры.КриволинейнаяКромка
	|ПОМЕСТИТЬ ТаблицаСпискаНоменклатуры
	|ИЗ
	|	&ТаблицаСпискаНоменклатуры КАК ТаблицаСпискаНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСпискаНоменклатуры.Номенклатура,
	|	ТаблицаСпискаНоменклатуры.Количество,
	|	ТаблицаСпискаНоменклатуры.КриволинейнаяКромка,
	|	НоменклатурныеГруппы.ОкруглятьДо
	|ИЗ
	|	ТаблицаСпискаНоменклатуры КАК ТаблицаСпискаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|		ПО ТаблицаСпискаНоменклатуры.Номенклатура.НоменклатурнаяГруппа = НоменклатурныеГруппы.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(НоменклатурныеГруппы.ОкруглятьДо, 0) > 0
	|	И НЕ НоменклатурныеГруппы.ВидМатериала = ЗНАЧЕНИЕ(Перечисление.ВидыМатериалов.Листовой)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Ы = Цел(Выборка.Количество / Выборка.ОкруглятьДо);
		
		Если Ы <> Выборка.Количество / Выборка.ОкруглятьДо Тогда
			
			Ы = Ы * Выборка.ОкруглятьДо;
			
			Пока Ы < Выборка.Количество Цикл
				
				Ы = Ы + Выборка.ОкруглятьДо;
				
			КонецЦикла;
			
			КоличествоДобавляемогоМатериала = Ы - Выборка.Количество;
			ДобавитьСтроку(фнОбъект, Выборка.Номенклатура, КоличествоДобавляемогоМатериала, 0,,,,,,,,,,Выборка.КриволинейнаяКромка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции // ОкруглитьКоличествоМатериаловПоНомГруппе()

&НаСервере
Функция УвеличитьКоличествоМатериаловНаПроцентОтхода(фнОбъект)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Подразделение", фнОбъект.Подразделение);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СформироватьВТНоменклатура(Запрос, фнОбъект);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	втНоменклатура.Номенклатура,
	|	ВЫБОР
	|		КОГДА втНоменклатура.Номенклатура.МестоОбработки = ЗНАЧЕНИЕ(Перечисление.МестоОбработки.Цех)
	|					И втНоменклатура.ПоКаталогуМестоОбработки = ""Склад""
	|				ИЛИ втНоменклатура.Номенклатура.НоменклатурнаяГруппа.ВидМатериала = ЗНАЧЕНИЕ(Перечисление.ВидыМатериалов.Листовой)
	|			ТОГДА втНоменклатура.Количество
	|		ИНАЧЕ втНоменклатура.Количество + втНоменклатура.Количество * ВЫРАЗИТЬ(втНоменклатура.Номенклатура КАК Справочник.Номенклатура).ПроцентОтхода / 100
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА втНоменклатура.Номенклатура.НоменклатурнаяГруппа.ВидМатериала <> ЗНАЧЕНИЕ(Перечисление.ВидыМатериалов.Хлыстовой)
	|				И НЕ(втНоменклатура.Номенклатура.МестоОбработки = ЗНАЧЕНИЕ(Перечисление.МестоОбработки.Цех)
	|						И втНоменклатура.ПоКаталогуМестоОбработки = ""Склад"")
	|				И втНоменклатура.Номенклатура.НоменклатурнаяГруппа.ВидМатериала <> ЗНАЧЕНИЕ(Перечисление.ВидыМатериалов.Листовой)
	|			ТОГДА втНоменклатура.КоличествоТребуется + втНоменклатура.КоличествоТребуется * ВЫРАЗИТЬ(втНоменклатура.Номенклатура КАК Справочник.Номенклатура).ПроцентОтхода / 100
	|		ИНАЧЕ втНоменклатура.КоличествоТребуется
	|	КОНЕЦ КАК КоличествоТребуется,
	|	втНоменклатура.Цена,
	|	втНоменклатура.ЗарплатаЦеха,
	|	втНоменклатура.НомерИзделия,
	|	втНоменклатура.НомерСтроки,
	|	втНоменклатура.ИспользуетсяВКоробе,
	|	втНоменклатура.УслугаСМатериаломЗаказчика,
	|	втНоменклатура.ПредоставитЗаказчик,
	|	втНоменклатура.ЧерезСклад,
	|	втНоменклатура.РозничнаяСтоимость,
	|	втНоменклатура.ПоКаталогуМестоОбработки,
	|	втНоменклатура.Двери,
	|	втНоменклатура.КриволинейнаяКромка,
	|	ВЫРАЗИТЬ(втНоменклатура.Номенклатура КАК Справочник.Номенклатура).ПроцентОтхода КАК ПроцентОтхода
	|ИЗ
	|	втНоменклатура КАК втНоменклатура";
	
	фнОбъект.СписокНоменклатуры.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции // УвеличитьКоличествоМатериалаНаПроцентОтхода()

&НаСервере
Функция ЗаполнитьМатериалы(ТекущийОбъект, Ошибки, ПродаваемоеКоличествоМатериала)
	
	Метр = 1000;
	МетрКв = Метр * Метр;
	
	ТекущийОбъект.СписокНоменклатуры.Очистить();
	ТекущийОбъект.МерныйМатериал.Очистить();
	
	Изделие = ТекущийОбъект.Изделие;
	ПакетУслугИзделия = ТекущийОбъект.ПакетУслугИзделия;
	
	ПрипускККромке = ЛексСервер.ПолучитьНастройкуПодразделения(ТекущийОбъект.Подразделение, Перечисления.ВидыНастроекПодразделений.ПрипускККромке);
	
	Если НЕ ЗначениеЗаполнено(ПрипускККромке) Тогда
		ПрипускККромке = 0;
	КонецЕсли;
	
	Если ТекущийОбъект.Дилерский Тогда 
		
		 ЭтоНовыйДилер = ЛексСервер.ПолучитьПараметрДилера(ТекущийОбъект.Контрагент, "НовыйДилер");
		 
		 Если ЭтоНовыйДилер = Неопределено Тогда 
			  ЭтоНовыйДилер = Ложь;
		 КонецЕсли;
	Иначе
		 ЭтоНовыйДилер = Ложь; 
	КонецЕсли;
	
	МассивУслугСЗарплатойДизайнера = Новый Массив;
	
	Для Каждого Строка Из Изделие.СписокНоменклатуры Цикл
		
		Добавить = Ложь;
		
		Если ТекущийОбъект.Дилерский Тогда 
			
			Если Строка.ДобавлятьНовомуДилеру И ЭтоНовыйДилер Тогда
				 Добавить = Истина;
			ИначеЕсли Строка.ДобавлятьДилеру И НЕ ЭтоНовыйДилер Тогда
				 Добавить = Истина;
			Иначе	
			     Добавить = Ложь;
			КонецЕсли;
			
		Иначе
			Добавить = Истина;
		КонецЕсли;
			
		Если Добавить Тогда
			
			СтрНоменклатура = Строка.Номенклатура;
			
			Если ТипЗнч(СтрНоменклатура) = Тип("СправочникСсылка.ОбщаяНоменклатура") Тогда
				СтрНоменклатура = ЛексСервер.ПолучитьНоменклатуру(ОбщаяНоменклатура, СтрНоменклатура);
			КонецЕсли;
			
			Если НЕ (ПакетУслугИзделия.ДоступноДляИзделияДетали И Строка.НеДобавлятьДеталям) Тогда
			
				ДобавитьСтроку(ТекущийОбъект, СтрНоменклатура, Строка.Количество, 0, Ошибки, "у изделия " + Изделие);
		
				Если Строка.ЗарплатаДизайнеру Тогда
					МассивУслугСЗарплатойДизайнера.Добавить(СтрНоменклатура);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из ПакетУслугИзделия.СписокНоменклатуры Цикл
		
		Добавить = Ложь;
		
		Если ТекущийОбъект.Дилерский Тогда 
			
			Если Строка.ДобавлятьНовомуДилеру И ЭтоНовыйДилер Тогда
				 Добавить = Истина;
			ИначеЕсли Строка.ДобавлятьДилеру И НЕ ЭтоНовыйДилер Тогда
				 Добавить = Истина;
			Иначе	
			     Добавить = Ложь;
			КонецЕсли;
			
		Иначе
			Добавить = Истина;
		КонецЕсли;
		
		Если Добавить Тогда
			
			СтрНоменклатура = Строка.Номенклатура;
			
			Если ТипЗнч(СтрНоменклатура) = Тип("СправочникСсылка.ОбщаяНоменклатура") Тогда
				СтрНоменклатура = ЛексСервер.ПолучитьНоменклатуру(ОбщаяНоменклатура, СтрНоменклатура);
			КонецЕсли;

			ДобавитьСтроку(ТекущийОбъект, СтрНоменклатура, Строка.Количество, 0, Ошибки, "у изделия " + Изделие);
			
			Если Строка.ЗарплатаДизайнеру Тогда
				МассивУслугСЗарплатойДизайнера.Добавить(СтрНоменклатура);
			КонецЕсли;	
				
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивУслугСЗарплатойДизайнера.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(НастройкиНоменклатуры.ПлановаяЗакупочная) КАК ЗарплатаДизайнера
		|ИЗ
		|	РегистрСведений.НастройкиНоменклатуры.СрезПоследних(
		|			&МоментВремени,
		|			Подразделение = &Подразделение
		|				И Номенклатура В (&МассивУслугСЗарплатойДизайнера)) КАК НастройкиНоменклатуры";
		
		Запрос.УстановитьПараметр("МассивУслугСЗарплатойДизайнера", МассивУслугСЗарплатойДизайнера);
		Запрос.УстановитьПараметр("МоментВремени", ТекущийОбъект.Дата);
		Запрос.УстановитьПараметр("Подразделение", ТекущийОбъект.Подразделение);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		ТекущийОбъект.ЗарплатаДизайнера = ВыборкаДетальныеЗаписи.ЗарплатаДизайнера;
		
	КонецЕсли;
	
	#ОБЛАСТЬ Основной_цикл_заполнения_материалов
	
	Для Каждого Строка Из ТекущийОбъект.СписокДеталей Цикл
		
		ДанныеДетали = ПолучитьДанныеДетали(Строка.ВидДетали);
		
		Клееная = ДанныеДетали.Клееная;
		
		СборныйРамочныйФасад = ЗначениеЗаполнено(Строка.КромкаДляСборнойРамки);
		
		Номенклатура = Строка.Номенклатура;
		НоменклатурнаяГруппа = Номенклатура.НоменклатурнаяГруппа;
		НоменклатураДляСклеивания = Строка.НоменклатураДляСклеивания;
		Ручка = Строка.Ручка;
		КоличествоДеталей = Строка.Количество;
		ВысотаДетали = Строка.ВысотаДетали;
		ШиринаДетали = Строка.ШиринаДетали;
		НомерСтроки = Строка.НомерСтроки;
		НомерИзделия = Строка.НомерИзделия;
		Листовой = НоменклатурнаяГруппа.ВидМатериала = Перечисления.ВидыМатериалов.Листовой;
		
		УниверсальнаяКромка = Строка.УниверсальнаяКромка;
		ШиринаВставки = Номенклатура.ГлубинаДетали;
		ШиринаПаза = ?(ЗначениеЗаполнено(УниверсальнаяКромка),УниверсальнаяКромка.ШиринаПаза, 0);
		Петли = Строка.Петли;
		ДлинаКривогоПила = Число(Строка.ДлинаКривогоПила);
		Периметр = Число(Строка.Периметр);
		Обтачивать = Строка.Обтачивать;
		Постформинг = Строка.Постформинг;
		РасположениеПазовИРучки = Строка.РасположениеПазовИРучкиНаФасадах;
		
		Площадь = 0;
		
		Если ДанныеДетали.УчитыватьКратность Тогда
			
			ПодЗаказ = ЛексСервер.НоменклатураПодЗаказ(Номенклатура, Объект.Подразделение);
			
			// { Васильев Александр Леонидович [13.10.2015]
			// Сомнительный момент
			// Зачем тут анализируем под заказ?
			// Округляем до листов мы позже
			// } Васильев Александр Леонидович [13.10.2015]
			
			Если ПодЗаказ Тогда
				
				Площадь = (ВысотаДетали / Метр) * КоличествоДеталей;
				
			Иначе
				
				СтруктураКратности = ЛексСервер.ПосчитатьКратность(Номенклатура, ВысотаДетали);
				
				Если СтруктураКратности.КоличествоМатериала = ВысотаДетали Тогда
					Площадь = (ВысотаДетали / Метр) * КоличествоДеталей;
				Иначе
					Площадь = СтруктураКратности.КоличествоМатериала / Метр * КоличествоДеталей;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ Листовой Тогда
				ДобавитьСтроку(ТекущийОбъект, Номенклатура, Площадь, НомерИзделия, Ошибки, "детали № " + НомерСтроки, "СписокДеталей", НомерСтроки);
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(Номенклатура) Тогда
				Попытка
					Выполнить("Площадь = " + ДанныеДетали.РазмерТекстура);
					Площадь = Площадь * КоличествоДеталей;
					Если НЕ Листовой Тогда
						ДобавитьСтроку(ТекущийОбъект, Номенклатура, Площадь, НомерИзделия, Ошибки, "детали № " + НомерСтроки, "СписокДеталей", НомерСтроки);
					КонецЕсли;
				Исключение
					Сообщить("Ошибка при формировании формулы: №002");
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоменклатураДляСклеивания) Тогда
			Попытка
				
				Выполнить("Площадь = " + ДанныеДетали.РазмерДопНоменклатура);
				Площадь = Площадь * КоличествоДеталей;
				
				Если НоменклатураДляСклеивания.НоменклатурнаяГруппа.ВидМатериала <> Перечисления.ВидыМатериалов.Листовой Тогда
					ДобавитьСтроку(ТекущийОбъект, НоменклатураДляСклеивания, Площадь, НомерИзделия, Ошибки, "детали № " + НомерСтроки, "СписокДеталей", НомерСтроки);
				КонецЕсли;
				
			Исключение
				Сообщить("Ошибка при формировании формулы: №003");
			КонецПопытки;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ручка) Тогда
			
			ДобавитьСтроку(ТекущийОбъект, Ручка, КоличествоДеталей, НомерИзделия, Ошибки, "детали № " + НомерСтроки, "СписокДеталей", НомерСтроки, Ложь, Ложь, -1, "Склад");
			
		КонецЕсли;
		
		Для Каждого Эл Из ДанныеДетали.Комплектация Цикл
			
			Эл = Эл.Значение;
			Количество = 0;
			
			Попытка
				
				Выполнить("Количество = " + Эл.Количество);
				Количество = Количество * КоличествоДеталей;
				
				Если Количество > 0 Тогда
					
					ЭлНоменклатура = Эл.Номенклатура;
					
					Если ТипЗнч(ЭлНоменклатура) = Тип("СправочникСсылка.ОбщаяНоменклатура") Тогда
						ЭлНоменклатура = ЛексСервер.ПолучитьНоменклатуру(ОбщаяНоменклатура, ЭлНоменклатура);
					КонецЕсли;
					
					ДобавитьСтроку(ТекущийОбъект, ЭлНоменклатура, Количество, НомерИзделия);
					
				КонецЕсли;
				
			Исключение
				Сообщить("Ошибка при формировании формулы: №004");
			КонецПопытки;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Петли) Тогда
			
			ЕстьСборка = ?(НомерИзделия > 0, ТекущийОбъект.СписокИзделийПоКаталогу[НомерИзделия-1].Сборка, Ложь);
			
			Если НомерИзделия > 0 И ЕстьСборка Тогда
				ДобавитьСтроку(ТекущийОбъект, Петли, Строка.КоличествоПетель * КоличествоДеталей, НомерИзделия, Ошибки,,,,,,,"Цех");
			ИначеЕсли НомерИзделия > 0 Тогда
				ДобавитьСтроку(ТекущийОбъект, Петли, Строка.КоличествоПетель * КоличествоДеталей, НомерИзделия, Ошибки,,,,,,,"Склад");
			Иначе
				ДобавитьСтроку(ТекущийОбъект, Петли, Строка.КоличествоПетель * КоличествоДеталей, НомерИзделия, Ошибки,,,,,,,);
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеДетали.СпецФасад Тогда
			
			Если СборныйРамочныйФасад Тогда
				
				Количество = (((ВысотаДетали + Строка.ШиринаСборнойРамки * 2 - 24) * 2 + 50) * 2 + ((ШиринаДетали + Строка.ШиринаСборнойРамки * 2 - 24) * 2 + 50) *2) * КоличествоДеталей / Метр;
				ДобавитьСтроку(ТекущийОбъект, Строка.КромкаДляСборнойРамки, Количество, Строка.НомерИзделия, Ошибки, "кромки для сборной рамки у детали № " + Строка.НомерСтроки, "СписокДеталей", Строка.НомерСтроки);
				
				Площадь = (((ВысотаДетали + Строка.УниверсальнаяКромка.ГлубинаДетали * 2 + 50) * Строка.ШиринаСборнойРамки) * 2 + ((ШиринаДетали + Строка.УниверсальнаяКромка.ГлубинаДетали * 2 + 50) * Строка.ШиринаСборнойРамки) *2) * КоличествоДеталей / МетрКв;
				ДобавитьСтроку(ТекущийОбъект, Строка.УниверсальнаяКромка, Площадь, Строка.НомерИзделия, Ошибки, "обрамления фасада у детали № " + Строка.НомерСтроки, "СписокДеталей", Строка.НомерСтроки);
				
			Иначе
				
				Периметр = (ШиринаДетали + ВысотаДетали + 4 * Строка.УниверсальнаяКромка.ГлубинаДетали) * 2 + ДанныеДетали.ПрипускРамкаФасада * 4;
				
				ДлинаПрофиля = Периметр * КоличествоДеталей / Метр;
				ДобавитьСтроку(ТекущийОбъект, Строка.УниверсальнаяКромка, ДлинаПрофиля, Строка.НомерИзделия, Ошибки, "универсальной кромки у детали № " + Строка.НомерСтроки, "СписокДеталей", Строка.НомерСтроки);
				
			КонецЕсли;
			
		Иначе
			
			КромкиСлеваСправа = Новый Массив;
			КромкиСверхуСнизу = Новый Массив;
			
			Если ЗначениеЗаполнено(Строка.ВыборМебельнойКромкиСверху) Тогда
				Если Строка.ПереключательКромкаСверху = "Кант" 
					И Строка.ВыборМебельнойКромкиСверху.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
					
					ДобавитьСтроку(ТекущийОбъект, Строка.ВыборМебельнойКромкиСверху, ШиринаДетали * КоличествоДеталей / Метр, НомерИзделия, Ошибки);
					
				Иначе
					
					Стр = Новый Структура();
					Стр.Вставить("Кромка",Строка.ВыборМебельнойКромкиСверху);
					Стр.Вставить("Длина",ШиринаДетали - Строка.РадиусЛевоВерх - Строка.РадиусПравоВерх);
					Стр.Вставить("Криволинейная", ?(Строка.РадиусЛевоВерх > 0 ИЛИ Строка.РадиусПравоВерх > 0, Истина, Ложь));
					
					КромкиСверхуСнизу.Добавить(Стр);
					
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.ВыборМебельнойКромкиСнизу) Тогда
				Если Строка.ПереключательКромкаСнизу = "Кант" 
					И Строка.ВыборМебельнойКромкиСнизу.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
					
					ДобавитьСтроку(ТекущийОбъект, Строка.ВыборМебельнойКромкиСнизу, ШиринаДетали * КоличествоДеталей / Метр, НомерИзделия, Ошибки);
					
				Иначе
					
					Стр = Новый Структура();
					Стр.Вставить("Кромка",Строка.ВыборМебельнойКромкиСнизу);
					Стр.Вставить("Длина",ШиринаДетали - Строка.РадиусЛевоНиз - Строка.РадиусПравоНиз);
					Стр.Вставить("Криволинейная", ?(Строка.РадиусЛевоНиз > 0 ИЛИ Строка.РадиусПравоНиз > 0, Истина, Ложь));
					
					КромкиСверхуСнизу.Добавить(Стр);
					
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.ВыборМебельнойКромкиСлева) Тогда
				Если Строка.ПереключательКромкаСлева = "Кант" 
					И Строка.ВыборМебельнойКромкиСлева.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
					
					ДобавитьСтроку(ТекущийОбъект, Строка.ВыборМебельнойКромкиСлева, ВысотаДетали * КоличествоДеталей / Метр, НомерИзделия, Ошибки);
					
				Иначе
					
					Стр = Новый Структура();
					Стр.Вставить("Кромка",Строка.ВыборМебельнойКромкиСлева);
					Стр.Вставить("Длина",ВысотаДетали - Строка.РадиусЛевоНиз - Строка.РадиусЛевоВерх + ?(Строка.РадиусЛевоНиз>0, 3.141592*Строка.РадиусЛевоНиз/2, 0) + ?(Строка.РадиусЛевоВерх>0, 3.141592*Строка.РадиусЛевоВерх/2, 0));
					Стр.Вставить("Криволинейная", ?(Строка.РадиусЛевоНиз > 0 ИЛИ Строка.РадиусЛевоВерх > 0, Истина, Ложь));
					
					КромкиСлеваСправа.Добавить(Стр);
					
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.ВыборМебельнойКромкиСправа) Тогда
				Если Строка.ПереключательКромкаСправа = "Кант" 
					И Строка.ВыборМебельнойКромкиСправа.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
					
					ДобавитьСтроку(ТекущийОбъект, Строка.ВыборМебельнойКромкиСправа, ВысотаДетали * КоличествоДеталей / Метр, НомерИзделия, Ошибки);
					
				Иначе
					
					Стр = Новый Структура();
					Стр.Вставить("Кромка",Строка.ВыборМебельнойКромкиСправа);
					
					Если Строка.Срез И Строка.РадиусПравоНиз > 0 Тогда
						Срез = Строка.РадиусПравоНиз;
						ДлинаРадиусаПравоНиз = ОКР(POW(Срез*Срез+Срез*Срез,0.5));
					Иначе
						ДлинаРадиусаПравоНиз = ?(Строка.РадиусПравоНиз>0, 3.141592*Строка.РадиусПравоНиз/2, 0);
					КонецЕсли;
					
					Стр.Вставить("Длина",ВысотаДетали - Строка.РадиусПравоНиз - Строка.РадиусПравоВерх + ДлинаРадиусаПравоНиз + ?(Строка.РадиусПравоВерх>0, 3.141592*Строка.РадиусПравоВерх/2, 0));
					Стр.Вставить("Криволинейная", ?(Строка.РадиусПравоНиз > 0 ИЛИ Строка.РадиусПравоВерх > 0, Истина, Ложь));
					
					КромкиСлеваСправа.Добавить(Стр);
					
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого Строчка Из КромкиСверхуСнизу Цикл
				
				Если Строчка.Кромка.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ТорцеваяРучка16мм или Строчка.Кромка.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ТорцеваяРучка18мм Тогда
					Площадь = КоличествоДеталей;
				Иначе
					Площадь = (Строчка.Длина + ПрипускККромке) * КоличествоДеталей / Метр;
				КонецЕсли;
				
				Если Площадь > 0 Тогда
					ДобавитьСтроку(ТекущийОбъект, Строчка.Кромка, Площадь, НомерИзделия, Ошибки, "кромки у детали № " + НомерСтроки, "СписокДеталей", НомерСтроки,,,,,,Строчка.Криволинейная);
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого Строчка Из КромкиСлеваСправа Цикл
				
				Если Строчка.Кромка.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ТорцеваяРучка16мм или Строчка.Кромка.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ТорцеваяРучка18мм Тогда
					Площадь = КоличествоДеталей;
				Иначе
					Площадь = (Строчка.Длина + ПрипускККромке) * КоличествоДеталей / Метр;
				КонецЕсли;
				
				Если Площадь > 0 Тогда
					ДобавитьСтроку(ТекущийОбъект, Строчка.Кромка, Площадь, НомерИзделия, Ошибки, "кромки у детали № " + НомерСтроки, "СписокДеталей", НомерСтроки,,,,,,Строчка.Криволинейная);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		КантыИзРедактора = Строка.КантыИзРедактора;
		
		Если ЗначениеЗаполнено(КантыИзРедактора) Тогда
			
			КантыИзРедактора = ЗначениеИзСтрокиВнутр(КантыИзРедактора);
			МассивКантов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КантыИзРедактора, "|");
			
			Для Каждого Кромка Из МассивКантов Цикл
				
				ПараметрыКанта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Кромка, "_");
				НоменклатурныйНомер = ПараметрыКанта[0];
				ДлинаКанта = Число(ПараметрыКанта[1]);
				ТипКромления = Число(ПараметрыКанта[2]);
				НоменклатураКанта = Справочники.Номенклатура.НайтиПоКоду(НоменклатурныйНомер);
				ДлинаКромления = ДлинаКанта * КоличествоДеталей / 1000;
				
				//RonEXI: На нередактированнной стороне не увеличиваем кромку.
				Если ТипКромления <> 0 Тогда
					ДлинаКромления = ДлинаКромления * 2;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НоменклатураКанта) Тогда				
					ДобавитьСтроку(ТекущийОбъект, НоменклатураКанта, ДлинаКромления, НомерИзделия, Ошибки, "канта из редактора у детали № " + НомерСтроки, "СписокДеталей", НомерСтроки,,,,,,Истина);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	#КОНЕЦОБЛАСТИ
	
	#ОБЛАСТЬ Ящики
	
	ТаблицаМатериалыЯщиков = Документы.Спецификация.ПолучитьТаблицуМатериаловЯщики(ТаблицаДеталиЯщиков, ТекущийОбъект, ОбщаяНоменклатура);
	ИзделиеСерийное = ТекущийОбъект.Изделие.Серийное;
	
	Для Каждого МатериалЯщика Из ТаблицаМатериалыЯщиков Цикл
		
		Листовой = МатериалЯщика.Листовой;
		
		Если НЕ Листовой И НЕ (ИзделиеСерийное И МатериалЯщика.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга) Тогда
			ДобавитьСтроку(ТекущийОбъект, МатериалЯщика.Номенклатура, МатериалЯщика.Количество, МатериалЯщика.НомерИзделия, Неопределено, "", Неопределено, 0, Ложь, Ложь, -1, МатериалЯщика.МестоОбработки,,?(ЗначениеЗаполнено(МатериалЯщика.КриволинейнаяКромка), МатериалЯщика.КриволинейнаяКромка, Ложь));
		КонецЕсли;
		
	КонецЦикла;
	
	#КОНЕЦОБЛАСТИ
	
	#Область Двери
	
	//Добавляем номенклатуру из дверей
	Для каждого Строка Из ТекущийОбъект.СписокДверей Цикл
		
		ТаблицаНоменклатурыДверей = Строка.Двери.СписокНоменклатуры;
		
		Для каждого СтрокаНоменклатуры Из ТаблицаНоменклатурыДверей Цикл
			
			ВидМатериала = СтрокаНоменклатуры.Номенклатура.НоменклатурнаяГруппа.ВидМатериала;
			
			Если ВидМатериала = Перечисления.ВидыМатериалов.Хлыстовой Тогда
				
				Для ъ = 1 по СтрокаНоменклатуры.Количество Цикл
					ТекстСообщения = "строки № " + СтрокаНоменклатуры.НомерСтроки + " у двери № " + Строка.НомерСтроки;
					ДобавитьСтроку(ТекущийОбъект, СтрокаНоменклатуры.Номенклатура, СтрокаНоменклатуры.Ширина / 1000, 0, Ошибки, ТекстСообщения, "СписокДверей", Строка.НомерСтроки, Ложь, Ложь, -1, "", Строка.Двери);
				КонецЦикла;
				
			ИначеЕсли НЕ ВидМатериала = Перечисления.ВидыМатериалов.Листовой Тогда
				
				КоличествоМатериала = ЛексСервер.ПосчитатьКратность(СтрокаНоменклатуры.Номенклатура, СтрокаНоменклатуры.КоличествоСОтходом).КоличествоМатериала;
				ТекстСообщения = "строки № " + СтрокаНоменклатуры.НомерСтроки + " у двери № " + Строка.НомерСтроки;
				ДобавитьСтроку(ТекущийОбъект, СтрокаНоменклатуры.Номенклатура, КоличествоМатериала, 0, Ошибки, ТекстСообщения, "СписокДверей", Строка.НомерСтроки);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	#КонецОбласти
	
	// Добавление листового материала из раскроя.
	
	Если ПродаваемоеКоличествоМатериала <> Неопределено Тогда
		
		Для Каждого Строка Из ПродаваемоеКоличествоМатериала Цикл
			
			НоменклатураОбрезка = Строка.Ключ;
			Если НоменклатураОбрезка.НоменклатурнаяГруппа.КоличествоВПогонныхМетрах Тогда
				ПлощадьОбрезков = Окр(Строка.Значение / Метр, 3);
			Иначе
				ПлощадьОбрезков = Окр(Строка.Значение / МетрКв, 3);
			КонецЕсли;
			Если ПлощадьОбрезков > 0 Тогда
				
				ДобавитьСтроку(ТекущийОбъект, НоменклатураОбрезка, ПлощадьОбрезков, 0, Ошибки);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции // ЗаполнитьМатериалы()

// Устанавливает цену на материалы и услуги, 
// также проставляет флаг ПредоставитЗаказчик.
// Теперь без группировки строк
//
// Параметры
//  фнОбъект  - ДокументОбъект.Спецификация - Спецификация для заполнения цен
//                 в табилце СписокНоменклатуры
&НаСервере
Процедура ЗаполнитьСтоимость(фнОбъект)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СформироватьВТНоменклатура(Запрос, фнОбъект);
	
	Запрос.УстановитьПараметр("тзМатериалЗаказчика", фнОбъект.СписокМатериаловЗаказчика);
	Запрос.УстановитьПараметр("Подразделение", фнОбъект.Подразделение);
	Запрос.УстановитьПараметр("Период", фнОбъект.Дата);
	
	// { Васильев Александр Леонидович [08.10.2015]
	// Убираю группировку, больше проблем с ней чем выгоды.
	// Впоследствии можно будет более подробный комментарий
	// к каждой строке сделать. Например номер детали.
	// } Васильев Александр Леонидович [08.10.2015]
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзМатериалЗаказчика.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	0 КАК Цена
	|ПОМЕСТИТЬ втМатериалЗаказчика
	|ИЗ
	|	&тзМатериалЗаказчика КАК тзМатериалЗаказчика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втНоменклатура.Номенклатура,
	|	втНоменклатура.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА втНоменклатура.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|			ТОГДА 0
	|		ИНАЧЕ втНоменклатура.КоличествоТребуется
	|	КОНЕЦ КАК КоличествоТребуется,
	|	втНоменклатура.ЧерезСклад КАК ЧерезСклад,
	|	втНоменклатура.УслугаСМатериаломЗаказчика КАК УслугаСМатериаломЗаказчика,
	|	ВЫБОР
	|		КОГДА втМатериалЗаказчика.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПредоставитЗаказчик,
	|	ВЫБОР
	|		КОГДА втНоменклатура.НомерИзделия = 0
	|				ИЛИ втНоменклатура.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК НомерИзделия,
	|	втНоменклатура.ИспользуетсяВКоробе КАК ИспользуетсяВКоробе,
	|	ВЫБОР
	|		КОГДА втНоменклатура.Номенклатура.НоменклатурнаяГруппа.ВидМатериала = ЗНАЧЕНИЕ(Перечисление.ВидыМатериалов.Хлыстовой)
	|				ИЛИ втНоменклатура.УслугаСМатериаломЗаказчика
	|			ТОГДА втНоменклатура.НомерСтроки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БезГруппировки,
	|	ЕСТЬNULL(втМатериалЗаказчика.Цена, ЕСТЬNULL(РозничныеЦеныСрез.Розничная, 0)) КАК Цена,
	|	ВЫБОР
	|		КОГДА втНоменклатура.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|			ТОГДА ЕСТЬNULL(РозничныеЦеныСрез.ПлановаяЗакупочная, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПлановаяЗакупочная,
	|	втНоменклатура.ПоКаталогуМестоОбработки КАК ПоКаталогуМестоОбработки,
	|	втНоменклатура.Двери КАК Двери,
	|	втНоменклатура.КриволинейнаяКромка КАК КриволинейнаяКромка
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	втНоменклатура КАК втНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(
	|				&Период,
	|				Подразделение = &Подразделение
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							втНоменклатура.Номенклатура
	|						ИЗ
	|							втНоменклатура КАК втНоменклатура)) КАК РозничныеЦеныСрез
	|		ПО втНоменклатура.Номенклатура = РозничныеЦеныСрез.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втМатериалЗаказчика КАК втМатериалЗаказчика
	|		ПО втНоменклатура.Номенклатура = втМатериалЗаказчика.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.ПлановаяЗакупочная * втДанные.Количество КАК ЗарплатаЦеха,
	|	втДанные.Количество КАК Количество,
	|	втДанные.КоличествоТребуется КАК КоличествоТребуется,
	|	втДанные.Номенклатура,
	|	втДанные.НомерИзделия,
	|	втДанные.ИспользуетсяВКоробе,
	|	втДанные.ПредоставитЗаказчик,
	|	втДанные.УслугаСМатериаломЗаказчика,
	|	втДанные.Цена * втДанные.Количество КАК РозничнаяСтоимость,
	|	втДанные.Цена * втДанные.Количество КАК СуммаБезНаценкиОфиса,
	|	втДанные.Цена КАК Цена,
	|	втДанные.ЧерезСклад,
	|	втДанные.БезГруппировки,
	|	втДанные.ПоКаталогуМестоОбработки,
	|	втДанные.Двери,
	|	втДанные.КриволинейнаяКромка
	|ИЗ
	|	втДанные КАК втДанные";
	
	фнОбъект.СписокНоменклатуры.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция ЗаменитьЦенуМатериалаПодЗаказ(фнОбъект)
	
	Если фнОбъект.СписокМатериаловПодЗаказ.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СформироватьВТНоменклатура(Запрос, фнОбъект);
	
	Запрос.УстановитьПараметр("тзМатериалПодЗаказ", фнОбъект.СписокМатериаловПодЗаказ.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзМатериалПодЗаказ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	тзМатериалПодЗаказ.Цена
	|ПОМЕСТИТЬ втМатериалПодЗаказ
	|ИЗ
	|	&тзМатериалПодЗаказ КАК тзМатериалПодЗаказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоменклатура.ЗарплатаЦеха,
	|	втНоменклатура.Количество,
	|	втНоменклатура.КоличествоТребуется,
	|	втНоменклатура.Номенклатура,
	|	втНоменклатура.НомерИзделия,
	|	втНоменклатура.ИспользуетсяВКоробе,
	|	втНоменклатура.УслугаСМатериаломЗаказчика,
	|	втНоменклатура.ПредоставитЗаказчик КАК ПредоставитЗаказчик,
	|	ВЫБОР
	|		КОГДА втМатериалПодЗаказ.Цена ЕСТЬ NULL
	|			ТОГДА втНоменклатура.РозничнаяСтоимость
	|		ИНАЧЕ втМатериалПодЗаказ.Цена * втНоменклатура.Количество
	|	КОНЕЦ КАК РозничнаяСтоимость,
	|	ВЫБОР
	|		КОГДА втМатериалПодЗаказ.Цена ЕСТЬ NULL
	|			ТОГДА втНоменклатура.РозничнаяСтоимость
	|		ИНАЧЕ втМатериалПодЗаказ.Цена * втНоменклатура.Количество
	|	КОНЕЦ КАК СуммаБезНаценкиОфиса,
	|	ЕСТЬNULL(втМатериалПодЗаказ.Цена, втНоменклатура.Цена) КАК Цена,
	|	втНоменклатура.ЧерезСклад,
	|	втНоменклатура.ПоКаталогуМестоОбработки,
	|	втНоменклатура.Двери КАК Двери,
	|	втНоменклатура.КриволинейнаяКромка КАК КриволинейнаяКромка
	|ИЗ
	|	втНоменклатура КАК втНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втМатериалПодЗаказ КАК втМатериалПодЗаказ
	|		ПО втНоменклатура.Номенклатура = втМатериалПодЗаказ.Номенклатура";
	
	фнОбъект.СписокНоменклатуры.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаСервере
Функция УвеличитьСтоимостьЗаПредоставленныйМатериал(фнОбъект)
	
	Коэффициент = фнОбъект.Подразделение.МатериалЗаказчикаНаценка;
	
	Если Коэффициент = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзНоменклатура", фнОбъект.СписокНоменклатуры);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тзНоменклатура.РозничнаяСтоимость
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	&тзНоменклатура КАК тзНоменклатура
	|ГДЕ
	|	тзНоменклатура.УслугаСМатериаломЗаказчика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоменклатура.РозничнаяСтоимость КАК РозничнаяСтоимость
	|ИЗ
	|	втНоменклатура КАК втНоменклатура
	|ИТОГИ
	|	СУММА(РозничнаяСтоимость)
	|ПО
	|	ОБЩИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Выборка.Следующий();
		Сумма = Выборка.РозничнаяСтоимость;
		
		Если Сумма > 0 Тогда
			
			Стоимость = Сумма * Коэффициент;
			
			НоваяСтрока = фнОбъект.СписокНоменклатуры.Добавить();
			НоваяСтрока.Номенклатура = ОбщаяНоменклатура.НадбавкаЗаМатериалЗаказчика;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.РозничнаяСтоимость = Стоимость;
			НоваяСтрока.СуммаБезНаценкиОфиса = Стоимость;
			НоваяСтрока.Цена = Стоимость;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПрименитьНаценкиОфисаДилера(фнОбъект)
	
	КоэфУслуги = 1;
	КоэфМатериалы = 1;
	
	Если фнОбъект.Дилерский Тогда
		
		НаценкаДилера = 1;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Контрагент", фнОбъект.Контрагент);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПараметрыДилеров.Наценка
		|ИЗ
		|	РегистрСведений.ПараметрыДилеров.СрезПоследних(, Контрагент = &Контрагент) КАК ПараметрыДилеров";
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			НаценкаДилера = Выборка.Наценка;
			
		КонецЕсли;
		
		Если НаценкаДилера = 1 Тогда
			Возврат Истина;
		КонецЕсли;
		
		КоэфУслуги = НаценкаДилера;
		КоэфМатериалы = НаценкаДилера;
		
	Иначе
		
		СвойстваОфиса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(фнОбъект.Офис, "КоэффициентУслуги, КоэффициентМатериалы");
		
		Если НЕ ЗначениеЗаполнено(СвойстваОфиса.КоэффициентУслуги) Тогда
			СвойстваОфиса.КоэффициентУслуги = 1;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СвойстваОфиса.КоэффициентМатериалы) Тогда
			СвойстваОфиса.КоэффициентМатериалы = 1;
		КонецЕсли;
		
		Если СвойстваОфиса.КоэффициентУслуги + СвойстваОфиса.КоэффициентМатериалы = 2 Тогда
			Возврат Истина;
		КонецЕсли;
		
		КоэфУслуги = СвойстваОфиса.КоэффициентУслуги;
		КоэфМатериалы = СвойстваОфиса.КоэффициентМатериалы;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СформироватьВТНоменклатура(Запрос, фнОбъект);
	
	Запрос.УстановитьПараметр("КоэффициентМатериалы", КоэфМатериалы);
	Запрос.УстановитьПараметр("КоэффициентУслуги", КоэфУслуги);
	Запрос.УстановитьПараметр("Дилерский", фнОбъект.Дилерский);
	Запрос.УстановитьПараметр("Подразделение", фнОбъект.Подразделение);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	втНоменклатура.Номенклатура,
	|	втНоменклатура.Количество,
	|	втНоменклатура.КоличествоТребуется,
	|	ВЫБОР
	|		КОГДА втНоменклатура.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)
	|			ТОГДА ВЫБОР
	|					КОГДА &Дилерский
	|							И ЕСТЬNULL(НастройкиНоменклатуры.ПодЗаказ, ИСТИНА)
	|						ТОГДА втНоменклатура.Цена
	|					ИНАЧЕ втНоменклатура.Цена * &КоэффициентМатериалы
	|				КОНЕЦ
	|		ИНАЧЕ втНоменклатура.Цена * &КоэффициентУслуги
	|	КОНЕЦ КАК Цена,
	|	втНоменклатура.ЗарплатаЦеха,
	|	втНоменклатура.НомерИзделия,
	|	втНоменклатура.НомерСтроки,
	|	втНоменклатура.ИспользуетсяВКоробе,
	|	втНоменклатура.УслугаСМатериаломЗаказчика,
	|	втНоменклатура.ЧерезСклад,
	|	втНоменклатура.ПредоставитЗаказчик,
	|	ВЫБОР
	|		КОГДА втНоменклатура.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)
	|			ТОГДА ВЫБОР
	|					КОГДА &Дилерский
	|							И ЕСТЬNULL(НастройкиНоменклатуры.ПодЗаказ, ИСТИНА)
	|						ТОГДА втНоменклатура.Цена * втНоменклатура.Количество
	|					ИНАЧЕ втНоменклатура.Цена * &КоэффициентМатериалы * втНоменклатура.Количество
	|				КОНЕЦ
	|		ИНАЧЕ втНоменклатура.Цена * &КоэффициентУслуги * втНоменклатура.Количество
	|	КОНЕЦ КАК РозничнаяСтоимость,
	|	втНоменклатура.СуммаБезНаценкиОфиса,
	|	втНоменклатура.ПоКаталогуМестоОбработки,
	|	втНоменклатура.Двери,
	|	втНоменклатура.КриволинейнаяКромка
	|ИЗ
	|	втНоменклатура КАК втНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(, Подразделение = &Подразделение) КАК НастройкиНоменклатуры
	|		ПО втНоменклатура.Номенклатура = НастройкиНоменклатуры.Номенклатура";
	
	Результат = Запрос.Выполнить();
	фнОбъект.СписокНоменклатуры.Загрузить(Результат.Выгрузить());
	
КонецФункции

&НаСервере
Функция ЗаполнитьМатериалПодЗаказ(фнОбъект)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", фнОбъект.Подразделение);
	Запрос.УстановитьПараметр("тзНоменклатура", фнОбъект.СписокНоменклатуры);
	Запрос.УстановитьПараметр("тзМатериалПодЗаказ", фнОбъект.СписокМатериаловПодЗаказ);
	Запрос.УстановитьПараметр("тзМатериалЗаказчика", фнОбъект.СписокМатериаловЗаказчика);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тзНоменклатура.Количество,
	|	ВЫРАЗИТЬ(тзНоменклатура.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	&тзНоменклатура КАК тзНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзМатериалЗаказчика.Номенклатура
	|ПОМЕСТИТЬ втМатериалЗаказчика
	|ИЗ
	|	&тзМатериалЗаказчика КАК тзМатериалЗаказчика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(втНоменклатура.Количество) КАК Количество,
	|	втНоменклатура.Номенклатура
	|ПОМЕСТИТЬ втПодЗаказ
	|ИЗ
	|	втНоменклатура КАК втНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(, Подразделение = &Подразделение) КАК НастройкиНоменклатуры
	|		ПО втНоменклатура.Номенклатура = НастройкиНоменклатуры.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втМатериалЗаказчика КАК втМатериалЗаказчика
	|		ПО втНоменклатура.Номенклатура = втМатериалЗаказчика.Номенклатура
	|ГДЕ
	|	втМатериалЗаказчика.Номенклатура ЕСТЬ NULL
	|	И ЕСТЬNULL(НастройкиНоменклатуры.ПодЗаказ, ИСТИНА)
	|	И НЕ втНоменклатура.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	втНоменклатура.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзМатериалПодЗаказ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	тзМатериалПодЗаказ.Количество КАК Количество,
	|	тзМатериалПодЗаказ.Комментарий КАК Комментарий,
	|	тзМатериалПодЗаказ.Поставщик КАК Поставщик,
	|	тзМатериалПодЗаказ.Сумма КАК Сумма,
	|	тзМатериалПодЗаказ.Цена КАК Цена
	|ПОМЕСТИТЬ втМатериалПодЗаказ
	|ИЗ
	|	&тзМатериалПодЗаказ КАК тзМатериалПодЗаказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПодЗаказ.Количество КАК Количество,
	|	ЕСТЬNULL(втМатериалПодЗаказ.Номенклатура, втПодЗаказ.Номенклатура) КАК Номенклатура,
	|	втМатериалПодЗаказ.Комментарий,
	|	втМатериалПодЗаказ.Поставщик,
	|	ЕСТЬNULL(втМатериалПодЗаказ.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(втМатериалПодЗаказ.Цена, 0) * втПодЗаказ.Количество КАК Сумма
	|ИЗ
	|	втПодЗаказ КАК втПодЗаказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втМатериалПодЗаказ КАК втМатериалПодЗаказ
	|		ПО втПодЗаказ.Номенклатура = втМатериалПодЗаказ.Номенклатура";
	
	фнОбъект.СписокМатериаловПодЗаказ.Загрузить(Запрос.Выполнить().Выгрузить());
	фнОбъект.ЕстьМатериалПодЗаказ = фнОбъект.СписокМатериаловПодЗаказ.Количество() > 0;
	
КонецФункции

#КонецОбласти

#Область ОбщегоНазначения

&НаСервереБезКонтекста
Функция ПолучитьДилерскуюСумма(СпецификацияСсылка)
	
	Возврат Документы.Спецификация.ПолучитьСуммаСДилерскимиНаценками(СпецификацияСсылка);
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьСуммы()
	
	СтруктураСкидка = ЛексСервер.ПолучитьСкидкуДоговора(Объект.СуммаДокумента, ВидОплаты);
	
	ПроцентСкидки = СтруктураСкидка.РазмерСкидки;
	
	Если СтруктураСкидка.СуммаДокумента <> 0 Тогда
		СуммаДокументаСоСкидкой = СтруктураСкидка.СуммаДокумента - (СтруктураСкидка.СуммаДокумента * ПроцентСкидки / 100);
	Иначе
		СуммаДокументаСоСкидкой = Объект.СуммаДокумента - (Объект.СуммаДокумента * ПроцентСкидки / 100);
	КонецЕсли;
	
	Если Объект.Дилерский Тогда
		фСуммаДокумента = ПолучитьДилерскуюСумма(Объект.Ссылка);
	Иначе
		фСуммаДокумента = Объект.СуммаДокумента;
	КонецЕсли;
	
	фСуммаДокумента = Окр(фСуммаДокумента + 0.499);
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьНужнуюТаблицуВХранилище(ТабличнаяЧасть)
	
	Если ТипЗнч(ТабличнаяЧасть) = Тип("ДанныеФормыКоллекция") Тогда
		
		Адрес = ПоместитьВоВременноеХранилище(ТабличнаяЧасть.Выгрузить());
		Возврат Адрес;
		
	ИначеЕсли ТипЗнч(ТабличнаяЧасть) = Тип("Структура") Тогда
		
		Возврат ПоместитьВоВременноеХранилище(ТабличнаяЧасть);
		
	КонецЕсли;
	
КонецФункции 

&НаСервере
Процедура ЗагрузитьТабличнуюЧасть(АдресЗначения, ИмяТабличнойЧасти)
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресЗначения) Тогда
		Возврат;
	КонецЕсли;
	
	Значение = ПолучитьИзВременногоХранилища(АдресЗначения);
	
	Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда
		
		Объект[ИмяТабличнойЧасти].Загрузить(Значение);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Структура") Тогда
		
		Если Значение.Свойство("Модифицированность") И НЕ Модифицированность Тогда
			Модифицированность = Значение.Модифицированность;
		КонецЕсли;
		
		Если Значение.Свойство("Детали") И Значение.Свойство("Петли") Тогда
			
			Объект[ИмяТабличнойЧасти].Загрузить(Значение.Детали);
			Объект["ПетлиДетали"].Загрузить(Значение.Петли);
			
		КонецЕсли;
		
		Если Значение.Свойство("Детали") И Значение.Свойство("Двери") Тогда
			
			Объект[ИмяТабличнойЧасти].Загрузить(Значение.Детали);
			
			Объект.СписокДверей.Очистить();
			
			Если ЗначениеЗаполнено(Значение.Двери) Тогда
				
				СтрокаДверей = Объект.СписокДверей.Добавить();
				СтрокаДверей.Двери = Значение.Двери;
				СтрокаДверей.ПоКаталогу = Истина;
				
			КонецЕсли;
			
			Если Значение.Свойство("ВариантШкафа") Тогда
				Объект.ВариантШкафаПоКаталогу = Значение.ВариантШкафа;
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьТаблицыПоКаталогу(Таблица, ТаблицаФасадов, ТаблицаНастройкиКоллекции)
	
	Стр = Новый Структура;
	
	Стр.Вставить("АдресТаблицы", ПоместитьВоВременноеХранилище(Таблица.Выгрузить()));
	Стр.Вставить("АдресТаблицаФасадов", ПоместитьВоВременноеХранилище(ТаблицаФасадов.Выгрузить()));
	
	Если ТаблицаНастройкиКоллекции.Количество() > 0 Тогда
		 Стр.Вставить("АдресТаблицаНастройкиКоллекции", ПоместитьВоВременноеХранилище(ТаблицаНастройкиКоллекции.Выгрузить()));
	КонецЕсли;
	
	Возврат Стр;
	
КонецФункции

&НаСервере
Функция ВыгрузитьТаблицыДеталиПетли(Таблицы)
	
	Стр = Новый Структура;
	
	Стр.Вставить("АдресТаблицаДетали", ПоместитьВоВременноеХранилище(Таблицы.ТаблицаДетали.Выгрузить()));
	Стр.Вставить("АдресТаблицаПетли", ПоместитьВоВременноеХранилище(Таблицы.ТаблицаПетли.Выгрузить()));
	
	Возврат Стр;
	
КонецФункции

&НаКлиенте
Функция ОткрытьФормуПодбора(ИмяПодбора, ТаблицаДляФормы, СтрокаДанных, ВладелецПодобра, ПараметрыПодбора = Неопределено)
	
	Если ПараметрыПодбора = Неопределено ИЛИ ТипЗнч(ПараметрыПодбора) <> Тип("Структура") Тогда
		ПараметрыПодбора = Новый Структура;
	КонецЕсли;

	Если ПараметрыПодбора.Свойство("ТаблицаФасадов") Тогда
		
		АдресаТаблиц = ВыгрузитьТаблицыПоКаталогу(ТаблицаДляФормы, ПараметрыПодбора.ТаблицаФасадов, ПараметрыПодбора.ТаблицаНастройкиКоллекции);
		АдресТаблицы = АдресаТаблиц.АдресТаблицы;
		
		ПараметрыПодбора.Вставить("АдресТаблицаФасадов", АдресаТаблиц.АдресТаблицаФасадов);
		
		Если АдресаТаблиц.Свойство("АдресТаблицаНастройкиКоллекции") Тогда
			ПараметрыПодбора.Вставить("АдресТаблицаНастройкиКоллекции", АдресаТаблиц.АдресТаблицаНастройкиКоллекции);
		КонецЕсли;
	
	ИначеЕсли ТипЗнч(ТаблицаДляФормы) = Тип("Структура") И ТаблицаДляФормы.Свойство("ТаблицаДетали") И ТаблицаДляФормы.Свойство("ТаблицаПетли") Тогда
		
		АдресаТаблиц = ВыгрузитьТаблицыДеталиПетли(ТаблицаДляФормы);
		АдресТаблицы = АдресаТаблиц.АдресТаблицаДетали;
		
		ПараметрыПодбора.Вставить("АдресТаблицаПетли", АдресаТаблиц.АдресТаблицаПетли);
			
	Иначе
		
		АдресТаблицы = ВыгрузитьНужнуюТаблицуВХранилище(ТаблицаДляФормы);
		
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("АдресТаблицы", АдресТаблицы);
	ПараметрыПодбора.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыПодбора.Вставить("Изделие", Объект.Изделие);
	ПараметрыПодбора.Вставить("ПакетУслугИзделия", Объект.ПакетУслугИзделия);
	ПараметрыПодбора.Вставить("Офис", Объект.ОФис);
	
	Если ИмяПодбора = "ФормаШкафПоКаталогу" Тогда
		ПараметрыПодбора.Вставить("ВариантШкафа", Объект.ВариантШкафаПоКаталогу);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПараметрыПодбора.Вставить("Спецификация", Объект.Ссылка);
		
	КонецЕсли;
	
	Если СтрокаДанных <> Неопределено Тогда
		
		ПараметрыПодбора.Вставить("Идентификатор", СтрокаДанных.НомерСтроки - 1);
		
	КонецЕсли;
	
	Если Объект.Дилерский Тогда
		ПараметрыПодбора.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыПодбора.Вставить("Дилерский", Истина);
	КонецЕсли;
	
	Если ИмяПодбора = "ФормаКомплектация" Тогда
		
		Пар = Новый Структура;
		Пар.Вставить("АдресТаблицы", АдресТаблицы);
		ПараметрыПодбора.Вставить("Комплектация", Пар);
		
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбора", ПараметрыПодбора, ВладелецПодобра);
		
	Иначе
		
		ОткрытьФорму("Документ.Спецификация.Форма." + ИмяПодбора, ПараметрыПодбора, ВладелецПодобра);
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Собрать()
	
	ИмяТекущейСтраницы = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	ПараметрыФормыПодбора = Новый Структура;
	ПараметрыФормыПодбора.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	ПараметрыФормыПодбора.Вставить("ЗапретРедактирования", ЗапретРедактирования);
	
	Если ИмяТекущейСтраницы = "СтраницаМатериалы" Тогда
		
		ИмяПодбора = "ФормаДетали";
		
		ТаблицаДляФормы = Новый Структура;
		ТаблицаДляФормы.Вставить("ТаблицаДетали", Объект.СписокДеталей);
		ТаблицаДляФормы.Вставить("ТаблицаПетли", Объект.ПетлиДетали);
		
		СтрокаДанных = Элементы.СписокДеталей.ТекущиеДанные;
		ВладелецПодобра = Элементы.СписокДеталей;
		ПараметрыФормыПодбора.ТолькоПросмотр = ПараметрыФормыПодбора.ТолькоПросмотр;
		
	ИначеЕсли ИмяТекущейСтраницы = "СтраницаЯщики" Тогда
		
		ИмяПодбора = "ФормаЯщики";
		ТаблицаДляФормы = Объект.СписокЯщики;
		СтрокаДанных = Элементы.СписокЯщики.ТекущиеДанные;
		ВладелецПодобра = Элементы.СписокЯщики;
		ПараметрыФормыПодбора.ТолькоПросмотр = ПараметрыФормыПодбора.ТолькоПросмотр ИЛИ Элементы.СтраницаЯщики.ТолькоПросмотр;
		
	ИначеЕсли ИмяТекущейСтраницы = "СтраницаКомплектация" Тогда
		
		ИмяПодбора = "ФормаКомплектация";
		ТаблицаДляФормы = Объект.Комплектация;
		СтрокаДанных = Элементы.Комплектация.ТекущиеДанные;
		ВладелецПодобра = Элементы.Комплектация;
		ПараметрыФормыПодбора.ТолькоПросмотр = ПараметрыФормыПодбора.ТолькоПросмотр ИЛИ Элементы.СтраницаЯщики.ТолькоПросмотр;
		ПараметрыФормыПодбора.Вставить("НеПоказыватьЛистовой", Истина);
		
	ИначеЕсли ИмяТекущейСтраницы = "СтраницаИзделияПоКаталогу" Тогда
		
		ИмяПодбора = ПолучитьФормуИзделияПоКаталогу(Объект.Изделие); //"ФормаИзделийПоКаталогу";
		
		Если ИмяПодбора = "ФормаИзделийПоКаталогу" Тогда
			
			Если ВидИзделияКухня И ЗначениеЗаполнено(Объект.КухоннаяКоллекция) И НЕ ПроверитьЗаполненностьДанныхКухКоллекции() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните настройки кухонной коллекции",Объект.Ссылка, "КухоннаяКоллекция");
				Возврат;
			КонецЕсли;
			
			ЗаписатьПустуюСпецификацию();
			
			ТаблицаДляФормы = Объект.СписокИзделийПоКаталогу;
			ПараметрыФормыПодбора.Вставить("ТаблицаФасадов", Объект.ФасадыКаталога);
			ПараметрыФормыПодбора.Вставить("ТаблицаНастройкиКоллекции", Объект.НастройкиКоллекции);
			
		ИначеЕсли ИмяПодбора = "ФормаШкафПоКаталогу" Тогда
			
			ЗаписатьПустуюСпецификацию();
			
			ТаблицаДляФормы = Новый Структура;
			ТаблицаДляФормы.Вставить("Детали", Объект.СписокИзделийПоКаталогу);
			ТаблицаДляФормы.Вставить("Двери", Неопределено);
			СтрокаДверей = Объект.СписокДверей.НайтиСтроки(Новый Структура("ПоКаталогу", Истина));
			
			Если СтрокаДверей.Количество() = 1 Тогда
				ТаблицаДляФормы.Вставить("Двери", СтрокаДверей[0].Двери);
			КонецЕсли;
			
			//при открытии формы, спец модифицированна даже если в форме ничего не поменяют
			//иначе есть вероятность не сохранить измененную дверь
			Модифицированность = НЕ ТолькоПросмотр;
			//_____________________________________
			
		КонецЕсли;
		
		СтрокаДанных = Элементы.СписокИзделийПоКаталогу.ТекущиеДанные;
		ВладелецПодобра = Элементы.СписокИзделийПоКаталогу;
		
	КонецЕсли;
	
	ОткрытьФормуПодбора(ИмяПодбора, ТаблицаДляФормы, СтрокаДанных, ВладелецПодобра, ПараметрыФормыПодбора);
	
КонецПроцедуры // Собрать()

&НаСервереБезКонтекста
Функция ПолучитьФормуИзделияПоКаталогу(Изделие)
	
	Если Изделие.ВидИзделия = Перечисления.ВидыИзделий.ШкафКупе Тогда
		Форма = "ФормаШкафПоКаталогу";
	Иначе
		Форма = "ФормаИзделийПоКаталогу";
	КонецЕсли;
	
	Возврат Форма;
	
КонецФункции

&НаСервере
Функция ПолучитьАдресТаблицы()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ДлинаДетали", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Дробный", Новый ОписаниеТипов("Булево"));
	
	Для каждого Строка Из Объект.Комплектация Цикл
		
		НоменклатурнаяГруппа = Строка.Номенклатура.НоменклатурнаяГруппа;
		Дробный = Строка.Номенклатура.ЕдиницаИзмерения.Дробный;
		
		Если НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.СотовыеПолки 
			или НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.Корзины 
			или НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.СотовыеЭлементы Тогда
			
			Если Дробный Тогда
				
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока.Номенклатура = Строка.Номенклатура;
				НоваяСтрока.Количество = 1;
				НоваяСтрока.ДлинаДетали = Строка.Количество * 1000;
				НоваяСтрока.Дробный = Дробный;
				
			Иначе
				
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока.Номенклатура = Строка.Номенклатура;
				НоваяСтрока.Количество = Строка.Количество;
				НоваяСтрока.ДлинаДетали = 0;
				НоваяСтрока.Дробный = Дробный;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	ТЗ.Свернуть("Номенклатура, ДлинаДетали, Дробный", "Количество");
	Возврат ПоместитьВоВременноеХранилище(ТЗ);
	
КонецФункции // ПолучитьАдресТаблицы()

// Добавляет строку в табличную часть документа
// "СписокНоменклатуры"
// Параметры
//  фнПараметры  - Структура - структура с параметрами функции
//                 <продолжение описания параметра>
&НаСервере
Функция ДобавитьСтрокуНоменклатуры(фнПараметры)
	
	// { Васильев Александр Леонидович [01.11.2015]
	// Сделать.
	// } Васильев Александр Леонидович [01.11.2015]
	
КонецФункции // ДобавитьСтроку()

&НаСервере
Функция ДобавитьСтроку(фнОбъект,
	Номенклатура,
	Количество = 0,
	НомерИзделия = 0,
	Ошибки = Неопределено,
	ВидНоменклатуры = "",
	Таблица = Неопределено,
	НомерСтроки = 0,
	ОтказОшибки = Ложь,
	МатериалЗаказчика = Ложь,
	КоличествоТребуется = -1,
	ПоКаталогуМестоОбработки = "",
	СсылкаДвери = Неопределено,
	КриволинейнаяКромка = Ложь)
	
	Поле = Неопределено;
	
	Если Таблица <> Неопределено Тогда
		
		Если Таблица = "СписокДверей" Тогда
			ИмяПоля = "Двери";
		Иначе
			ИмяПоля = "Номенклатура";
		КонецЕсли;
		
		Поле = "Объект." + Таблица + "[" + (НомерСтроки - 1) + "]." + ИмяПоля;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		Если Количество > 0 Тогда
			
			Структура = Новый Структура;
			Структура.Вставить("Объект", фнОбъект);
			Структура.Вставить("Номенклатура", Номенклатура);
			Структура.Вставить("Количество", Количество);
			Структура.Вставить("НомерИзделия", НомерИзделия);
			Структура.Вставить("МатериалЗаказчика", МатериалЗаказчика);
			Структура.Вставить("КоличествоТребуется", КоличествоТребуется);
			Структура.Вставить("ПоКаталогуМестоОбработки", ПоКаталогуМестоОбработки);
			Структура.Вставить("Двери", СсылкаДвери);
			Структура.Вставить("КриволинейнаяКромка", КриволинейнаяКромка);
			
			ДобавитьСтрокуСписокНоменклатуры(Структура);
			
		Иначе
			
			Если НЕ ОтказОшибки Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, Поле, "Не верно количество (площадь) " + ВидНоменклатуры);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если НЕ ОтказОшибки Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, Поле, "Не заполнена номенклатура " + ВидНоменклатуры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции // ДобавитьСтроку()

&НаСервере
Функция ДобавитьСтрокуСписокНоменклатуры(фнПараметры)
	
	Если фнПараметры.КоличествоТребуется = -1 Тогда
		фнПараметры.КоличествоТребуется = фнПараметры.Количество;
	КонецЕсли;
	
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(фнПараметры.Номенклатура, "ВидНоменклатуры");
	
	Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Комплект Тогда
		
		Для Каждого СтрокаСостав Из фнПараметры.Номенклатура.Состав Цикл
			
			фнПараметры.КоличествоТребуется = СтрокаСостав.Количество * фнПараметры.Количество;
			НоваяСтрокаСписокНоменклатуры(фнПараметры, СтрокаСостав.Номенклатура, СтрокаСостав.Количество * фнПараметры.Количество);
		КонецЦикла;
		
	Иначе
		НоваяСтрокаСписокНоменклатуры(фнПараметры, фнПараметры.Номенклатура, фнПараметры.Количество);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НоваяСтрокаСписокНоменклатуры(фнПараметры, фнНоменклатура, фнКоличество)
	
	СвойстваНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(фнПараметры.Номенклатура, 
	"ВидНоменклатуры, ЕдиницаИзмерения, МестоОбработки, ВидНоменклатуры");
	
	ЭтоМатериал = СвойстваНоменклатуры.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал;
	
	НоваяСтрока = фнПараметры.Объект.СписокНоменклатуры.Добавить();
	НоваяСтрока.Номенклатура = фнНоменклатура;
	НоваяСтрока.Количество = (Цел(фнКоличество * 1000)) / 1000;
	НоваяСтрока.КоличествоТребуется = фнПараметры.КоличествоТребуется;
	НоваяСтрока.НомерИзделия = фнПараметры.НомерИзделия;
	НоваяСтрока.ИспользуетсяВКоробе = фнПараметры.НомерИзделия <> 0 И ЭтоМатериал;
	НоваяСтрока.УслугаСМатериаломЗаказчика = фнПараметры.МатериалЗаказчика;
	НоваяСтрока.Двери = фнПараметры.Двери;
	
	Если ЗначениеЗаполнено(фнПараметры.ПоКаталогуМестоОбработки) Тогда
		ЧерезСклад = фнПараметры.ПоКаталогуМестоОбработки = "Склад";
	Иначе
		ЧерезСклад = СвойстваНоменклатуры.МестоОбработки <> Перечисления.МестоОбработки.Цех;
	КонецЕсли;
	
	НоваяСтрока.ЧерезСклад = ЧерезСклад;
	НоваяСтрока.ПоКаталогуМестоОбработки = фнПараметры.ПоКаталогуМестоОбработки;
	НоваяСтрока.КриволинейнаяКромка = фнПараметры.КриволинейнаяКромка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУслугуКромления(НоменклатураМебельнаяКромка, ОбщаяНоменклатура)
	
	НоменклатурныеГруппы = Справочники.НоменклатурныеГруппы;
	ГруппаКромки = НоменклатураМебельнаяКромка.НоменклатурнаяГруппа;
	
	Если НоменклатураМебельнаяКромка.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
		// Для фрезеровки. Замена механизма "Кант по месту"
		Услуга = Справочники.Номенклатура.ПустаяСсылка();
	ИначеЕсли ГруппаКромки = НоменклатурныеГруппы.Кромка2_42
		ИЛИ ГруппаКромки = НоменклатурныеГруппы.Кромка2_45 Тогда
		Услуга = ОбщаяНоменклатура.КромлениеСтолешницыПристенка;
	ИначеЕсли ГруппаКромки = НоменклатурныеГруппы.КантАлюминиевый Тогда
		Услуга = ОбщаяНоменклатура.ОкантовкаАлюминием;
	ИначеЕсли ГруппаКромки = НоменклатурныеГруппы.КантТ
		ИЛИ ГруппаКромки = НоменклатурныеГруппы.КантП Тогда
		Услуга = ОбщаяНоменклатура.Окантовка;
	ИначеЕсли ГруппаКромки = НоменклатурныеГруппы.ТорцеваяРучка16мм
		ИЛИ ГруппаКромки = НоменклатурныеГруппы.ТорцеваяРучка18мм Тогда
		Услуга = ОбщаяНоменклатура.НаклейкаТорцевойРучки;
	Иначе
		Если НоменклатураМебельнаяКромка.ГлубинаДетали < 1 Тогда
			Услуга = ОбщаяНоменклатура.КромлениеТонкойКромки;
		ИначеЕсли НоменклатураМебельнаяКромка.ГлубинаДетали = 1 Тогда
			Услуга = ОбщаяНоменклатура.КромлениеСреднейКромки;
		Иначе
			Услуга = ОбщаяНоменклатура.КромлениеТолстойКромки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Услуга;
	
КонецФункции

&НаСервере
Функция РазложитьСтроку(Строка, Разделитель)
	
	Возврат СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка, Разделитель);
	
КонецФункции

&НаСервере
Функция СобратьМассив(Массив, Разделитель)
	
	Возврат СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(Массив, Разделитель);
	
КонецФункции

&НаСервере
Функция ПолучитьКромкуДляФлэшПоКаталогу(Кромка)
	
	Стр = Новый Структура;
	Стр.Вставить("Наименование", Кромка.КраткоеНаименование);
	Стр.Вставить("Код", Кромка.Код);
	
	Возврат Стр;
	
КонецФункции

&НаСервере
Процедура МасштабироватьИЗаполнитьПараметрыРедактированнойДетали(СтрокаФлэш, СтрокаТаблицы, СтрКромка)
	
	СтрокаТаблицы.ДетальРедактированная = Истина;
	
	МассивСимволов = РазложитьСтроку(СтрокаФлэш, "☻");
	СтрокаТаблицы.ДлинаКривогоПила = МассивСимволов[1];
	СтрокаТаблицы.Периметр = Число(МассивСимволов[0]);
	
	Если НЕ МассивСимволов[2] = "0" Тогда
		СтрокаТаблицы.КривойПилСверху = 1;
	Иначе
		СтрокаТаблицы.КривойПилСверху = 0;
	КонецЕсли;
	
	Если НЕ МассивСимволов[3] = "0" Тогда
		СтрокаТаблицы.КривойПилСнизу = 1;
	Иначе
		СтрокаТаблицы.КривойПилСнизу = 0;
	КонецЕсли;
	
	Если НЕ МассивСимволов[4] = "0" Тогда
		СтрокаТаблицы.КривойПилСлева = 1;
	Иначе
		СтрокаТаблицы.КривойПилСлева = 0;
	КонецЕсли;
	
	Если НЕ МассивСимволов[5] = "0" Тогда
		СтрокаТаблицы.КривойПилСправа = 1;
	Иначе
		СтрокаТаблицы.КривойПилСправа = 0;
	КонецЕсли;
	
	Если Найти(ВРег(СтрокаТаблицы.Комментарий), "ЧЕРТЕЖ") = 0 Тогда
		СтрокаТаблицы.Комментарий = "[По чертежу] " + СтрокаТаблицы.Комментарий;
	КонецЕсли;
	
	СтруктураКромка = ПолучитьКромкуДляФлэшПоКаталогу(СтрКромка.Кромка);
	
	// Замена кромки
	
	СтрокаКромка = Лев(МассивСимволов[9], СтрДлина(МассивСимволов[9]) - 1);
	
	Если ЗначениеЗаполнено(СтрокаКромка) Тогда
		
		МассивКромок = РазложитьСтроку(СтрокаКромка,"|");
		Сч = 0;
		
		Пока Сч < МассивКромок.Количество() Цикл
			
			КромМассив = РазложитьСтроку(МассивКромок[Сч], "_");
			КромМассив[0] = СтруктураКромка.Код;
			Кром = СобратьМассив(КромМассив,"_");
			МассивКромок[Сч] = Кром;
			Сч = Сч + 1;
			
		КонецЦикла;
		
		СтрокаКромка = СобратьМассив(МассивКромок,"|");
		
		СтрокаТаблицы.КантыИзРедактора = ЗначениеВСтрокуВнутр(СтрокаКромка);
		
	КонецЕсли;
	
	// Масштабирование
	
	НовРазмерY = Число(СтрокаТаблицы.ВысотаДетали);
	НовРазмерX = Число(СтрокаТаблицы.ШиринаДетали);
	
	СтрокаДляМасштабирования = МассивСимволов[8];
	
	Мас = РазложитьСтроку(СтрокаДляМасштабирования, "^");
	
	МассивЭлементов = РазложитьСтроку(Мас[1],"#");
	
	Размеры = РазложитьСтроку(Мас[0], "_");
	
	РазмерY = Число(Размеры[0])*2;
	РазмерX = Число(Размеры[1])*2;
	
	ScaleX = НовРазмерX/РазмерX;
	ScaleY = НовРазмерY/РазмерY;
	
	Размеры[0] = Формат(Число(НовРазмерY / 2),"ЧДЦ=1; ЧРД=.; ЧГ=");
	Размеры[1] = Формат(Число(НовРазмерX / 2),"ЧДЦ=1; ЧРД=.; ЧГ=");
	
	Мас[0] = СобратьМассив(Размеры,"_");
	
	МассивТочек = РазложитьСтроку(МассивЭлементов[0], "*");
	МассивЛиний = РазложитьСтроку(МассивЭлементов[1], "*");
	
	Сч = 0;
	Для каждого Точка Из МассивТочек Цикл
		Если Точка <> "" Тогда
			Координаты = РазложитьСтроку(Точка, "_");
			Координаты[0] = Формат(Окр(Число(Координаты[0]) * ScaleX, 2),"ЧДЦ=2; ЧРД=.; ЧГ=");
			Координаты[1] = Формат(Окр(Число(Координаты[1]) * ScaleY, 2),"ЧДЦ=2; ЧРД=.; ЧГ=");
			Точка = СобратьМассив(Координаты,"_");
			МассивТочек[Сч] = Точка;
		КонецЕсли;
		Сч=Сч+1;
	КонецЦикла;
	
	МассивЭлементов[0] = СобратьМассив(МассивТочек,"*");
	
	Сч = 0;
	Для каждого Линия Из МассивЛиний Цикл
		Если Линия <> "" Тогда
			Линия = РазложитьСтроку(Линия, "_");
			
			Если Число(Линия[0]) = 0 Тогда // прямая
				
				Если НЕ (Линия[3] = "") Тогда
					Линия[3] = СтруктураКромка.Наименование;
					Линия[4] = СтруктураКромка.Код;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Число(Линия[0]) = 1 Тогда // безье
				
				Если НЕ (Линия[7] = "") Тогда
					Линия[7] = СтруктураКромка.Наименование;
					Линия[8] = СтруктураКромка.Код;
				КонецЕсли;
				
				Линия[3] = Формат(Окр(Число(Линия[3]) * ScaleX,2),"ЧДЦ=2; ЧРД=.; ЧГ=");
				Линия[4] = Формат(Окр(Число(Линия[4]) * ScaleY,2),"ЧДЦ=2; ЧРД=.; ЧГ=");
				Линия[5] = Формат(Окр(Число(Линия[5]) * ScaleX,2),"ЧДЦ=2; ЧРД=.; ЧГ=");
				Линия[6] = Формат(Окр(Число(Линия[6]) * ScaleY,2),"ЧДЦ=2; ЧРД=.; ЧГ=");
			КонецЕсли;
			
			Если Число(Линия[0]) = 2 Тогда // дуга
				
				Если НЕ (Линия[5] = "") Тогда
					Линия[5] = СтруктураКромка.Наименование;
					Линия[6] = СтруктураКромка.Код;
				КонецЕсли;
				
				Линия[3] = Формат(Окр(Число(Линия[3]) * ScaleX,2),"ЧДЦ=2; ЧРД=.; ЧГ=");
				Линия[4] = Формат(Окр(Число(Линия[4]) * ScaleY,2),"ЧДЦ=2; ЧРД=.; ЧГ=");
			КонецЕсли;
			
			Линия = СобратьМассив(Линия,"_");
			МассивЛиний[Сч] = Линия;
		КонецЕсли;
		Сч=Сч+1;
	КонецЦикла;
	
	МассивЭлементов[1] = СобратьМассив(МассивЛиний,"*");
	Мас[1] = СобратьМассив(МассивЭлементов,"#");
	СтрокаДляФлэш = СобратьМассив(Мас,"^");
	
	СтрокаТаблицы.СтрокаДляФлэш = СтрокаДляФлэш;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСерийнуюНоменклатуру(Таблица)
	
	Список = Объект.СписокСерийныхИзделий;
	Список.Очистить();
	
	Для Каждого Строка Из Таблица Цикл
		
		Если ЗначениеЗаполнено(Строка.Изделие.СерийнаяНоменклатура) Тогда
			
			Стр = Список.Добавить();
			Стр.Номенклатура = Строка.Изделие.СерийнаяНоменклатура;
			Стр.Количество = 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидДеталиПластик()
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыДеталей.Ссылка
	|ИЗ
	|	Справочник.ВидыДеталей КАК ВидыДеталей
	|ГДЕ
	|	ВидыДеталей.Пластик
	|	И НЕ ВидыДеталей.ЭтоФасад";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиСхемуЯщикаДляШкафа()
	
	Схема = Неопределено;

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СхемыЯщиков.Ссылка
	|ИЗ
	|	Справочник.СхемыЯщиков КАК СхемыЯщиков
	|ГДЕ
	|	СхемыЯщиков.Наименование ПОДОБНО ""Обычный""
	|	И СхемыЯщиков.Подразделение = &Подразделение";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Схема = Выборка.Ссылка;
		
	КонецЦикла;
	
	Возврат Схема;
	
КонецФункции

&НаСервере
Процедура ОбработкаИзделийПоКаталогу()
	
	//Определим вид изделия
	
	ИзделиеШкафКупе = Объект.Изделие.ВидИзделия = Перечисления.ВидыИзделий.ШкафКупе;
	КорпусныйШкафКупе = ИзделиеШкафКупе И Объект.Изделие.КорпусныйШкаф;
	ИзделиеКухня = НЕ ИзделиеШкафКупе;
	ПрофильДвери = Неопределено;
	Серийное = Объект.Изделие.Серийное;
	
	ВсеФормулы = НайтиВсеФормулы();
	
	//Пока переменные для всех, чтоб небыло ошибок в формулах
	
	Раздвижная = Истина;
	Распашная = Ложь;
	ВысотаПроема = 1;
	ШиринаПроема = 1;
	ВысотаПол = 1;
	ШиринаЛевый = 1;
	ШиринаПравый = 1;
	ВысотаПотолок = 1;
	ВысотаПолИтог = 1;
	ШиринаЛевыйИтог = 1;
	ШиринаПравыйИтог = 1;
	ПрипускСверху = 1;
	ПрипускСнизу = 1;
	ПрипускСлева = 1;
	ПрипускСправа = 1;
	ЗавалПол = 1;
	ЗавалЛевый = 1;
	ЗавалПравый = 1;
	ЗавалПотолок = 1;
	ЗавалСтенка = 1;
	Отсек1 = 0;
	Отсек2 = 0;
	Отсек3 = 0;
	Отсек4 = 0;
	Отсек5 = 0;
	Отсек6 = 0;
	РадиусЛ = 0;
	РадиусП = 0;
	КрышаЛ = 0;
	КрышаП = 0;
	ШиринаЛевоКухня = 0;
	ШиринаПравоКухня = 0;
	
	ТаблицаИзделийПоКаталогу = Объект.СписокИзделийПоКаталогу.Выгрузить();
	ТаблицаФасадовПоКаталогу = Объект.ФасадыКаталога.Выгрузить();
	
	Если Серийное Тогда
		ЗаполнитьСерийнуюНоменклатуру(ТаблицаИзделийПоКаталогу);
	КонецЕсли;
	
	Если ИзделиеШкафКупе Тогда
		
		СписокДверей = Объект.СписокДверей;
		СтрокаПол = ТаблицаИзделийПоКаталогу.Найти(Справочники.ВидыИзделийПоКаталогу.Пол,"ВидИзделия");
		СтрокаЛевыйЭлемент = ТаблицаИзделийПоКаталогу.Найти(Справочники.ВидыИзделийПоКаталогу.ЛевыйБоковойЭлемент,"ВидИзделия");
		СтрокаПравыйЭлемент = ТаблицаИзделийПоКаталогу.Найти(Справочники.ВидыИзделийПоКаталогу.ПравыйБоковойЭлемент,"ВидИзделия");
		СтрокаПотолок = ТаблицаИзделийПоКаталогу.Найти(Справочники.ВидыИзделийПоКаталогу.Потолок,"ВидИзделия");
		СтрокаОсновной = ТаблицаИзделийПоКаталогу.Найти(Справочники.ВидыИзделийПоКаталогу.ОсновнойЭлемент,"ВидИзделия");
		
		НоменклатураМатериала = СтрокаОсновной.НоменклатураЛДСП; // Используется для формул Отсеков, дальше переопределяется, для каждого элемента.
		
		ПолНеВлияет = СтрокаПол.Изделие.НеВлияетНаОсновной;
		ЛевыйНеВлияет = СтрокаЛевыйЭлемент.Изделие.НеВлияетНаОсновной;
		ПравыйНеВлияет = СтрокаПравыйЭлемент.Изделие.НеВлияетНаОсновной;
		ПотолокНеВлияет = СтрокаПотолок.Изделие.НеВлияетНаОсновной;
		
		// Определим переменные дверей
		Если СписокДверей.Количество() = 1 Тогда
			НашаДверь = СписокДверей[0].Двери;
			ВысотаПроема = НашаДверь.ВысотаПроема;
			ШиринаПроема = НашаДверь.ШиринаПроема;
			Раздвижная = НашаДверь.ВидДвери = Перечисления.ВидыДверей.Раздвижная;
			Распашная = НЕ Раздвижная;
			ПрофильДвери = НашаДверь.АлюминПрофиль;
		Иначе
			ВысотаПроема = СтрокаОсновной.ВысотаИзделия - ?(ПолНеВлияет, СтрокаПол.ВысотаИзделия, 0) - ?(ПотолокНеВлияет, СтрокаПотолок.ВысотаИзделия, 0);
			ШиринаПроема = СтрокаОсновной.ШиринаИзделия - ?(ЛевыйНеВлияет, СтрокаЛевыйЭлемент.ШиринаИзделия, 0) - ?(ПравыйНеВлияет, СтрокаПравыйЭлемент.ШиринаИзделия, 0);
		КонецЕсли;
		
		ВысотаПол = ?(ПолНеВлияет, СтрокаПол.ВысотаИзделия, 0);
		ШиринаЛевый = ?(ЛевыйНеВлияет, СтрокаЛевыйЭлемент.ШиринаИзделия, 0);
		ШиринаПравый = ?(ПравыйНеВлияет, СтрокаПравыйЭлемент.ШиринаИзделия, 0);
		ВысотаПотолок = ?(ПотолокНеВлияет, СтрокаПотолок.ВысотаИзделия, 0);
		
		ВысотаПолИтог = СтрокаПол.ВысотаИзделия;
		ШиринаЛевыйИтог = СтрокаЛевыйЭлемент.ШиринаИзделия;
		ШиринаПравыйИтог = СтрокаПравыйЭлемент.ШиринаИзделия;
		
		РадиусЛ = СтрокаЛевыйЭлемент.Изделие.РадиусЭлемента;
		РадиусП = СтрокаПравыйЭлемент.Изделие.РадиусЭлемента;
		
		КрышаЛ = СтрокаЛевыйЭлемент.Изделие.ШиринаКрыши;
		КрышаП = СтрокаПравыйЭлемент.Изделие.ШиринаКрыши;
		
		СвояКрышаЛ = СтрокаЛевыйЭлемент.Изделие.ЭлементСКрышей;
		СвояКрышаП = СтрокаПравыйЭлемент.Изделие.ЭлементСКрышей;
		
		Если НЕ КорпусныйШкафКупе Тогда
			
			//Если рассчитываем шкаф купе не корпусный, определим завалы
			СтруктураЗавалов = Новый Структура;
			
			СтруктураЗавалов.Вставить("ЗавалПол", Число(СтрокаПол.Завал));
			СтруктураЗавалов.Вставить("ЗавалЛевый", Число(СтрокаЛевыйЭлемент.Завал));
			СтруктураЗавалов.Вставить("ЗавалПравый", Число(СтрокаПравыйЭлемент.Завал));
			СтруктураЗавалов.Вставить("ЗавалПотолок", Число(СтрокаПотолок.Завал));
			СтруктураЗавалов.Вставить("ЗавалСтенка", Число(СтрокаОсновной.Завал));
			
			СтруктураСтен = Новый Структура;
			
			СтруктураСтен.Вставить("ГипсСлева", СтрокаЛевыйЭлемент.ВидСтены = "Гипс");
			СтруктураСтен.Вставить("ГипсСправа", СтрокаПравыйЭлемент.ВидСтены = "Гипс");
			СтруктураСтен.Вставить("ГипсПотолок", СтрокаПотолок.ВидСтены = "Гипс");
			СтруктураСтен.Вставить("ГипсЗадняяСтенка", СтрокаОсновной.ВидСтены = "Гипс");
			СтруктураСтен.Вставить("НатяжнойПотолок", СтрокаПотолок.ВидСтены = "Натяжной");
			СтруктураСтен.Вставить("ЛаминатПол", СтрокаПол.ВидСтены = "Ламинат");
			
			ГипсСлева = СтрокаЛевыйЭлемент.ВидСтены = "Гипс";
			ГипсСправа = СтрокаПравыйЭлемент.ВидСтены = "Гипс";
			ГипсПотолок = СтрокаПотолок.ВидСтены = "Гипс";
			ГипсЗадняяСтенка = СтрокаОсновной.ВидСтены = "Гипс";
			НатяжнойПотолок = СтрокаПотолок.ВидСтены = "Натяжной";
			ЛаминатПол = СтрокаПол.ВидСтены = "Ламинат";
			
		КонецЕсли;
		
		СписокОтсеков = СтрокаОсновной.Изделие.СписокОтсеков;
		
		Если СписокОтсеков.Количество() > 0 Тогда
			
			Для Каждого Отсек Из СписокОтсеков Цикл
				
				Попытка
					
					Выполнить("Отсек" + Отсек.НомерСтроки + " = " + Отсек.КоэффициентОтсека);
					
				Исключение
					
					Текст = "Ошибка при формировании формул из справочника. Отсек" + Отсек.НомерСтроки;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
					
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого Элемент Из ТаблицаИзделийПоКаталогу Цикл
		
		НашеИзделие = Элемент.Изделие;
		СтруктураПодбираемойПоЦветуНоменклатуры = ЛексСервер.ПолучитьСтруктуруПодставляемойНоменклатурыПоЦветуЛДСП(Элемент.НоменклатураЛДСП, Объект.Подразделение);
		
		Если ЗначениеЗаполнено(ПрофильДвери) Тогда
			СтруктураПодбираемойПоЦветуНоменклатурыКПрофилю = ЛексСервер.ПолучитьСтруктуруПодставляемойНоменклатурыПоЦветуЛДСП(ПрофильДвери, Объект.Подразделение);
		КонецЕсли;
		
		//Размеры изделия
		
		ШиринаИзделия = Элемент.ШиринаИзделия;
		ВысотаИзделия = Элемент.ВысотаИзделия;
		ВысотаИзделияВерх = Элемент.ВысотаИзделияВерх;
		ВысотаИзделияНиз = Элемент.ВысотаИзделияНиз;
		ГлубинаИзделия = Элемент.ГлубинаИзделия;
		Европаз = Элемент.Европаз;
		Столешница = Элемент.Столешница;
		ГлубинаМатериала = Элемент.НоменклатураЛДСП.ГлубинаДетали;
		ГлубинаМатериалаДоп = Элемент.НоменклатураЛДСПДоп.ГлубинаДетали;
		ШиринаДоп = Элемент.ШиринаДоп;
		ГлубинаДоп = Элемент.ГлубинаДоп;
		РасположениеСлева = (Элемент.Расположение = Перечисления.ВидыПрисоединенныхФайлов.КартинкаЛевая);
		Сборка = Элемент.Сборка;
		
		Если ИзделиеШкафКупе И НЕ КорпусныйШкафКупе Тогда
			
			//Припуски, все равны одному припуску указанному в Каталоге изделия 
			//Припуски у ОсновногоЭлемента зависят от наличия других элементов с разных сторон
			
			Припуск = НашеИзделие.Припуск;
			
			ПрипускСверху = ?(Найти(Элемент.СтрокаПрипусков, "ПрипускСверху") <> 0, Припуск, 0);
			ПрипускСнизу = ?(Найти(Элемент.СтрокаПрипусков, "ПрипускСнизу") <> 0, Припуск, 0);
			ПрипускСлева = ?(Найти(Элемент.СтрокаПрипусков, "ПрипускСлева") <> 0, Припуск, 0);
			ПрипускСправа = ?(Найти(Элемент.СтрокаПрипусков, "ПрипускСправа") <> 0, Припуск, 0);
			
			//RonEXI: Вернули как было.
			
			ЗавалПол = ?(Найти(Элемент.СтрокаЗавалов, "ЗавалПол") <> 0, СтруктураЗавалов.ЗавалПол, 0);
			ЗавалЛевый = ?(Найти(Элемент.СтрокаЗавалов, "ЗавалЛевый") <> 0, СтруктураЗавалов.ЗавалЛевый, 0);
			ЗавалПравый = ?(Найти(Элемент.СтрокаЗавалов, "ЗавалПравый") <> 0, СтруктураЗавалов.ЗавалПравый, 0);
			ЗавалПотолок = ?(Найти(Элемент.СтрокаЗавалов, "ЗавалПотолок") <> 0, СтруктураЗавалов.ЗавалПотолок, 0);
			ЗавалСтенка = ?(Найти(Элемент.СтрокаЗавалов, "ЗавалСтенка") <> 0, СтруктураЗавалов.ЗавалСтенка, 0);
			
			//RonEXI: Костя сказал что ему нужны все завалы.
			
			//ЗавалПол = СтруктураЗавалов.ЗавалПол;
			//ЗавалЛевый = СтруктураЗавалов.ЗавалЛевый;
			//ЗавалПравый = СтруктураЗавалов.ЗавалПравый;
			//ЗавалПотолок = СтруктураЗавалов.ЗавалПотолок;
			//ЗавалСтенка = СтруктураЗавалов.ЗавалСтенка;
			
			ГипсСлева = СтруктураСтен.ГипсСлева;
			ГипсСправа = СтруктураСтен.ГипсСправа;
			ГипсПотолок = СтруктураСтен.ГипсПотолок;
			ГипсЗадняяСтенка = СтруктураСтен.ГипсЗадняяСтенка;
			НатяжнойПотолок = СтруктураСтен.НатяжнойПотолок;
			ЛаминатПол = СтруктураСтен.ЛаминатПол;
			
		КонецЕсли;
		
		//Расчет формул справочника
		Если ВсеФормулы.Количество() > 0 Тогда
			
			Фор = Новый Структура;
			
			Для Каждого ЭлементФормулы Из ВсеФормулы Цикл
				
				ЗначениФормулы = 0;
				
				Попытка
					Выполнить("ЗначениФормулы = " + ЭлементФормулы.Значение);
				Исключение
					Текст = "Ошибка при формировании формул из справочника. Наименование формулы - " + ЭлементФормулы.Ключ;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
					
					
				КонецПопытки;
				
				Фор.Вставить(ЭлементФормулы.Ключ, ЗначениФормулы);
				
			КонецЦикла;
			
		КонецЕсли;
		///////////////////////////////////////////////Список Номенклатуры////////////////////////////////////////////////////////////////////////
		//Список номенклатуры Каталога изделий в ТЧ Комплектация
		
		НоменклатураМатериала = Справочники.Номенклатура.ПустаяСсылка();
		
		# Область ДобавлениеКомплектацииИДопЭлементов
		
		СписокНоменклатурыИзделия = НашеИзделие.СписокНоменклатуры;
		
		Для Каждого Строка Из СписокНоменклатурыИзделия Цикл
			
			Количество = 0;
			ДобавитьДопЭлементДляНожек = Ложь;
			
			Попытка
				
				Выполнить("Количество = " + Строка.Количество);
				
				Если Количество = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТипЗнч(Строка.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
					
					Номенклатура = Строка.Номенклатура;
					НоменклатурнаяГруппа = Номенклатура.НоменклатурнаяГруппа;
					
					Если НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.МонтажныйУголок и ЗначениеЗаполнено(СтруктураПодбираемойПоЦветуНоменклатуры) Тогда
						
						Номенклатура = ?(ЗначениеЗаполнено(СтруктураПодбираемойПоЦветуНоменклатуры.ФурнитураКрепежная), СтруктураПодбираемойПоЦветуНоменклатуры.ФурнитураКрепежная, Номенклатура);
						
					ИначеЕсли НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.Заглушка и ЗначениеЗаполнено(СтруктураПодбираемойПоЦветуНоменклатуры) Тогда
						
						Номенклатура = ?(ЗначениеЗаполнено(СтруктураПодбираемойПоЦветуНоменклатуры.Фурнитура), СтруктураПодбираемойПоЦветуНоменклатуры.Фурнитура, Номенклатура);
						
					КонецЕсли;
					
				ИначеЕсли ТипЗнч(Строка.Номенклатура) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
					
					Если Строка.Номенклатура = Справочники.НоменклатурныеГруппы.КухонныеНожки Тогда
						
						Номенклатура = Элемент.Ножки;
						
						Если ЗначениеЗаполнено(Номенклатура.ДополнительныйЭлемент) Тогда
							ДобавитьДопЭлементДляНожек = Истина;
						КонецЕсли;
						
					ИначеЕсли Строка.Номенклатура = Справочники.НоменклатурныеГруппы.Крючок Тогда
						
						Номенклатура = Элемент.Крючки;
						
					ИначеЕсли Строка.Номенклатура = Справочники.НоменклатурныеГруппы.ЗаглушкаПодЕвровинт Тогда
						
						Номенклатура = ?(ЗначениеЗаполнено(СтруктураПодбираемойПоЦветуНоменклатуры.ЗаглушкаПодЕвровинт), СтруктураПодбираемойПоЦветуНоменклатуры.ЗаглушкаПодЕвровинт, Справочники.Номенклатура.ПустаяСсылка());
						
					ИначеЕсли Строка.Номенклатура = Справочники.НоменклатурныеГруппы.Профиль_П_образный Тогда
						
						Если НЕ ЗначениеЗаполнено(ПрофильДвери) Тогда
							Продолжить;
						КонецЕсли;
						
						НоменклатурнаяГруппаСтрока = Справочники.НоменклатурныеГруппы.ПолучитьИмяПредопределенного(Строка.Номенклатура);
						Номенклатура = ?(ЗначениеЗаполнено(СтруктураПодбираемойПоЦветуНоменклатурыКПрофилю[НоменклатурнаяГруппаСтрока]),
						СтруктураПодбираемойПоЦветуНоменклатурыКПрофилю[НоменклатурнаяГруппаСтрока],
						?(ЗначениеЗаполнено(Строка.Номенклатура.ОсновнаяНоменклатура),
						Строка.Номенклатура.ОсновнаяНоменклатура,
						Неопределено));
						
					ИначеЕсли Строка.Номенклатура.ПринадлежитЭлементу(Справочники.НоменклатурныеГруппы.Саморезы) Тогда
						
						Если НЕ ЗначениеЗаполнено(ПрофильДвери) Тогда
							Продолжить;
						КонецЕсли;
						
						НоменклатурнаяГруппаСтрока = Справочники.НоменклатурныеГруппы.ПолучитьИмяПредопределенного(Строка.Номенклатура);
						Номенклатура = ?(ЗначениеЗаполнено(СтруктураПодбираемойПоЦветуНоменклатурыКПрофилю[НоменклатурнаяГруппаСтрока]),
						СтруктураПодбираемойПоЦветуНоменклатурыКПрофилю[НоменклатурнаяГруппаСтрока], 
						?(ЗначениеЗаполнено(Строка.Номенклатура.ОсновнаяНоменклатура),
						Строка.Номенклатура.ОсновнаяНоменклатура,
						Неопределено));
						
					Иначе
						
						НоменклатурнаяГруппаСтрока = Справочники.НоменклатурныеГруппы.ПолучитьИмяПредопределенного(Строка.Номенклатура);
						Номенклатура = ?(ЗначениеЗаполнено(СтруктураПодбираемойПоЦветуНоменклатуры[НоменклатурнаяГруппаСтрока]), СтруктураПодбираемойПоЦветуНоменклатуры[НоменклатурнаяГруппаСтрока], Неопределено);
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Номенклатура) Тогда
						Номенклатура = ЛексСервер.ПолучитьНоменклатуру(ОбщаяНоменклатура, Номенклатура);
					КонецЕсли;
					
				ИначеЕсли ТипЗнч(Строка.Номенклатура) = Тип("СправочникСсылка.ОбщаяНоменклатура") Тогда 
					
					Номенклатура = ЛексСервер.ПолучитьНоменклатуру(ОбщаяНоменклатура,Строка.Номенклатура);
					
				КонецЕсли;
				
				ПоКаталогуМестоОбработки = "";
				
				Если Номенклатура.МестоОбработки = Перечисления.МестоОбработки.ПоКаталогуВЦех Тогда
					
					Если Строка.ВСборе И Элемент.Сборка Тогда
						ПоКаталогуМестоОбработки = "Цех";
					Иначе
						ПоКаталогуМестоОбработки = "Склад";
					КонецЕсли;
					
				КонецЕсли;
				
				ДобавитьКомплектацию(Номенклатура, Количество, Элемент.НомерСтроки, ПоКаталогуМестоОбработки);
				
				Если ДобавитьДопЭлементДляНожек Тогда
					
					ДобавитьДопЭлементДляНожек = Ложь;
					КоличествоДоп = Цел(Количество / 2);
					ДобавитьКомплектацию(Номенклатура.ДополнительныйЭлемент, КоличествоДоп, Элемент.НомерСтроки, ПоКаталогуМестоОбработки);
					
				КонецЕсли;
				
			Исключение
				Текст = "Ошибка при формировании формул списка номенклатуры каталога изделий " + Элемент.Изделие;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			КонецПопытки;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Элемент.Мойка) Тогда
			ДобавитьКомплектацию(Элемент.Мойка, 1, Элемент.НомерСтроки);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.Сушка) Тогда
			
			Если Элемент.Сборка Тогда
				ПоКаталогуМестоОбработки = "Цех";
			Иначе
				ПоКаталогуМестоОбработки = "Склад";
			КонецЕсли;
			
			ДобавитьКомплектацию(Элемент.Сушка, 1, Элемент.НомерСтроки, ПоКаталогуМестоОбработки);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.ВолшебныйУголок) Тогда
			
			Если Элемент.Сборка Тогда
				ПоКаталогуМестоОбработки = "Цех";
			Иначе
				ПоКаталогуМестоОбработки = "Склад";
			КонецЕсли;
			
			ДобавитьКомплектацию(Элемент.ВолшебныйУголок, 1, Элемент.НомерСтроки, ПоКаталогуМестоОбработки);
			
		КонецЕсли;
		
		#КонецОбласти
		
		ПараметрыТаблицаФасадов = ТаблицаФасадовПоКаталогу.НайтиСтроки(Новый Структура("sUID", Элемент.UID));
		
		///////////////////////////////////////////////////////////////////Материалы//////////////////////////////////////////////////////////////////////////////////////
		
		# Область ДобавлениеМатериалов
		
		СписокДеталейИзделия = НашеИзделие.СписокДеталей;
		
		Для Каждого Строка Из СписокДеталейИзделия Цикл
			
			ДанныеДетали = ПолучитьДанныеДетали(Строка.ВидДетали);
			
			ЭтоФасад = Ложь;
			ЕстьПластик = Ложь;
			ЕстьДопСклейка = Ложь;
			
			Если ПараметрыТаблицаФасадов.Количество() > 0 Тогда
				
				СтрокаФасада = Неопределено;
				
				Для Каждого СтрокаФ Из ПараметрыТаблицаФасадов Цикл
					
					Если СтрокаФ.НомерДетали = Строка.НомерСтроки И СтрокаФ.ВидЭлемента = "Фасад" Тогда
						
						СтрокаФасада = СтрокаФ;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ЗначениеЗаполнено(СтрокаФасада) И СтрокаФасада.ВидЭлемента = "Фасад" Тогда
					
					Если ЗначениеЗаполнено(СтрокаФасада.ДопЭлемент) Тогда
						
						Если Элемент.Сборка Тогда
							ПоКаталогуМестоОбработки = "Цех";
						Иначе
							ПоКаталогуМестоОбработки = "Склад";
						КонецЕсли;
						
						ДобавитьКомплектацию(СтрокаФасада.ДопЭлемент, 1, Элемент.НомерСтроки, ПоКаталогуМестоОбработки);
						
					КонецЕсли;
					
					Если СтрокаФасада.БезФасада Тогда
						Продолжить;
					КонецЕсли;
					
					ЭтоФасад = Истина;
					
					ВидДеталиФасад = СтрокаФасада.ВидДеталиФасад;
					НоменклатураФасад = СтрокаФасада.НоменклатураФасада;
					ДопНоменклатураФасад = СтрокаФасада.ДопНоменклатураФасада;
					ДопСклейкаФасад = СтрокаФасада.ДопСклейкаФасада;
					Кромка = СтрокаФасада.ОбрамлениеФасада;
					РучкаФасада = СтрокаФасада.НоменклатураРучки;
					Петли = СтрокаФасада.Петли;
					КоличествоПетель = СтрокаФасада.КоличествоПетель;
					БезПетель = СтрокаФасада.БезПетель;
					БезРучки = СтрокаФасада.БезРучки;
					ЕстьПластик = ВидДеталиФасад.Пластик;
					ЕстьДопСклейка = ВидДеталиФасад.ОбязательноеПолеДопСклейка; 
					МежцентровоеРасстояние = 0;
					
					РасположениеПазовИРучкиНаФасадах = СтрокаФасада.РасположениеПазовИРучкиНаФасадах;
					
					Если БезРучки Тогда
						МежцентровоеРасстояние = СтрокаФасада.МежцентровоеРасстояние;
						РасположениеПазовИРучкиНаФасадах = НайтиРасположениеБезРучки(РасположениеПазовИРучкиНаФасадах);
					КонецЕсли;
					
					Если Элемент.Расположение = Перечисления.ВидыПрисоединенныхФайлов.КартинкаПравая Тогда
						РасположениеПазовИРучкиНаФасадах = РасположениеПазовИРучкиНаФасадах.ЗеркальноеПоложение;
					КонецЕсли;
					
					Если СтрокаФасада.ПовернутьФасад Тогда
						РасположениеПазовИРучкиНаФасадах = РасположениеПазовИРучкиНаФасадах.ПоворотВправо;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаФасада.МеханизмФасада) Тогда
						
						Если Элемент.Сборка Тогда
							ПоКаталогуМестоОбработки = "Цех";
						Иначе
							ПоКаталогуМестоОбработки = "Склад";
						КонецЕсли;
						
						ДобавитьКомплектацию(СтрокаФасада.МеханизмФасада, СтрокаФасада.КоличествоМеханизмФасада, Элемент.НомерСтроки, ПоКаталогуМестоОбработки);
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаФасада.Демпфер) Тогда
						
						Если Элемент.Сборка Тогда
							ПоКаталогуМестоОбработки = "Цех";
						Иначе
							ПоКаталогуМестоОбработки = "Склад";
						КонецЕсли;
						
						Демпфер = ЛексСервер.ПолучитьНоменклатуру(ОбщаяНоменклатура,СтрокаФасада.Демпфер);
						ДобавитьКомплектацию(Демпфер, СтрокаФасада.КоличествоДемпфер, Элемент.НомерСтроки, ПоКаталогуМестоОбработки);
						
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ИзделиеШкафКупе И ДанныеДетали.ЭтоФасад Тогда
				
				ЭтоФасад = Истина;
				
				ВидДеталиФасад = Строка.ВидДетали;
				НоменклатураФасад = Элемент.НоменклатураЛДСП;
				Кромка = Элемент.КромкаЛДСП;
				РучкаФасада = Элемент.Ручка;
				Петли = Строка.Петли;
				КоличествоПетель = Строка.КоличествоПетель;
				РасположениеПазовИРучкиНаФасадах = Строка.РасположениеПазовИРучкиНаФасадах;
				
			КонецЕсли;
			
			Количество = 0;
			
			НоваяСтрока = Объект.СписокДеталей.Добавить();
			НоваяСтрока.ВидДетали = ?(ЭтоФасад, ВидДеталиФасад, Строка.ВидДетали);
			
			ДанныеДетали = ПолучитьДанныеДетали(НоваяСтрока.ВидДетали);
			
			КромкаНоменклатуры = Неопределено;
			
			ЕстьЛДСП = Ложь;
			ЕстьДВП = Ложь;
			ЕстьМДФ = Ложь;
			ЕстьСтекло = Ложь;
			ЕстьСтолешница = Ложь;
			
			Для Каждого НомГруппа ИЗ ДанныеДетали.НомГруппы Цикл
				
				Знч = НомГруппа.Значение;
				
				Если Знч.ПолеВыбора = "Текстура" Тогда
					
					Если Знч.Группа.ПринадлежитЭлементу(Справочники.НоменклатурныеГруппы.ЛДСП) 
						ИЛИ Знч.Группа = Справочники.НоменклатурныеГруппы.ЛДСП Тогда
						
						ЕстьЛДСП = Истина;
						
					КонецЕсли;
					
					Если Знч.Группа.ПринадлежитЭлементу(Справочники.НоменклатурныеГруппы.ДВП) 
						ИЛИ Знч.Группа = Справочники.НоменклатурныеГруппы.ДВП Тогда
						
						ЕстьДВП = Истина;
						
					КонецЕсли;
					
					Если Знч.Группа.ПринадлежитЭлементу(Справочники.НоменклатурныеГруппы.МДФ) 
						ИЛИ Знч.Группа = Справочники.НоменклатурныеГруппы.МДФ Тогда
						
						//RonEXI: Возможность выбрать пластик вместо МДФ, для боковушки
						Если НЕ ЭтоФасад И (Элемент.НоменклатураМДФ.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.Пластик) Тогда 
							НоваяСтрока.ВидДетали = ПолучитьВидДеталиПластик();
							ДанныеДетали = ПолучитьДанныеДетали(НоваяСтрока.ВидДетали);
							ЕстьПластик = Истина;
						Иначе
							ЕстьМДФ = Истина;
						КонецЕсли;
						
					КонецЕсли;
					
					Если Знч.Группа.ПринадлежитЭлементу(Справочники.НоменклатурныеГруппы.Стекло) 
						ИЛИ Знч.Группа = Справочники.НоменклатурныеГруппы.Стекло
						ИЛИ Знч.Группа.ПринадлежитЭлементу(Справочники.НоменклатурныеГруппы.Зеркало) 
						ИЛИ Знч.Группа = Справочники.НоменклатурныеГруппы.Зеркало Тогда
						
						ЕстьСтекло = Истина;
						
					КонецЕсли;
					
					Если Знч.Группа.ПринадлежитЭлементу(Справочники.НоменклатурныеГруппы.Столешница) 
						ИЛИ Знч.Группа = Справочники.НоменклатурныеГруппы.Столешница Тогда
						
						ЕстьСтолешница = Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ОбязПоля = ДанныеДетали.ОбязательныеПоля;
			ДоступныеПоля = ДанныеДетали.ДоступностьПолей;
			
			Если ДанныеДетали.ЗапрашиватьМежцентровоеРасстояние Тогда
				НоваяСтрока.МежцентровоеРасстояние = МежцентровоеРасстояние;
			КонецЕсли;
			
			
			Если НЕ ДанныеДетали.ЭтоФасад Тогда
				
				Если ЕстьЛДСП Тогда
					
					Если Серийное Тогда
						
						Если Строка.ВторойЦветСерийное Тогда
							НоваяСтрока.Номенклатура = Элемент.НоменклатураЛДСПДоп;
							КромкаНоменклатуры = Элемент.КромкаЛДСПДоп;
						Иначе
							НоваяСтрока.Номенклатура = Элемент.НоменклатураЛДСП;
							КромкаНоменклатуры = Элемент.КромкаЛДСП;
						КонецЕсли;
						
					Иначе
						
						Если Строка.ВторойЦвет Тогда
							НоваяСтрока.Номенклатура = Элемент.НоменклатураЛДСПДоп;
							КромкаНоменклатуры = Элемент.КромкаЛДСПДоп;
						Иначе
							НоваяСтрока.Номенклатура = Элемент.НоменклатураЛДСП;
							КромкаНоменклатуры = Элемент.КромкаЛДСП;
						КонецЕсли;
						
					КонецЕсли;
					
					Если ДанныеДетали.Клееная Тогда
						НоваяСтрока.НоменклатураДляСклеивания = Элемент.НоменклатураДляСклеивания;
					КонецЕсли;
					
				ИначеЕсли ЕстьДВП Тогда
					
					НоваяСтрока.Номенклатура = Элемент.НоменклатураДВП;
					
				ИначеЕсли ЕстьСтекло Тогда
					
					НоваяСтрока.Номенклатура = Элемент.НоменклатураСтекло;
					
				ИначеЕсли ЕстьМДФ Тогда
					
					НоваяСтрока.Номенклатура = Элемент.НоменклатураМДФ;
					КромкаНоменклатуры = Элемент.КромкаМДФ;
					
				ИначеЕсли ЕстьПластик Тогда
					
					НоваяСтрока.Номенклатура = Элемент.НоменклатураЛДСП;
					НоваяСтрока.НоменклатураДляСклеивания = Элемент.НоменклатураМДФ;
					КромкаНоменклатуры = Элемент.КромкаМДФ;
					
				ИначеЕсли ЕстьСтолешница Тогда
					
					НоваяСтрока.Номенклатура = Элемент.НоменклатураСтолешница;
					КромкаНоменклатуры = Элемент.КромкаСтолешница;
					
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока.Номенклатура = НоменклатураФасад;
				
				Если ЕстьПластик Тогда
					НоваяСтрока.НоменклатураДляСклеивания = ДопНоменклатураФасад;
				КонецЕсли;
				
				Если ЕстьДопСклейка Тогда
					НоваяСтрока.ДопНоменклатураДляСклеивания = ДопСклейкаФасад;
				КонецЕсли;
				
				КромкаНоменклатуры = Кромка;
				
				НоваяСтрока.Петли = ?(ЗначениеЗаполнено(Петли), Петли, Неопределено);
				НоваяСтрока.КоличествоПетель = ?(ЗначениеЗаполнено(КоличествоПетель), КоличествоПетель, 0);
				НоваяСтрока.РасположениеПазовИРучкиНаФасадах = ?(ЗначениеЗаполнено(РасположениеПазовИРучкиНаФасадах), РасположениеПазовИРучкиНаФасадах, Неопределено);
				НоваяСтрока.ДиаметрПазов = Строка.ДиаметрПазов;
				НоваяСтрока.БезПетель = БезПетель;
				
				НоваяСтрока.РадиусФасада = "";
				
				Если ЗначениеЗаполнено(РучкаФасада) Тогда
					НоваяСтрока.Ручка = РучкаФасада;
				КонецЕсли;
				
			КонецЕсли;
			
			НоменклатураМатериала = НоваяСтрока.Номенклатура;
			
			СтруктураПодбираемойПоЦветуКромки = ЛексСервер.ПолучитьСтруктуруПодставляемойНоменклатурыПоЦветуЛДСП(НоваяСтрока.Номенклатура, Объект.Подразделение);
			
			Количество = 0;
			
			Попытка
				Выполнить("Количество = " + Строка.Количество);
			Исключение
				Текст = "Ошибка при формировании формул для Количество """ + Строка.ИмяДетали + """ каталога изделий " + Элемент.Изделие;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			КонецПопытки;
			
			Если НЕ ЗначениеЗаполнено(Количество) Тогда
				
				Объект.СписокДеталей.Удалить(НоваяСтрока.НомерСтроки-1);
				Продолжить;
				
			КонецЕсли;
			
			НоваяСтрока.Количество = Количество;
			
			Если ЗначениеЗаполнено(Строка.ВысотаДетали) И ЗначениеЗаполнено(Строка.ШиринаДетали) Тогда
				
				Попытка
					Выполнить("НоваяСтрока.ВысотаДетали = " + Строка.ВысотаДетали);
					Выполнить("НоваяСтрока.ШиринаДетали = " + Строка.ШиринаДетали);
				Исключение
					Текст = "Ошибка при формировании формул для """ + Строка.ИмяДетали + """ каталога изделий " + Элемент.Изделие;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				КонецПопытки;
				
				Если ЭтоФасад И ЗначениеЗаполнено(СтрокаФасада) Тогда
					Если СтрокаФасада.ПовернутьФасад Тогда
						ВременноеЗначение = НоваяСтрока.ВысотаДетали;
						НоваяСтрока.ВысотаДетали = НоваяСтрока.ШиринаДетали;
						НоваяСтрока.ШиринаДетали = ВременноеЗначение;
					КонецЕсли;
				Иначе					
					//Расчет коэффициента масштабирования криволинейной детали
					Если ЗначениеЗаполнено(Строка.СтрокаДляФлэш) Тогда
						МасштабироватьИЗаполнитьПараметрыРедактированнойДетали(Строка.СтрокаДляФлэш, НоваяСтрока, ОпределитьКромку(Строка.ВидКромкиРедактор, КромкаНоменклатуры));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Номенклатура) И ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				НоваяСтрока.Номенклатура = Строка.Номенклатура;
			КонецЕсли;
			
			НоваяСтрока.СоблюдениеТекстуры = НоваяСтрока.Номенклатура.НаличиеТекстуры;
			
			НужнаКромка = (ОбязПоля.ОбязательноеПолеКромкаВерх
			ИЛИ ОбязПоля.ОбязательноеПолеКромкаНиз
			ИЛИ ОбязПоля.ОбязательноеПолеКромкаЛево
			ИЛИ ОбязПоля.ОбязательноеПолеКромкаПраво
			ИЛИ ДоступныеПоля.ДоступностьПоляКромкаВерх
			ИЛИ ДоступныеПоля.ДоступностьПоляКромкаНиз
			ИЛИ ДоступныеПоля.ДоступностьПоляКромкаЛево
			ИЛИ ДоступныеПоля.ДоступностьПоляКромкаПраво);
			
			Если Строка.КромкаСверху Тогда
				СтруктураКромки = ОпределитьКромку(Строка.ВидКромкиСверху, КромкаНоменклатуры);
				НоваяСтрока.ПереключательКромкаСверху = СтруктураКромки.ПереключательКромка;
				НоваяСтрока.ВыборМебельнойКромкиСверху = СтруктураКромки.Кромка;
				
				Если НужнаКромка И НЕ ЗначениеЗаполнено(СтруктураКромки.Кромка) Тогда
					Сообщить("Деталь: " + НоваяСтрока.НомерСтроки+".СВЕРХУ. Не найдена подходящая по цвету кромка. Заполните кромку вручную.");
				КонецЕсли;
				
				ЗаполнитьКромки(НоваяСтрока, СтруктураКромки);
				
			КонецЕсли;
			
			Если Строка.КромкаСлева Тогда
				СтруктураКромки = ОпределитьКромку(Строка.ВидКромкиСлева, КромкаНоменклатуры);
				НоваяСтрока.ПереключательКромкаСлева = СтруктураКромки.ПереключательКромка;
				НоваяСтрока.ВыборМебельнойКромкиСлева = СтруктураКромки.Кромка;
				
				Если НужнаКромка И НЕ ЗначениеЗаполнено(СтруктураКромки.Кромка) Тогда
					Сообщить("Деталь: " + НоваяСтрока.НомерСтроки + ".СЛЕВА. Не найдена подходящая по цвету кромка. Заполните кромку вручную.");
				КонецЕсли;
				
				ЗаполнитьКромки(НоваяСтрока, СтруктураКромки);
				
			КонецЕсли;
			
			Если Строка.КромкаСнизу Тогда
				СтруктураКромки = ОпределитьКромку(Строка.ВидКромкиСнизу, КромкаНоменклатуры);
				НоваяСтрока.ПереключательКромкаСнизу = СтруктураКромки.ПереключательКромка;
				НоваяСтрока.ВыборМебельнойКромкиСнизу = СтруктураКромки.Кромка;
				
				Если НужнаКромка И НЕ ЗначениеЗаполнено(СтруктураКромки.Кромка) Тогда
					Сообщить("Деталь: "+НоваяСтрока.НомерСтроки+".СНИЗУ. Не найдена подходящая по цвету кромка. Заполните кромку вручную.");
				КонецЕсли;
				
				ЗаполнитьКромки(НоваяСтрока, СтруктураКромки);
				
			КонецЕсли;
			
			Если Строка.КромкаСправа Тогда
				СтруктураКромки = ОпределитьКромку(Строка.ВидКромкиСправа, КромкаНоменклатуры);
				НоваяСтрока.ПереключательКромкаСправа = СтруктураКромки.ПереключательКромка;
				НоваяСтрока.ВыборМебельнойКромкиСправа = СтруктураКромки.Кромка;
				
				Если НужнаКромка И НЕ ЗначениеЗаполнено(СтруктураКромки.Кромка) Тогда
					Сообщить("Деталь: "+НоваяСтрока.НомерСтроки+".СПРАВА. Не найдена подходящая по цвету кромка. Заполните кромку вручную.");
				КонецЕсли;
				
				ЗаполнитьКромки(НоваяСтрока, СтруктураКромки);
				
			КонецЕсли;
			
			Если ДанныеДетали.СпецФасад Тогда
				
				КромкиОдинаковые = ( НоваяСтрока.ВыборМебельнойКромкиСверху = НоваяСтрока.ВыборМебельнойКромкиСнизу )
				И ( НоваяСтрока.ВыборМебельнойКромкиСверху = НоваяСтрока.ВыборМебельнойКромкиСлева )
				И ( НоваяСтрока.ВыборМебельнойКромкиСверху = НоваяСтрока.ВыборМебельнойКромкиСправа );
				
				Если ЗначениеЗаполнено(НоваяСтрока.ВыборМебельнойКромкиСверху) И КромкиОдинаковые Тогда 
					НоваяСтрока.УниверсальнаяКромка = НоваяСтрока.ВыборМебельнойКромкиСверху;
				Иначе
					Сообщить("Разная кромка фасада. Ошибка: № 005.");
				КонецЕсли;
				
			КонецЕсли;
			
			ТорцеваяЛента = Новый Структура;
			ТорцеваяЛента.Вставить("ТорцеваяЛентаСверху", НоваяСтрока.ВыборМебельнойКромкиСверху);
			ТорцеваяЛента.Вставить("ТорцеваяЛентаСнизу", НоваяСтрока.ВыборМебельнойКромкиСнизу);
			ТорцеваяЛента.Вставить("ТорцеваяЛентаСлева", НоваяСтрока.ВыборМебельнойКромкиСлева);
			ТорцеваяЛента.Вставить("ТорцеваяЛентаСправа", НоваяСтрока.ВыборМебельнойКромкиСправа);
			
			// Размеры с учетом кромки
			СтруктураРазмеров = Документы.Спецификация.ПолучитьРазмерыМатериалов(НоваяСтрока.Номенклатура, ТорцеваяЛента);
			ВысотаДеталиБезКромки = НоваяСтрока.ВысотаДетали - СтруктураРазмеров.ВычитаемоеДляВысоты;
			ШиринаДеталиБезКромки = НоваяСтрока.ШиринаДетали - СтруктураРазмеров.ВычитаемоеДляШирины;
			
			НоваяСтрока.ВысотаДетали = ?(ВысотаДеталиБезКромки >= 0, ВысотаДеталиБезКромки, 0);
			НоваяСтрока.ШиринаДетали = ?(ШиринаДеталиБезКромки >= 0, ШиринаДеталиБезКромки, 0);
			
			Если ЗначениеЗаполнено(Строка.РадиусЛевоВерх)Тогда
				Попытка
					Выполнить("R1 = " + Строка.РадиусЛевоВерх);
				Исключение
					Текст = "Ошибка при формировании формул радиусов """ + Строка.ИмяДетали + """ каталога изделий " + Элемент.Изделие;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				КонецПопытки;
			Иначе
				R1 = 0;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.РадиусПравоВерх)Тогда
				Попытка
					Выполнить("R2 = " + Строка.РадиусПравоВерх);
				Исключение
					Текст = "Ошибка при формировании формул радиусов """ + Строка.ИмяДетали + """ каталога изделий " + Элемент.Изделие;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				КонецПопытки;
			Иначе
				R2 = 0;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.РадиусПравоНиз)Тогда
				Попытка
					Выполнить("R3 = " + Строка.РадиусПравоНиз);
				Исключение
					Текст = "Ошибка при формировании формул радиусов """ + Строка.ИмяДетали + """ каталога изделий " + Элемент.Изделие;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				КонецПопытки;
			Иначе
				R3 = 0;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.РадиусЛевоНиз)Тогда
				Попытка
					Выполнить("R4 = " + Строка.РадиусЛевоНиз);
				Исключение
					Текст = "Ошибка при формировании формул радиусов """ + Строка.ИмяДетали + """ каталога изделий " + Элемент.Изделие;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				КонецПопытки;
			Иначе
				R4 = 0;
			КонецЕсли;
			
			НоваяСтрока.РадиусЛевоВерх = R1 - (R1 % 50);
			НоваяСтрока.РадиусПравоВерх = R2 - (R2 % 50);
			НоваяСтрока.РадиусПравоНиз = ?(Строка.Срез, R3, R3 - (R3 % 50));
			НоваяСтрока.РадиусЛевоНиз = R4 - (R4 % 50);
			НоваяСтрока.Срез = Строка.Срез;
			
			Если ДанныеДетали.ЭтоФасад Тогда
				
				Если ЗначениеЗаполнено(НоваяСтрока.РасположениеПазовИРучкиНаФасадах) И НоваяСтрока.КоличествоПетель > 0 Тогда
					
					тПоложениеПазов = НоваяСтрока.РасположениеПазовИРучкиНаФасадах.ПоложениеПазов;
					
					Если тПоложениеПазов <> Перечисления.Стороны.Отсутствует Тогда
						
						Если Строка.ФормулаПетли1 <> "" 
						ИЛИ  Строка.ФормулаПетли2 <> ""
						ИЛИ  Строка.ФормулаПетли3 <> ""
						ИЛИ  Строка.ФормулаПетли4 <> ""
						ИЛИ  Строка.ФормулаПетли5 <> "" Тогда
						
							ПМас = Новый Массив();
							
							Для Сч = 1 По НоваяСтрока.КоличествоПетель Цикл
								
								ПМас.Добавить(0);
								
								Если Строка["ФормулаПетли" + Сч] <> "" Тогда
									
									Попытка
										Выполнить("ПМас[" + (Сч-1) + "] = " + Строка["ФормулаПетли" + Сч]);
									Исключение
										Текст = "Ошибка при формировании формул для петель """ + Строка.ИмяДетали + """ каталога изделий " + Элемент.Изделие;
										ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
									КонецПопытки;
									
								КонецЕсли;
								
							КонецЦикла;
							
							НоваяСтрока.ИдентификаторПетли = Новый УникальныйИдентификатор();
							
							Для Сч = 1 По НоваяСтрока.КоличествоПетель Цикл
								
								Стр = Объект.ПетлиДетали.Добавить();
							    Стр.ИдентификаторДетали = НоваяСтрока.ИдентификаторПетли;
							    Стр.Сторона = тПоложениеПазов; 
							    Стр.Координата = ПМас[Сч - 1];
								
							КонецЦикла;
							
						Иначе	
					
							ОтступОтв = 100;
							ДлинаОтв = 0;
							
							Если тПоложениеПазов = Перечисления.Стороны.Слева
								ИЛИ тПоложениеПазов = Перечисления.Стороны.Справа Тогда
								
								ДлинаОтв = НоваяСтрока.ВысотаДетали + СтруктураРазмеров.ВычитаемоеДляВысоты; 
								
							ИначеЕсли тПоложениеПазов = Перечисления.Стороны.Сверху
								ИЛИ тПоложениеПазов = Перечисления.Стороны.Снизу Тогда 
								
								ДлинаОтв = НоваяСтрока.ШиринаДетали + СтруктураРазмеров.ВычитаемоеДляШирины;
								
							КонецЕсли;
							
							Если ДлинаОтв > 0 Тогда
							
								НоваяСтрока.ИдентификаторПетли = Новый УникальныйИдентификатор();
								
								ШагОтв = (ДлинаОтв - ОтступОтв * 2) / (НоваяСтрока.КоличествоПетель - 1);
								
								Для ИндОтв = 0 ПО (НоваяСтрока.КоличествоПетель - 1) Цикл
									
								   Стр = Объект.ПетлиДетали.Добавить();
								   Стр.ИдентификаторДетали = НоваяСтрока.ИдентификаторПетли;
								   Стр.Сторона = тПоложениеПазов; 
								   Стр.Координата = ОКР(ОтступОтв + (ШагОтв * ИндОтв));
								   
							    КонецЦикла;
						
							КонецЕсли;
							
						КонецЕсли;

					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока.СтруктураОтверстий = Строка.СтруктураОтверстий;
				
				Если Строка.ЕвропазВерх Тогда НоваяСтрока.ЕвропазВерх = Элемент.Европаз; КонецЕсли;
				Если Строка.ЕвропазНиз Тогда НоваяСтрока.ЕвропазНиз = Элемент.Европаз; КонецЕсли;
				Если Строка.ЕвропазЛево Тогда НоваяСтрока.ЕвропазЛево = Элемент.Европаз; КонецЕсли;
				Если Строка.ЕвропазПраво Тогда НоваяСтрока.ЕвропазПраво = Элемент.Европаз; КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтрокаДляФлэш) Тогда 
				
				СтруктураПериметраИПила = ЛексКлиентСервер.ПосчитатьПериметрИКривойПил(НоваяСтрока.ВысотаДетали, НоваяСтрока.ШиринаДетали, R1 + R2 + ?(НоваяСтрока.Срез, 0, R3) + R4, ?(НоваяСтрока.Срез, R3, 0));
				НоваяСтрока.Периметр = СтруктураПериметраИПила.Периметр;
				НоваяСтрока.ДлинаКривогоПила = СтруктураПериметраИПила.ДлинаКривогоПила;
				НоваяСтрока.КосойПил = СтруктураПериметраИПила.КоличествоКосогоПила;
				
			КонецЕсли;
			
			НоваяСтрока.Обтачивать = Строка.Обтачивать;
			НоваяСтрока.Постформинг = Строка.Постформинг;
			НоваяСтрока.Идентификатор = Строка.Идентификатор;
			НоваяСтрока.НомерИзделия = Элемент.НомерСтроки;
			НоваяСтрока.НомерДеталиИзделия = Строка.НомерСтроки;
			
		КонецЦикла; // Строка Из СписокДеталейИзделия
		
		#КонецОбласти
		
		///////////////////////////////////////////////////////////////////ЯЩИКИ//////////////////////////////////////////////////////////////////////////////////////
		
		# Область ДобавлениеЯщиков
		
		СписокЯщикиИзделия = НашеИзделие.СписокЯщики;
		
		Для Каждого Строка Из СписокЯщикиИзделия Цикл
			
			СтрокаПоиска = Неопределено;
			НоваяСтрока = Объект.СписокЯщики.Добавить();
			
			Если ИзделиеШкафКупе Тогда
				
				НоваяСтрока.СхемаЯщика = НайтиСхемуЯщикаДляШкафа();
				
				Если НЕ ЗначениеЗаполнено(НоваяСтрока.СхемаЯщика) Тогда
					
					Текст = "Не найдена схема ящика ""Обычный ящик""";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
					
				КонецЕсли;
				
				НоваяСтрока.Номенклатура = Элемент.НоменклатураЛДСП;
				НоменклатураМатериала = Элемент.НоменклатураЛДСП;
				
				Если ЗначениеЗаполнено(Строка.ДноНоменклатура) Тогда
					НоваяСтрока.ДноНоменклатура = ЛексСервер.ПолучитьНоменклатуру(ОбщаяНоменклатура,Строка.ДноНоменклатура);
				КонецЕсли;
				
				Попытка
					Выполнить("НоваяСтрока.ГлубинаЯщика = " + Строка.ГлубинаЯщика);
					Выполнить("НоваяСтрока.ПроемЯщика = " + Строка.ПроемЯщика);
					Выполнить("НоваяСтрока.ВысотаЯщика = " + Строка.ВысотаЯщика);
				Исключение
					Текст = "Ошибка при формировании формул для ящиков каталога изделий: ГлубинаЯщика, ПроемЯщика, ВысотаЯщика" + Элемент.Изделие;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				КонецПопытки;
				
				НоваяСтрока.НаправляющиеНоменклатура = НайтиНаправляющиеНоменклатура(Справочники.НоменклатурныеГруппы.НаправляющиеШариковые35, НоваяСтрока.ГлубинаЯщика);
				
				Если НЕ ЗначениеЗаполнено(НоваяСтрока.НаправляющиеНоменклатура) Тогда
					Текст = "Внимание! Направляющая не найдена у " + Элемент.Изделие;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				КонецЕсли;
				
				НоваяСтрока.ГлубинаЯщика = НоваяСтрока.НаправляющиеНоменклатура.ДлинаДетали;
				
				Если ЗначениеЗаполнено(СтруктураПодбираемойПоЦветуНоменклатуры)
					И ЗначениеЗаполнено(СтруктураПодбираемойПоЦветуНоменклатуры.Кромка045_19) Тогда
					
					НоваяСтрока.КромкаНоменклатура = СтруктураПодбираемойПоЦветуНоменклатуры.Кромка045_19;
					
				ИначеЕсли Элемент.КромкаЛДСП.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.Кромка045_19 Тогда
					
					НоваяСтрока.КромкаНоменклатура = Элемент.КромкаЛДСП;
					
				Иначе
					Текст = "Внимание! Кромка для ящика не найдена (" + НашеИзделие + ")";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				КонецЕсли;
				
			Иначе
				
				СтрокаПоиска = ПараметрыТаблицаФасадов.Получить(Строка.НомерСтроки - 1);
				
				Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
					
					НоваяСтрока.СхемаЯщика = СтрокаПоиска.СхемаЯщика;
					НоваяСтрока.Номенклатура = СтрокаПоиска.НоменклатураЭлемента;
					НоменклатураМатериала = СтрокаПоиска.НоменклатураЭлемента;
					НоваяСтрока.КромкаНоменклатура = СтрокаПоиска.ТорцовкаЭлемента;
					НоваяСтрока.КриволинейныйВыпилПодРучку = СтрокаПоиска.КриволинейныйВыпилПодРучку И (НЕ СтрокаПоиска.БезФасада);
					
					Если ЗначениеЗаполнено(СтрокаПоиска.ДноЯщика) Тогда
						НоваяСтрока.ДноНоменклатура = СтрокаПоиска.ДноЯщика;
					КонецЕсли;
					
					Попытка
						
						Выполнить("НоваяСтрока.ГлубинаЯщика = " + Строка.ГлубинаЯщика);
						Выполнить("НоваяСтрока.ПроемЯщика = " + Строка.ПроемЯщика);
						Выполнить("НоваяСтрока.ВысотаЯщика = " + Строка.ВысотаЯщика);
						
						КриволинейныйВыпилПодРучку = СтрокаПоиска.КриволинейныйВыпилПодРучку;
						
						МинВысота = 0;
						МинПроем = 0;
						
						Выполнить("МинВысота = " + НоваяСтрока.СхемаЯщика.МинимальнаяВысота);
						Выполнить("МинПроем = " + НоваяСтрока.СхемаЯщика.МинимальныйПроем);
						
						Если НоваяСтрока.ВысотаЯщика < Число(МинВысота) Тогда
							Текст = "Изделие: " + Элемент.Изделие + ". Ящик номер: " + Строка.НомерСтроки + ". Высота ящика: " + НоваяСтрока.ВысотаЯщика + ". Минимальная высота ящика: " + Число(МинВысота);
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
						КонецЕсли;
						
						Если НоваяСтрока.ПроемЯщика < Число(МинПроем) Тогда
							Текст = "Изделие: " + Элемент.Изделие + ". Ящик номер: " + Строка.НомерСтроки + ". Проем ящика: " + НоваяСтрока.ПроемЯщика + ". Минимальный проем ящика: " + Число(МинПроем);
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
						КонецЕсли;
						
					Исключение
						Текст = "Ошибка при формировании формул для ящиков каталога изделий: ГлубинаЯщика, ПроемЯщика, ВысотаЯщика" + Элемент.Изделие;
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
					КонецПопытки;
					
					НоваяСтрока.НаправляющиеНоменклатура = НайтиНаправляющиеНоменклатура(СтрокаПоиска.МеханизмЭлемента, НоваяСтрока.ГлубинаЯщика);
					
					Если НЕ ЗначениеЗаполнено(НоваяСтрока.НаправляющиеНоменклатура) Тогда
						Текст = "Внимание! Направляющая не найдена у " + НашеИзделие;
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
					КонецЕсли;
					
					НоваяСтрока.ГлубинаЯщика = НоваяСтрока.НаправляющиеНоменклатура.ДлинаДетали;
					
					Если ЗначениеЗаполнено(СтрокаПоиска.ДопЭлемент) Тогда
						
						Если Элемент.Сборка Тогда
							ПоКаталогуМестоОбработки = "Цех";
						Иначе
							ПоКаталогуМестоОбработки = "Склад";
						КонецЕсли;
						
						ДобавитьКомплектацию(СтрокаПоиска.ДопЭлемент, 1, Элемент.НомерСтроки, ПоКаталогуМестоОбработки);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			НоваяСтрока.ВидФасада = Строка.ВидФасада;
			
			Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
				Если СтрокаПоиска.БезФасада Тогда
					НоваяСтрока.ВидФасада = "Нет";
				КонецЕсли;
			КонецЕсли;
			
			Если НоваяСтрока.ВидФасада <> "Нет" Тогда
				
				Попытка
					
					ШиринаФасад = 0;
					ВысотаФасад = 0;
					
					Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
						НоменклатураМатериала = СтрокаПоиска.НоменклатураФасада;
					Иначе
						НоменклатураМатериала = НоваяСтрока.Номенклатура;
					КонецЕсли;
					
					Выполнить("ШиринаФасад = " + Строка.ШиринаФасада);
					Выполнить("ВысотаФасад = " + Строка.ВысотаФасада);
					
					НоваяСтрока.ШиринаФасад = Окр(ШиринаФасад, 0, РежимОкругления.Окр15как10);
					НоваяСтрока.ВысотаФасад = Окр(ВысотаФасад, 0, РежимОкругления.Окр15как10);
					
				Исключение
					Текст = "Ошибка при формировании формул для фасадов ящика каталога изделий " + Элемент.Изделие;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
				КонецПопытки;
				
				Если ИзделиеШкафКупе Тогда
					
					НоваяСтрока.ФасадНоменклатура = Элемент.НоменклатураЛДСП;
					НоваяСтрока.РучкаНоменклатура = Элемент.Ручка;
					НоваяСтрока.КоличествоРучек = 1;
					НоваяСтрока.КромкаФасадНоменклатура = Элемент.КромкаЛДСП;
					
				Иначе
					
					НоваяСтрока.ФасадНоменклатура = СтрокаПоиска.НоменклатураФасада;
					НоваяСтрока.РучкаНоменклатура = СтрокаПоиска.НоменклатураРучки;
					НоваяСтрока.КромкаФасадНоменклатура = СтрокаПоиска.ОбрамлениеФасада;
					
					Если СтрокаПоиска.ВидДеталиФасад.Пластик И ЗначениеЗаполнено(СтрокаПоиска.ДопНоменклатураФасада) Тогда
						НоваяСтрока.ФасадНоменклатура = СтрокаПоиска.ДопНоменклатураФасада;
					КонецЕсли;
					
					БезРучки = Ложь;
					
					Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
						БезРучки = СтрокаПоиска.БезРучки;
					КонецЕсли;
					
					Если БезРучки Тогда
						НоваяСтрока.КоличествоРучек = 0;
					Иначе
						
						КоличествоРучек = 0;
						Выполнить("КоличествоРучек = " + ?(ЗначениеЗаполнено(Строка.КоличествоРучек), Строка.КоличествоРучек, 0));
						НоваяСтрока.КоличествоРучек = Мин(Макс(КоличествоРучек, 1), 2);
						
					КонецЕсли;
					
					Если НоваяСтрока.КриволинейныйВыпилПодРучку Тогда
						НоваяСтрока.КоличествоРучек = 0;
					КонецЕсли;
					
					Если СтрокаПоиска.ПовернутьФасад Тогда
						ВременноеЗначение = НоваяСтрока.ШиринаФасад;
						НоваяСтрока.ШиринаФасад = НоваяСтрока.ВысотаФасад;
						НоваяСтрока.ВысотаФасад = ВременноеЗначение;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Выполнить("НоваяСтрока.ГлубинаЯщика = " + ЛексКлиентСервер.ПодставитьОбъектВФормулуЯщика("НоваяСтрока", НоваяСтрока.СхемаЯщика.ГлубинаЯщика));
			Выполнить("НоваяСтрока.ШиринаЯщика = " + ЛексКлиентСервер.ПодставитьОбъектВФормулуЯщика("НоваяСтрока", НоваяСтрока.СхемаЯщика.ШиринаЯщика));
			
			НоваяСтрока.НомерИзделия = Элемент.НомерСтроки;
			НоваяСтрока.КоличествоЯщиков = Строка.КоличествоЯщиков;
			НоваяСтрока.НомерЯщикаИзделия = Строка.НомерСтроки;
			
		КонецЦикла;
		
		#КонецОбласти
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.КухоннаяКоллекция) Тогда
		
		Коллекция = Объект.КухоннаяКоллекция;
		Настройки = Объект.НастройкиКоллекции[0];
		
		КоробВерхний = Справочники.ВидыИзделийПоКаталогу.КухняВерхний;
		КоробНижний = Справочники.ВидыИзделийПоКаталогу.КухняНижний;
				
		КоробаНизЛево = Новый Массив();
		КоробаНизЦентр = Новый Массив();
		КоробаНизПраво = Новый Массив();
		
		КоличествоСторон = Настройки.КоличествоСторон;
		ТекущаяСторона = 0;

		Для Каждого Стр ИЗ Объект.СписокИзделийПоКаталогу Цикл
			
			Если Стр.Изделие.ВидИзделияПоКаталогу = КоробНижний Тогда
				
				Если КоличествоСторон = 1 Тогда
					
					КоробаНизЦентр.Добавить(Стр);
					 
				ИначеЕсли КоличествоСторон = 2 Тогда
					
					Если ТекущаяСторона = 0 Тогда
						 КоробаНизЛево.Добавить(Стр);
					КонецЕсли;
					
					Если ТекущаяСторона = 1 Тогда
						 КоробаНизЦентр.Добавить(Стр);
					КонецЕсли;
					
					Если Стр.Изделие.Угловой Тогда
						ТекущаяСторона = ТекущаяСторона + 1;
						КоробаНизЦентр.Добавить(Стр);
					КонецЕсли;

				ИначеЕсли КоличествоСторон = 3 Тогда	 
					
					Если ТекущаяСторона = 0 Тогда
						 КоробаНизЛево.Добавить(Стр);
					КонецЕсли;
					
					Если ТекущаяСторона = 1 Тогда
						 КоробаНизЦентр.Добавить(Стр);
					КонецЕсли;
					 
					Если ТекущаяСторона = 2 Тогда
						 КоробаНизПраво.Добавить(Стр);
					КонецЕсли;
					
					Если Стр.Изделие.Угловой Тогда
						
						ТекущаяСторона = ТекущаяСторона + 1;
						
						Если ТекущаяСторона = 1 Тогда
							КоробаНизЦентр.Добавить(Стр);
						Иначе
							КоробаНизПраво.Добавить(Стр);
						КонецЕсли;
							
					КонецЕсли;
					
				КонецЕсли;
					 
			КонецЕсли;

		КонецЦикла;
		
		Левый = Перечисления.ВидыПрисоединенныхФайлов.КартинкаЛевая;
		Правый = Перечисления.ВидыПрисоединенныхФайлов.КартинкаПравая;
		
		Столешница = Настройки.Столешница;
		Пристенок = Настройки.Пристенок;
		КромкаСтолешница = Настройки.КромкаСтолешница;
		КромкаПристенок = Настройки.КромкаПристенок;
		
		КоличествоНизЛево = КоробаНизЛево.Количество();
		КоличествоНизЦентр = КоробаНизЦентр.Количество();
		КоличествоНизПраво = КоробаНизПраво.Количество();
		
		ПустаяСтрока = Объект.СписокИзделийПоКаталогу.Добавить();
		
		Для Сч = 1 По 20 Цикл
			КоробаНизЛево.Добавить(ПустаяСтрока);
			КоробаНизЦентр.Добавить(ПустаяСтрока);
			КоробаНизПраво.Добавить(ПустаяСтрока);
		КонецЦикла;
		
		ШиринаКухниЛево = Настройки.ШиринаКухниЛево;
		ШиринаКухниПраво = Настройки.ШиринаКухниПраво;
		ШиринаКухниЦентр = Настройки.ШиринаКухниЦентр;
		
		ГлубинаКухниЛево = Настройки.ГлубинаКухниЛево;
		ГлубинаКухниПраво = Настройки.ГлубинаКухниПраво;
		ГлубинаКухниЦентр = Настройки.ГлубинаКухниЦентр;

		Для Каждого Стр ИЗ Коллекция.СписокДетали Цикл
			
			Если Стр.Форма = Настройки.Форма Тогда
				
				ДКоличество = 0;
				ДВысота = 0;
				ДШирина = 0;
				
				Попытка
					Выполнить("ДКоличество = " + Стр.Количество);
				Исключение
					Сообщить("Ошибка при формировании формулы: Кухонные коллекции - Количество " + Стр.НомерСтроки);
				КонецПопытки;
				
				Попытка
					Выполнить("ДВысота = " + Стр.Ширина);
				Исключение
					Сообщить("Ошибка при формировании формулы: Кухонные коллекции - Ширина " + Стр.НомерСтроки);
				КонецПопытки;
				
				Попытка
					Выполнить("ДШирина = " + Стр.Глубина);
				Исключение
					Сообщить("Ошибка при формировании формулы: Кухонные коллекции - Глубина " + Стр.НомерСтроки);
				КонецПопытки;
				
				Если ДКоличество = 0 ИЛИ ДВысота = 0 ИЛИ ДШирина = 0 Тогда 
					Продолжить; 
				КонецЕсли; 
				
				Если Стр.ВидДетали.ЭтоСтолешница И (НЕ ЗначениеЗаполнено(Столешница) ИЛИ НЕ ЗначениеЗаполнено(КромкаСтолешница))Тогда
					Сообщить("Заполните номенклатуру и кромку для столешницы в настройках кухонной коллекции");
					Продолжить;	
				КонецЕсли;
					
				НСтр = Объект.СписокДеталей.Добавить();
				НСтр.ВидДетали = Стр.ВидДетали;
				НСтр.Количество = ДКоличество;
				НСтр.ВысотаДетали = ДВысота;
				НСтр.ШиринаДетали = ДШирина;  
				НСтр.ДлинаКривогоПила = "0";
				НСтр.Идентификатор = НСтр.ПолучитьИдентификатор();
				НСтр.ДетальКоллекции = Истина;
				
				Если Стр.ВидДетали.ЭтоСтолешница Тогда
					
					НСтр.Периметр = 2 * (НСтр.ВысотаДетали + НСтр.ШиринаДетали);
					НСтр.Постформинг = Истина;
					НСтр.Номенклатура = Столешница;
					НСтр.УниверсальнаяКромка = КромкаСтолешница;
					
					НСтр.ВыборМебельнойКромкиСнизу = ?(Стр.КромкаЛево, КромкаСтолешница, Неопределено);
					НСтр.ВыборМебельнойКромкиСверху = ?(Стр.КромкаПраво, КромкаСтолешница, Неопределено);
					НСтр.ВыборМебельнойКромкиСлева = ?(Стр.КромкаВерх, КромкаСтолешница, Неопределено);
					НСтр.ВыборМебельнойКромкиСправа = ?(Стр.КромкаНиз, КромкаСтолешница, Неопределено);
					
					НСтр.ПереключательКромкаСнизу = ?(Стр.КромкаЛево, "УниверсальнаяКромка", "");
					НСтр.ПереключательКромкаСверху = ?(Стр.КромкаПраво, "УниверсальнаяКромка", "");
					НСтр.ПереключательКромкаСлева = ?(Стр.КромкаВерх, "УниверсальнаяКромка", "");
					НСтр.ПереключательКромкаСправа = ?(Стр.КромкаНиз, "УниверсальнаяКромка", "");
					
				ИначеЕсли Стр.ВидДетали.ЭтоПристенок Тогда
					
					НСтр.Периметр = 2 * (НСтр.ВысотаДетали + НСтр.ШиринаДетали);
					НСтр.Номенклатура = Пристенок;
					НСтр.Кромка045мм = КромкаПристенок;
					
					НСтр.ВыборМебельнойКромкиСнизу = ?(Стр.КромкаЛево, КромкаПристенок, Неопределено);
					НСтр.ВыборМебельнойКромкиСверху = ?(Стр.КромкаПраво, КромкаПристенок, Неопределено);
					НСтр.ВыборМебельнойКромкиСлева = ?(Стр.КромкаВерх, КромкаПристенок, Неопределено);
					НСтр.ВыборМебельнойКромкиСправа = ?(Стр.КромкаНиз, КромкаПристенок, Неопределено);
					
					НСтр.ПереключательКромкаСнизу = ?(Стр.КромкаЛево, "0.4", "");
					НСтр.ПереключательКромкаСверху = ?(Стр.КромкаПраво, "0.4", "");
					НСтр.ПереключательКромкаСлева = ?(Стр.КромкаВерх, "0.4", "");
					НСтр.ПереключательКромкаСправа = ?(Стр.КромкаНиз, "0.4", "");
					
				КонецЕсли;
				
			КонецЕсли;
	
		КонецЦикла;
		
		Для Каждого Стр ИЗ Коллекция.СписокКомплектация Цикл
			
			Если Стр.Форма = Настройки.Форма Тогда
				
				ДКоличество = 0;
				
				Попытка
					Выполнить("ДКоличество = " + Стр.Количество);
				Исключение
					Сообщить("Ошибка при формировании формулы: Кухонные коллекции - Количество комплектации" + Стр.НомерСтроки);
				КонецПопытки;

				Если ДКоличество = 0 ИЛИ НЕ ЗначениеЗаполнено(Стр.Номенклатура) Тогда 
					Продолжить; 
				КонецЕсли; 
				
				Номенклатура = ЛексСервер.ПолучитьНоменклатуру(ОбщаяНоменклатура, Стр.Номенклатура);
				
				ДобавитьКомплектацию(Номенклатура, ДКоличество, 0, "Цех", Истина);
				
			КонецЕсли;
	
		КонецЦикла;
		
		Объект.СписокИзделийПоКаталогу.Удалить(ПустаяСтрока);

	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиРасположениеБезРучки(Положение)
	
	НовоеПоложение = Неопределено;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ПоложениеПазов", Положение.ПоложениеПазов);
	Запрос.УстановитьПараметр("ПоложениеРучки", "Отсутствует");
	
	Запрос.Текст=
	"ВЫБРАТЬ
	|	РасположениеПазовИРучкиНаФасадах.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РасположениеПазовИРучкиНаФасадах КАК РасположениеПазовИРучкиНаФасадах
	|ГДЕ
	|	РасположениеПазовИРучкиНаФасадах.ПоложениеПазов = &ПоложениеПазов
	|	И РасположениеПазовИРучкиНаФасадах.ПоложениеРучки = &ПоложениеРучки";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		НовоеПоложение = Выборка.Ссылка;
		
	Иначе
		
		Сообщить("Расположение ручки и петель не найдено");
		
	КонецЕсли;
	
	Возврат НовоеПоложение;
	
КонецФункции

&НаСервере
Процедура ДобавитьКомплектацию(Номенклатура, Количество, НомерИзделия, ПоКаталогуМестоОбработки = Неопределено, ДетальКоллекции = Ложь)
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		НоваяСтрока = Объект.Комплектация.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.Количество = Количество;
		НоваяСтрока.ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерения;
		НоваяСтрока.НомерИзделия = НомерИзделия;
		НоваяСтрока.ПоКаталогуМестоОбработки = ПоКаталогуМестоОбработки;
		НоваяСтрока.ДетальКоллекции = ДетальКоллекции;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиНаправляющиеНоменклатура(НоменклатурнаяГруппа, ГлубинаЯщика)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа", НоменклатурнаяГруппа);
	Запрос.УстановитьПараметр("ДлинаДетали", ГлубинаЯщика);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	спрНоменклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК спрНоменклатура
	|ГДЕ
	|	спрНоменклатура.НоменклатурнаяГруппа = &НоменклатурнаяГруппа
	|	И спрНоменклатура.ДлинаДетали <= &ДлинаДетали
	|	И спрНоменклатура.Подразделение = &Подразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	спрНоменклатура.ДлинаДетали УБЫВ";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() > 0 Тогда
		Возврат Выборка[0].Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НайтиВсеФормулы()
	
	ВсеФормулы = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФормулыКаталога.Наименование,
	|	ФормулыКаталога.РазвернутаяФормула
	|ИЗ
	|	Справочник.ФормулыКаталога КАК ФормулыКаталога
	|ГДЕ
	|	НЕ ФормулыКаталога.ПометкаУдаления
	|	И ФормулыКаталога.Активность";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ВсеФормулы.Вставить(Выборка.Наименование, Выборка.РазвернутаяФормула);
		
	КонецЦикла;
	
	Возврат ВсеФормулы;
	
КонецФункции

&НаСервере
Функция ОпределитьКромку(ВидКромкиПоУмолчанию, Кромка)
	
	ВидКромки = ВидКромкиПоУмолчанию;
	Структура = Новый Структура;
	Структура.Вставить("ПереключательКромка", "Нет");
	Структура.Вставить("Кромка", Кромка);
	
	Структура.Вставить("ЭтоКант", Ложь);
	Структура.Вставить("ЭтоКромка045", Ложь);
	Структура.Вставить("ЭтоКромка2", Ложь);
	Структура.Вставить("ЭтоУниверсальнаяКромка", Ложь);
	
	НоменклатурнаяГруппаКромки = Кромка.НоменклатурнаяГруппа;
	
	Если НЕ ЗначениеЗаполнено(ВидКромки) Тогда
		ВидКромки = НоменклатурнаяГруппаКромки;
	КонецЕсли;
	
	ЭтоКантП = ВидКромки = Справочники.НоменклатурныеГруппы.КантП;
	ЭтоКантТ = ВидКромки = Справочники.НоменклатурныеГруппы.КантТ;
	ЭтоКромка2_19 = ВидКромки = Справочники.НоменклатурныеГруппы.Кромка2_19;
	ЭтоКромка2_35 = ВидКромки = Справочники.НоменклатурныеГруппы.Кромка2_35;
	ЭтоКромка045_19 = ВидКромки = Справочники.НоменклатурныеГруппы.Кромка045_19;
	
	ЭтоУниверсальнаяКромка = ВидКромки = Справочники.НоменклатурныеГруппы.АГТПрофиль
	ИЛИ ВидКромки = Справочники.НоменклатурныеГруппы.КромкаМДФ
	ИЛИ ВидКромки = Справочники.НоменклатурныеГруппы.РамочныйАлюминий;
	
	Если ВидКромки <> НоменклатурнаяГруппаКромки Тогда
		
		Если ЭтоКантТ Тогда
			Структура.Вставить("Кромка", СтруктураПодбираемойПоЦветуКромки.КантТ);
			Структура.Вставить("ПереключательКромка", "Кант");
			Структура.Вставить("ЭтоКант", Истина);
		ИначеЕсли ЭтоКромка2_19 Тогда
			Структура.Вставить("Кромка", СтруктураПодбираемойПоЦветуКромки.Кромка2_19);
			Структура.Вставить("ПереключательКромка", "2");
			Структура.Вставить("ЭтоКромка2", Истина);
		ИначеЕсли ЭтоКромка2_35 Тогда
			Структура.Вставить("Кромка", СтруктураПодбираемойПоЦветуКромки.Кромка2_35);
			Структура.Вставить("ПереключательКромка", "2");
			Структура.Вставить("ЭтоКромка2", Истина);
		ИначеЕсли ЭтоКромка045_19 Тогда
			Структура.Вставить("Кромка", СтруктураПодбираемойПоЦветуКромки.Кромка045_19);
			Структура.Вставить("ПереключательКромка", "0.45");
			Структура.Вставить("ЭтоКромка045", Истина);
		КонецЕсли;
		
	Иначе
		
		Если ЭтоКантП ИЛИ ЭтоКантТ Тогда
			Структура.Вставить("ПереключательКромка", "Кант");
			Структура.Вставить("ЭтоКант", Истина);
		ИначеЕсли ЭтоКромка2_19 ИЛИ ЭтоКромка2_35 Тогда
			Структура.Вставить("ПереключательКромка", "2");
			Структура.Вставить("ЭтоКромка2", Истина);
		ИначеЕсли ЭтоКромка045_19 Тогда
			Структура.Вставить("ПереключательКромка", "0.45");
			Структура.Вставить("ЭтоКромка045", Истина);
		ИначеЕсли ЭтоУниверсальнаяКромка Тогда
			Структура.Вставить("ПереключательКромка", "УниверсальнаяКромка");
			Структура.Вставить("ЭтоУниверсальнаяКромка", Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКромки(НоваяСтрока, СтруктураКромки)
	
	Если СтруктураКромки.ЭтоКант И НЕ ЗначениеЗаполнено(НоваяСтрока.Кант) Тогда
		
		НоваяСтрока.Кант = СтруктураКромки.Кромка;
		
	КонецЕсли;
	
	Если СтруктураКромки.ЭтоКромка045 И НЕ ЗначениеЗаполнено(НоваяСтрока.Кромка045мм) Тогда
		
		НоваяСтрока.Кромка045мм = СтруктураКромки.Кромка;
		
	КонецЕсли;
	
	Если СтруктураКромки.ЭтоКромка2 И НЕ ЗначениеЗаполнено(НоваяСтрока.Кромка2мм) Тогда
		
		НоваяСтрока.Кромка2мм = СтруктураКромки.Кромка;
		
	КонецЕсли;
	
	Если СтруктураКромки.ЭтоУниверсальнаяКромка И НЕ ЗначениеЗаполнено(НоваяСтрока.УниверсальнаяКромка) Тогда
		
		НоваяСтрока.УниверсальнаяКромка = СтруктураКромки.Кромка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьТаблицу(Таблица)
	
	Количество = Таблица.Количество();
	Если Количество > 0 Тогда
		Для Индекс = 1 По Количество Цикл
			
			Элемент = Таблица[Количество - Индекс];
			
			Если Элемент.НомерИзделия > 0 ИЛИ (Элемент.Свойство("ДетальКоллекции") И Элемент.ДетальКоллекции) Тогда
				
				Таблица.Удалить(Элемент);
				
				Если Таблица = Объект["СписокДеталей"] Тогда
					 УдалитьПетлиДетали(Элемент.ИдентификаторПетли);	
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСвойстваИзделия(фнИзделие, фнКонтрагент)
	
	Структура = Новый Структура;
	Структура.Вставить("ЗапретРедактирования", фнИзделие.ЗапретРедактирования);
	Структура.Вставить("СерийноеИзделие", фнИзделие.Серийное);
	Структура.Вставить("Переделка", фнИзделие.ЭтоПеределка);
	
	Возврат Структура;
	
КонецФункции

#КонецОбласти

#Область Управление_внешним_видом

// Возвращает Строку для УведомлениеМатериалПодЗаказ
// в которой есть телефон ответственного из указанного подразделения.
//
// Параметры:
// Подразделение - СправочникСсылка.Подразделение, подразделение, в котором ищем ЗаведующегоСкладамиМатериалов
//
// Возвращаемое значение:
// ТекстУведомления - Строка
&НаСервереБезКонтекста
Функция ПолучитьУведомлениеМатериалПодЗаказ(Подразделение)
	
	ФизЛицо = ЛексСервер.ПолучитьНастройкуПодразделения(Подразделение, Перечисления.ВидыНастроекПодразделений.ФизЛицоДляСогласованияМатериала);
	
	Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
		
		Телефон = "8-962-285-73-98"; // телефон Гарбузова
		
	Иначе
		
		СвойстваФизлица = ЛексСервер.ЗначенияРеквизитовОбъекта(Физлицо, "ТелефонРабочий, Телефон");
		
		Если ЗначениеЗаполнено(СвойстваФизлица.ТелефонРабочий) Тогда
			Телефон = СвойстваФизлица.ТелефонРабочий;
		ИначеЕсли ЗначениеЗаполнено(СвойстваФизлица.Телефон) Тогда
			Телефон = СвойстваФизлица.Телефон;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстУведомления = "Заполните вкладку ""Под заказ"". Согласуйте по тел: " + Телефон;
	
	Возврат ТекстУведомления;
	
КонецФункции // ПолучитьУведомлениеМатериалПодЗаказ()

&НаКлиентеНаСервереБезКонтекста
Функция ОбновитьЭлементыФормы(фнФорма, лПараметры)
	
	Если ТипЗнч(лПараметры) <> Тип("Структура") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Элементы = фнФорма.Элементы;
	
	Элементы.Офис.Доступность = Истина;
	
	Если лПараметры.Свойство("ВидИзделияКухня") Тогда
		Элементы.ГруппаКухонныеКоллекции.Видимость = лПараметры.ВидИзделияКухня;
	КонецЕсли;
	
	Если лПараметры.Свойство("ЕстьМатериалПодЗаказ") Тогда
		Элементы.УведомлениеМатериалПодЗаказ.Видимость = лПараметры.ЕстьМатериалПодЗаказ;
	КонецЕсли;
	
	Если лПараметры.Свойство("ТолькоПросмотр") Тогда
		фнФорма.ТолькоПросмотр = лПараметры.ТолькоПросмотр;
	КонецЕсли;
	
	Если лПараметры.Свойство("ЕстьМонтаж") Тогда
		
		Элементы.Монтажник.Доступность = лПараметры.ЕстьМонтаж;
		Доступность = лПараметры.ЕстьМонтаж;
		Элементы.ДатаОтгрузки.Доступность = НЕ лПараметры.ЕстьМонтаж;
		Элементы.УстановитьБлижайшуюДату.Доступность = НЕ лПараметры.ЕстьМонтаж;
		
	КонецЕсли;
	
	Если лПараметры.Свойство("Переделка") Тогда
		
		Элементы.СтраницаВиновные.Доступность = лПараметры.Переделка;
		Элементы.СтраницаВиновные.Видимость = лПараметры.Переделка;
		Элементы.ДовозОсуществил.Видимость = Ложь;
		Элементы.Офис.Доступность = НЕ лПараметры.Переделка;
		
	КонецЕсли;
	
	Если лПараметры.Свойство("ПользовательАдминистратор") Тогда
		
		МассивЭлементовАдминистратора = Новый Массив;
		МассивЭлементовАдминистратора.Добавить(Элементы.СтраницаСписокНоменклатуры);
		МассивЭлементовАдминистратора.Добавить(Элементы.СтраницаСкладГотовойПродукции);
		МассивЭлементовАдминистратора.Добавить(Элементы.СтраницаСписокЛистовНоменклатуры);
		
		Если лПараметры.ПользовательАдминистратор Тогда
			Для каждого ЭлементовАдминистратора Из МассивЭлементовАдминистратора Цикл
				ЭлементовАдминистратора.Видимость = Истина;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если лПараметры.Свойство("Дилерский") Тогда
		
		НовыйМассив = Новый Массив;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Активность", Истина);
		НовыйМассив.Добавить(НовыйПараметр);
		
		Если лПараметры.Дилерский Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.ЗапрещеноДляДилеров", Ложь);
			НовыйМассив.Добавить(НовыйПараметр);
		КонецЕсли;
		
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		фнФорма.Элементы.Изделие.ПараметрыВыбора = НовыеПараметры;
				
		Если лПараметры.Дилерский Тогда
			
			Элементы.Контрагент.Доступность = Ложь;
			Элементы.Подразделение.Доступность = Ложь;
			
			МассивДилерскихЭлементов = Новый Массив;
			МассивДилерскихЭлементов.Добавить(Элементы.Офис);
			МассивДилерскихЭлементов.Добавить(Элементы.Договор);
			МассивДилерскихЭлементов.Добавить(Элементы.Технолог);
			МассивДилерскихЭлементов.Добавить(Элементы.ГруппаСкидкаДоговора);
			МассивДилерскихЭлементов.Добавить(Элементы.СтраницаЗамечанияИнженера);
			
			Для каждого ДилерскийЭлемент Из МассивДилерскихЭлементов Цикл
				ДилерскийЭлемент.Видимость = Ложь;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если лПараметры.Свойство("ЗапретРедактирования") Тогда
		
		Элементы.СтраницаВиновные.ТолькоПросмотр = лПараметры.ЗапретРедактирования;
		Элементы.СтраницаМатериалы.ТолькоПросмотр = лПараметры.ЗапретРедактирования;
		Элементы.СтраницаЯщики.ТолькоПросмотр = лПараметры.ЗапретРедактирования;
		Элементы.СтраницаДвери.ТолькоПросмотр = лПараметры.ЗапретРедактирования;
		Элементы.СтраницаКомплектация.ТолькоПросмотр = лПараметры.ЗапретРедактирования;
		Элементы.КомплектацияФурнитура.Доступность = НЕ лПараметры.ЗапретРедактирования;
		Элементы.КомплектацияСотовыеЭлементы.Доступность = НЕ лПараметры.ЗапретРедактирования;
		Элементы.СписокДверейДобавитьДвери.Доступность = НЕ лПараметры.ЗапретРедактирования;
		Элементы.Двери.Доступность = НЕ лПараметры.ЗапретРедактирования;
		Элементы.Технолог.Видимость = НЕ лПараметры.ЗапретРедактирования;
		
	КонецЕсли;
	
	Если лПараметры.Свойство("СерийноеИзделие") Тогда
		
		Элементы.СтраницаСерийноеИзделие.Видимость = лПараметры.СерийноеИзделие;
		
	КонецЕсли;
	
	Если лПараметры.Свойство("Заблокировать") Тогда
		
		Элементы.КолонкаПроизводство.Доступность = НЕ лПараметры.Заблокировать;
		Элементы.КолонкаДаты.Доступность = НЕ лПараметры.Заблокировать;
		Элементы.ГруппаСтраницы.Доступность = НЕ лПараметры.Заблокировать;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОбщаяНоменклатура = ПолучитьОбщуюНоменклатуру(Объект.Подразделение, Объект.КухоннаяКоллекция);
	
	//Договор
	Договор = Документы.Спецификация.ПолучитьДоговор(Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Договор = "Введите договор";
	КонецЕсли;
	
	ПересчитатьНоменклатуру = Ложь;
	
	Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	ПользовательАдминистратор = ЛексСервер.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Администратор);
	СтруктураИзделия = ПолучитьСвойстваИзделия(Объект.Изделие, Объект.Контрагент);
	
	ВидИзделияКухня = ПроверитьВидИзделияКухня(Объект.Изделие);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дилерский", Объект.Дилерский);
	СтруктураПараметров.Вставить("ЕстьМонтаж", Объект.ПакетУслуг = Перечисления.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж);
	СтруктураПараметров.Вставить("Переделка", Объект.Изделие.ЭтоПеределка);
	СтруктураПараметров.Вставить("ПользовательАдминистратор", ПользовательАдминистратор);
	СтруктураПараметров.Вставить("ЕстьМатериалПодЗаказ", Объект.ЕстьМатериалПодЗаказ);
	СтруктураПараметров.Вставить("ЗапретРедактирования", СтруктураИзделия.ЗапретРедактирования);
	СтруктураПараметров.Вставить("СерийноеИзделие", СтруктураИзделия.СерийноеИзделие);
	СтруктураПараметров.Вставить("ТолькоПросмотр", ТолькоПросмотр ИЛИ НЕ ЛексСервер.ДоступностьСпецификации(Объект.Ссылка));
	СтруктураПараметров.Вставить("Заблокировать", НЕ ЗначениеЗаполнено(Объект.Изделие) ИЛИ НЕ ЗначениеЗаполнено(Объект.ПакетУслугИзделия));
	СтруктураПараметров.Вставить("ВидИзделияКухня", ВидИзделияКухня);
	
	ЗапретРедактирования = СтруктураИзделия.ЗапретРедактирования;
	
	ОбновитьЭлементыФормы(ЭтаФорма, СтруктураПараметров);
	
	УведомлениеМатериалПодЗаказ = ПолучитьУведомлениеМатериалПодЗаказ(Объект.Подразделение);
	
	ОбновитьСписокНоменклатурыЗаказчика(Объект);
	
	Если Объект.БезОкругленияДоЛистов Тогда
		УведомлениеОкруглениеДоЛистов = "Материал не округляется до листов!";
	Иначе
		УведомлениеОкруглениеДоЛистов = "";
	КонецЕсли;
	
	// Проверка на устаревшую спецификацию
	
	Копирование = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатурныеГруппы.Ссылка КАК Группа
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ
	|	НоменклатурныеГруппы.ВидМатериала <> ЗНАЧЕНИЕ(Перечисление.ВидыМатериалов.Листовой)";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Массив = ТЗ.ВыгрузитьКолонку("Группа");
	СписокНоменклатурныхГрупп = Новый Структура;
	СписокНоменклатурныхГрупп.Вставить("Массив", Массив);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ДатаОтгрузки = ТекущаяДата();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Изделие) Тогда
		ЗаполнитьПакетУслуг(Объект.Изделие);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Изделие) Тогда
		ЗаполнитьДоступныеПакетыУслуг();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеПакетыУслуг()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ЭтоДетали", Объект.Изделие.ЭтоДетали);
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ПакетыУслугИзделий.Ссылка
	|ИЗ
	|	Справочник.ПакетыУслугИзделий КАК ПакетыУслугИзделий
	|ГДЕ
	|	ПакетыУслугИзделий.Активность
	|	И ВЫБОР
	|			КОГДА &ЭтоДетали
	|				ТОГДА ПакетыУслугИзделий.ДоступноДляИзделияДетали
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Элементы.ПакетУслугИзделия.СписокВыбора.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПакетУслуг(ВидИзделия)
	
	СписокВыбора = Элементы.ПакетУслуг.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.ЗагрузитьЗначения(ВидИзделия.ДоступныеПакетыУслуг.ВыгрузитьКолонку("ПакетУслуг"));		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	СтатусСпецификации = ПолучитьСтатусСпецификации(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПересчитатьСуммы();
	УстановитьГород();
	ОбновитьВидимостьНастройкиКоллекции();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Объект.Ссылка = Параметр Тогда
		
		Если ИмяСобытия = "ИзмененСтатусСпецификации" Тогда
			ТолькоПросмотр = НЕ ЛексСервер.ДоступностьСпецификации(Объект.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПакетУслугИзделия) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите пакет услуг изделия",, "ПакетУслугИзделия", "Объект", Отказ);
	
	ИначеЕсли НЕ Объект.Дилерский И НЕ ЗначениеЗаполнено(Объект.Офис) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите офис",, "Офис", "Объект", Отказ);
		
	Иначе
		
		Состояние("Сохранение спецификации и формирование раскроя");
		ОчиститьСообщения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьНоменклатуруИзКомплектации(фнОбъект)
	
	Для каждого Строка Из фнОбъект.Комплектация Цикл
		
		Если фнОбъект.Изделие.Серийное
			И Строка.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		НоменклатурнаяГруппа = Строка.Номенклатура.НоменклатурнаяГруппа;
		Если НоменклатурнаяГруппа.ВидМатериала <> Перечисления.ВидыМатериалов.Хлыстовой
			И Строка.Номенклатура.Кратность> 0 Тогда
			
			ОстатокОтКратности = Строка.Количество % Строка.Номенклатура.Кратность;
			Если ОстатокОтКратности > 0 Тогда
				Строка.Количество = Строка.Количество + (Строка.Номенклатура.Кратность - ОстатокОтКратности);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.ПоКаталогуМестоОбработки) Тогда
			
			Место = Строка.ПоКаталогуМестоОбработки;
			
		Иначе
			
			Если Строка.Номенклатура.МестоОбработки = Перечисления.МестоОбработки.Цех Тогда
				Место = "Цех";
			КонецЕсли;
			
			Если Строка.Номенклатура.МестоОбработки = Перечисления.МестоОбработки.Отгрузка 
				ИЛИ Строка.Номенклатура.МестоОбработки = Перечисления.МестоОбработки.ПоКаталогуВЦех Тогда
				Место = "Склад";
			КонецЕсли;
			
		КонецЕсли;
		
		Если Строка.НомерИзделия = 0 Тогда
			Место = "Склад";
		КонецЕсли;
		
		ДобавитьСтроку(фнОбъект,
		Строка.Номенклатура,
		Строка.Количество,
		Строка.НомерИзделия,
		,
		"строки комплектации № " + Строка.НомерСтроки,
		"Комплектация",
		Строка.НомерСтроки,
		Ложь,
		Ложь,
		-1,
		Место);
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ОбновитьТЧОбрезки(ТЧ, МассивНомеровСтрок)
	
	ОставшиесяСтроки = ТЧ.СкопироватьКолонки();
	
	Для каждого СтрокаТЧ Из ТЧ Цикл
		Если МассивНомеровСтрок.Найти(СтрокаТЧ.НомерСтроки) <> Неопределено Тогда
			НоваяСтрока = ОставшиесяСтроки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОставшиесяСтроки;
	
КонецФункции

&НаСервере
Процедура ПроверитьПетлиИПазы(ТекущийОбъект)
	
	Для Каждого Деталь ИЗ ТекущийОбъект.СписокДеталей Цикл
		
		Если Деталь.КоличествоПетель > 0 Тогда
			
			Если Деталь.РасположениеПазовИРучкиНаФасадах.ПоложениеПазов = Перечисления.Стороны.Отсутствует Тогда
				
				Деталь.Петли = Неопределено;
				Деталь.КоличествоПетель = 0;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Перем Ошибки;
	
	Если НЕ ТекущийОбъект.Проведен Тогда
		ТекущийОбъект.Дата = ТекущаяДата();
	КонецЕсли;
	
	ПроставитьФлагЭтоКухня(ТекущийОбъект);
	ПроверитьПетлиИПазы(ТекущийОбъект);
	
	//RonEXI: Пока оставлю, может позже придумаю как сделать чтобы не формировать список номенклатуры каждый раз.	
	//Если НЕ ПересчитатьНоменклатуру Тогда
	//	 Возврат;
	//КонецЕсли;
	
	ТаблицаДеталиЯщиков = Документы.Спецификация.РазложитьЯщикиНаДетали(ТекущийОбъект);
	
	СтруктураРаскроя = РегистрыСведений.РаскройДеталей.СформироватьРаскрой(ТекущийОбъект);
	
	ТекущийОбъект.КоличествоДеталей = СтруктураРаскроя.КоличествоДеталей;
	
	ПродаваемоеКоличествоМатериала = Неопределено;
	
	Если ТипЗнч(СтруктураРаскроя) = Тип("Структура") Тогда
		
		ТекущийОбъект.СписокЛистовНоменклатуры.Загрузить(СтруктураРаскроя.ТаблицаЛистовНоменклатуры);
		ПродаваемоеКоличествоМатериала = СтруктураРаскроя.ПродаваемоеКоличествоМатериала;
		Для каждого Строка Из ТекущийОбъект.СписокЛистовНоменклатуры Цикл
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", Строка.Номенклатура);
			МассивСтрок = ТекущийОбъект.СписокМатериаловЗаказчика.НайтиСтроки(ПараметрыОтбора);
			Строка.ПредоставитЗаказчик = МассивСтрок.Количество() > 0;
			
		КонецЦикла;
		
	Иначе
		
		ТекстСообщения = Строка(ТекущийОбъект.Ссылка) + " ";
		
		Если ТипЗнч(СтруктураРаскроя) = Тип("Строка")
			И ЗначениеЗаполнено(СтруктураРаскроя) Тогда
			ТекстСообщения = ТекстСообщения + СтруктураРаскроя;
		Иначе
			ТекстСообщения = ТекстСообщения + "ошибка раскроя.";
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , ТекстСообщения);
		
	КонецЕсли;
	
	ТекущийОбъект.ОбрезкиЛистовогоМатериала.Загрузить(ОбновитьТЧОбрезки(ТекущийОбъект.ОбрезкиЛистовогоМатериала.Выгрузить(), СтруктураРаскроя.МассивНомеровИспользуемыхОстатков));
	
	/////////////////////////////////////////
	
	ЗаполнитьМатериалы(ТекущийОбъект, Ошибки, ПродаваемоеКоличествоМатериала);
	ЗаполнитьУслуги(ТекущийОбъект);
	ЗаполнитьОсобыеУслуги(ТекущийОбъект);
	ЗаполнитьОсновныеЦвета(ТекущийОбъект);
	ЗаполнитьКоличествоКоробов(ТекущийОбъект);
	
	ПроверитьРазмерыЯщиков(ТекущийОбъект, Ошибки);
	
	ЛексСервер.УстановитьДатуИзготовленияСпецификации(ТекущийОбъект);
	
	////////////////////////////////////////////////////////////////////
	// Граница проверок. После ОТКАЗ не трогать!!!
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
	Если НЕ Отказ Тогда
		
		Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
			СпецификацияСсылка = ТекущийОбъект.Ссылка;
		Иначе
			СпецификацияСсылка = Документы.Спецификация.ПолучитьСсылку(Новый УникальныйИдентификатор);
			ТекущийОбъект.УстановитьСсылкуНового(СпецификацияСсылка);
		КонецЕсли;
		
		ЗаписатьСтрокуРаскроя(СпецификацияСсылка, СтруктураРаскроя);
		
		Если ТекущийОбъект.БезОкругленияДоЛистов Тогда
			УведомлениеОкруглениеДоЛистов = "Материал не округляется до листов!";
		Иначе
			УведомлениеОкруглениеДоЛистов = "";
		КонецЕсли;
		
		ДобавитьНоменклатуруИзКомплектации(ТекущийОбъект);
		ЗаполнитьХлыстовойМатериал(ТекущийОбъект);
		
		ПроверитьМатериалЗаказчика(ТекущийОбъект);
		
		УвеличитьКоличествоМатериаловНаПроцентОтхода(ТекущийОбъект);
		ОкруглитьКоличествоМатериаловПоНомГруппе(ТекущийОбъект);
		
		ЗаполнитьМатериалПодЗаказ(ТекущийОбъект);
		ЗаполнитьЦеныМатериалПодЗаказ(ТекущийОбъект);
		
		// { Васильев Александр Леонидович [30.06.2015]
		// Исключение. Все остальные услуги добавляются в функции ЗаполнитьУслуги()
		// Если кто придумает клёвый способ перенести туда, сообщите, поставлю пива. :)
		Если НужнаДоставкаМатериала(ТекущийОбъект) Тогда
			ДобавитьСтроку(ТекущийОбъект, ОбщаяНоменклатура.ДоставкаМатериала, 1, 0);
		КонецЕсли;
		// } Васильев Александр Леонидович [30.06.2015]
		
		ЗаполнитьСтоимость(ТекущийОбъект);
		УвеличитьСтоимостьЗаПредоставленныйМатериал(ТекущийОбъект);
		ЗаменитьЦенуМатериалаПодЗаказ(ТекущийОбъект);
		ПрименитьНаценкиОфисаДилера(ТекущийОбъект);
		
		ЗаполнитьТаблицуСкладГотовойПродукции(ТекущийОбъект);
		
		ТекущийОбъект.ТребуетсяПриходМатериаловЗаказчика = ТекущийОбъект.СписокМатериаловЗаказчика.Количество() > 0;
		
		Стр = Документы.Спецификация.ПолучитьКоличествоДнейНаИзготовление(ТекущийОбъект);
		ТекущийОбъект.ДнейНаИзготовлениеПоНоменклатуре = Стр.ДнейНаИзготовление;
		
	КонецЕсли;
	
	ПересчитатьНоменклатуру = Ложь;
	
КонецПроцедуры

&НаСервере
Функция НужнаДоставкаМатериала(ТекущийОбъект)
	
	Доставка = Ложь;
	
	Если НЕ ТекущийОбъект.ЕстьМатериалПодЗаказ
		ИЛИ ТекущийОбъект.Изделие.Серийное Тогда
		
		Возврат Доставка;
		
	КонецЕсли;
	
	Для Каждого Стр ИЗ ТекущийОбъект.СписокМатериаловПодЗаказ Цикл
		
		Если Стр.Номенклатура.НоменклатурнаяГруппа.ВидМатериала <> Перечисления.ВидыМатериалов.Листовой Тогда
			Доставка = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ Доставка Тогда
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ТаблицаЛисты", ТекущийОбъект.СписокЛистовНоменклатуры.Выгрузить());
		Запрос.УстановитьПараметр("ТаблицаПодЗаказ", ТекущийОбъект.СписокМатериаловПодЗаказ.Выгрузить());
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Листы.Номенклатура,
		|	Листы.Количество
		|ПОМЕСТИТЬ втЛисты
		|ИЗ
		|	&ТаблицаЛисты КАК Листы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодЗаказ.Номенклатура
		|ПОМЕСТИТЬ втПодЗаказ
		|ИЗ
		|	&ТаблицаПодЗаказ КАК ПодЗаказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Листы.Номенклатура
		|ИЗ
		|	втЛисты КАК Листы
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПодЗаказ КАК ПодЗаказ
		|		ПО Листы.Номенклатура = ПодЗаказ.Номенклатура
		|ГДЕ
		|	НЕ ПодЗаказ.Номенклатура ЕСТЬ NULL";
		
		РезультатЗапроса = Запрос.Выполнить();
		Доставка = НЕ РезультатЗапроса.Пустой();
		
	КонецЕсли;
	
	Возврат Доставка;
	
КонецФункции

&НаСервере
Процедура ПроверитьРазмерыЯщиков(ТекущийОбъект,Ошибки)
	
	Для Каждого Ящик ИЗ ТекущийОбъект.СписокЯщики Цикл
		
		КриволинейныйВыпилПодРучку = Ящик.КриволинейныйВыпилПодРучку;
		
		МинВысота = 0;
		МинПроем = 0;
		
		Выполнить("МинВысота = " + Ящик.СхемаЯщика.МинимальнаяВысота);
		Выполнить("МинПроем = " + Ящик.СхемаЯщика.МинимальныйПроем);
		
		Если Ящик.ВысотаЯщика < Число(МинВысота) Тогда
			Текст = "Ящик номер: " + Ящик.НомерСтроки + ". Высота ящика: " + Ящик.ВысотаЯщика + ". Минимальная высота ящика: " + Число(МинВысота);
			Поле = "Объект.СписокЯщики[" + (Ящик.НомерСтроки - 1) + "].ВысотаЯщика";
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, Поле, Текст);
		КонецЕсли;
		
		Если Ящик.ПроемЯщика < Число(МинПроем) Тогда
			Текст = "Ящик номер: " + Ящик.НомерСтроки + ". Проем ящика: " + Ящик.ПроемЯщика + ". Минимальный проем ящика: " + Число(МинПроем);
			Поле = "Объект.СписокЯщики[" + (Ящик.НомерСтроки - 1) + "].ПроемЯщика";
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, Поле, Текст);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныМатериалПодЗаказ(ТекущийОбъект)
	
	табМатериалПодЗаказ = ТекущийОбъект.СписокМатериаловПодЗаказ.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("тзМатПодЗаказ", табМатериалПодЗаказ);
	Запрос.УстановитьПараметр("Подразделение", ТекущийОбъект.Подразделение);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таб.Номенклатура,
	|	Таб.Количество,
	|	Таб.Комментарий,
	|	Таб.Поставщик,
	|	Таб.Цена
	|ПОМЕСТИТЬ втМатПодЗаказ
	|ИЗ
	|	&тзМатПодЗаказ КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.Номенклатура,
	|	Таб.Количество,
	|	Таб.Комментарий,
	|	ВЫБОР
	|		КОГДА Таб.Поставщик <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Таб.Поставщик
	|		ИНАЧЕ Цены.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Таб.Цена = 0
	|			ТОГДА ЕСТЬNULL(Цены.Розничная, 0)
	|		ИНАЧЕ Таб.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА Таб.Цена = 0
	|			ТОГДА ЕСТЬNULL(Цены.Розничная, 0) * Таб.Количество
	|		ИНАЧЕ Таб.Цена * Таб.Количество
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	втМатПодЗаказ КАК Таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(, Подразделение = &Подразделение) КАК Цены
	|		ПО Таб.Номенклатура = Цены.Номенклатура";
	
	ТекущийОбъект.СписокМатериаловПодЗаказ.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьМатериалЗаказчика(фнОбъект)
	
	Если фнОбъект.СписокМатериаловЗаказчика.Количество() > 0 Тогда
		
		ТаблицаМатериалЗаказчика = фнОбъект.СписокМатериаловЗаказчика.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("тзМатЗаказчика", ТаблицаМатериалЗаказчика);
		Запрос.УстановитьПараметр("Подразделение", фнОбъект.Подразделение);
		
		СформироватьВТНоменклатура(Запрос, фнОбъект);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Таб.Номенклатура
		|ПОМЕСТИТЬ втСписокНоменклатуры
		|ИЗ
		|	втНоменклатура КАК Таб
		|
		|СГРУППИРОВАТЬ ПО
		|	Таб.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзМатЗаказчика.Номенклатура КАК Номенклатура,
		|	тзМатЗаказчика.Комментарий
		|ПОМЕСТИТЬ втМатЗаказчика
		|ИЗ
		|	&тзМатЗаказчика КАК тзМатЗаказчика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	матЗаказчика.Номенклатура КАК Номенклатура,
		|	матЗаказчика.Комментарий
		|ИЗ
		|	втМатЗаказчика КАК матЗаказчика
		|		ЛЕВОЕ СОЕДИНЕНИЕ втСписокНоменклатуры КАК табНоменклатура
		|		ПО матЗаказчика.Номенклатура = табНоменклатура.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(, &Подразделение = Подразделение) КАК НастройкиНоменклатуры
		|		ПО матЗаказчика.Номенклатура = НастройкиНоменклатуры.Номенклатура
		|ГДЕ
		|	НЕ табНоменклатура.Номенклатура ЕСТЬ NULL
		|	И НастройкиНоменклатуры.МожетПредоставитьЗаказчик";
		
		фнОбъект.СписокМатериаловЗаказчика.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьСписокНоменклатурыЗаказчика(ТекущийОбъект);
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЕстьМатериалПодЗаказ", ТекущийОбъект.ЕстьМатериалПодЗаказ);
	ОбновитьЭлементыФормы(ЭтаФорма, СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СтатусСпецификации = ПолучитьСтатусСпецификации(Объект.Ссылка);
	ПересчитатьСуммы(); // СуммаДокумента обновляется только после записи объекта
	
	ЕстьМонтаж = Объект.ПакетУслуг = ПредопределенноеЗначение("Перечисление.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж");
	ДнейДоИзготовления = (Объект.ДатаИзготовления - НачалоДня(ТекущаяДата()))/86400;
	
	Если СтатусСпецификации = ПредопределенноеЗначение("Перечисление.СтатусыСпецификации.Сохранен") 
		И ЕстьМонтаж 
		И ЗначениеЗаполнено(Объект.ДатаМонтажа) Тогда 
		
		Если ДнейДоИзготовления < Объект.ДнейНаИзготовлениеПоНоменклатуре Тогда
			
			Стр = ПолучитьКоличествоДнейНаИзготовление(Объект.Ссылка);
			ПодходящаяДата = НачалоДня(ТекущаяДата()) + Стр.ДнейНаИзготовление * 86400;
			
			Режим = РежимДиалогаВопрос.ОК;
			Текст = "Время изготовления по номенклатуре: " + Стр.Номенклатура + Символы.ПС + "составляет: " + Стр.ДнейНаИзготовление + " дней." + Символы.ПС
			+ "Установите дату изготовления не ранее: " + Формат(ПодходящаяДата,"ДФ=dd.MM.yyyy");
			Вопрос(Текст, Режим, 0);
			
		ИначеЕсли ДнейДоИзготовления < 7 Тогда
			
			ПодходящаяДата = НачалоДня(ТекущаяДата()) + 7 * 86400;
			
			Режим = РежимДиалогаВопрос.ОК;
			Текст = "Установите дату изготовления не ранее: " + Формат(ПодходящаяДата,"ДФ=dd.MM.yyyy");
			Вопрос(Текст, Режим, 0);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоДнейНаИзготовление(ОбъектСсылка);
	
	Возврат Документы.Спецификация.ПолучитьКоличествоДнейНаИзготовление(ОбъектСсылка);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// { Васильев Александр Леонидович [12.12.2014]
	// Сделать.
	// Растащить по разным обработкам выбора.
	// У каждого элемента есть, нехуй в одном месте держать их.
	// } Васильев Александр Леонидович [12.12.2014]
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.Договор") Тогда
		
		Договор = ВыбранноеЗначение;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Двери") Тогда
		
		СтрокиДверей = Объект.СписокДверей.НайтиСтроки(Новый Структура("Двери", ВыбранноеЗначение));
		
		Если СтрокиДверей.Количество() = 0 Тогда
			НоваяСтрока = Объект.СписокДверей.Добавить();
			НоваяСтрока.Двери = ОпределитьДверь(ВыбранноеЗначение, Объект.Ссылка);
		КонецЕсли;
		
		Модифицированность = Истина;
		ПересчитатьНоменклатуру = Истина;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Монтажник") Тогда
		
		Модифицированность = Истина;
		Объект.Монтажник = ВыбранноеЗначение.Монтажник;
		Объект.ДатаМонтажа = ВыбранноеЗначение.ДатаМонтажа;
		Объект.ДатаОтгрузки = ЛексКлиентСервер.ПолучитьДатуОтгрузки(Объект.ДатаМонтажа);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ОбновитьСтатус(Команда)
	
	СтатусСпецификации = ПолучитьСтатусСпецификации(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	
	Собрать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныефурнитура()
	
	Данные = Новый Структура();
	Данные.Вставить("СчетчикЛДСП", 0);
	Данные.Вставить("КоличествоНужныхРадиусов", 0);
	Данные.Вставить("Кухня", Ложь);
	
	Если Объект.Изделие.ВидИзделия = Перечисления.ВидыИзделий.Кухня Тогда
		Данные.Кухня = Истина;
	КонецЕсли;
	
	Если НЕ Данные.Кухня Тогда
		
		Для каждого Строка Из Объект.СписокДеталей Цикл
			
			ДанныеДеталиФурнитура = ПолучитьДанныеДетали(Строка.ВидДетали);
			
			ЛДСП = Ложь;
			
			Если НЕ ДанныеДеталиФурнитура.ЭтоФасад Тогда
				
				Для Каждого НомГруппа ИЗ ДанныеДеталиФурнитура.НомГруппы Цикл
					
					Знч = НомГруппа.Значение;
					
					Если Знч.ПолеВыбора = "Текстура" Тогда
						
						Если Знч.Группа.ПринадлежитЭлементу(Справочники.НоменклатурныеГруппы.ЛДСП) 
							ИЛИ Знч.Группа = Справочники.НоменклатурныеГруппы.ЛДСП Тогда
							
							ЛДСП = Истина;
							
						КонецЕсли;
					КонецЕсли;
					
					
				КонецЦикла;
				
			КонецЕсли;
			
			Данные.СчетчикЛДСП = Данные.СчетчикЛДСП + Строка.Количество * ЛДСП;
			
			РадиусовВДетали = Число(Строка.РадиусЛевоВерх >= 150)
			+ Число(Строка.РадиусЛевоНиз >= 150)
			+ Число(Строка.РадиусПравоВерх >= 150)
			+ Число(Строка.РадиусПравоНиз >= 150);
			
			Данные.КоличествоНужныхРадиусов = Данные.КоличествоНужныхРадиусов + Строка.Количество * ЛДСП * РадиусовВДетали;
			
		КонецЦикла;
		
		Данные.Вставить("ПараметрыФурнитуры",ПосчитатьКоличествоКрепежа());
		
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура Фурнитура(Команда)
	
	Данные = ПолучитьДанныеФурнитура();
	
	Если НЕ Данные.Кухня Тогда
		
		КоличествоЯщиков = Объект.СписокЯщики.Итог("КоличествоЯщиков");
		
		ПараметрыФурнитуры = Данные.ПараметрыФурнитуры;
		ПараметрыФурнитуры.Вставить("КоличествоДеталейЛДСП", Данные.СчетчикЛДСП);
		ПараметрыФурнитуры.Вставить("КоличествоЯщиков", КоличествоЯщиков);
		ПараметрыФурнитуры.Вставить("Подразделение", Объект.Подразделение);
		ПараметрыФурнитуры.Вставить("КоличествоНужныхРадиусов", Данные.КоличествоНужныхРадиусов);
		
		ОткрытьФорму("Документ.Спецификация.Форма.ФормаФурнитура", ПараметрыФурнитуры, Элементы.Комплектация);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПосчитатьКоличествоКрепежа()
	
	Шуруп16х35черный = 0;
	Шуруп40х35черный = 0;
	Дюбель6х40черный = 0;
	Шуруп30х35черный = 0;
	Шуруп16х35хром = 0;
	Шуруп40х35золото = 0;
	Шуруп16х35золото = 0;
	Шуруп40х35хром = 0;
	ФлянецХромированный = 0;
	Евровинт50 = 0;
	
	ТЗ = Объект.Комплектация.Выгрузить();
	ТЗ.Свернуть("Номенклатура", "Количество");
	
	Номенклатура = ОбщаяНоменклатура;
	
	Для каждого Строка Из ТЗ Цикл
		
		Шуруп16х35черный = ?(Строка.Номенклатура = Номенклатура.Шуруп16х35черный, Строка.Количество, Шуруп16х35черный);
		Шуруп40х35черный = ?(Строка.Номенклатура = Номенклатура.Шуруп40х35черный, Строка.Количество, Шуруп40х35черный);
		Дюбель6х40черный = ?(Строка.Номенклатура = Номенклатура.Дюбель6х40черный, Строка.Количество, Дюбель6х40черный);
		Шуруп30х35черный = ?(Строка.Номенклатура = Номенклатура.Шуруп30х35черный, Строка.Количество, Шуруп30х35черный);
		Шуруп16х35хром = ?(Строка.Номенклатура = Номенклатура.Шуруп16х35хром, Строка.Количество, Шуруп16х35хром);
		Шуруп40х35золото = ?(Строка.Номенклатура = Номенклатура.Шуруп40х35золото, Строка.Количество, Шуруп40х35золото);
		Шуруп16х35золото = ?(Строка.Номенклатура = Номенклатура.Шуруп16х35золото, Строка.Количество, Шуруп16х35золото);
		Шуруп40х35хром = ?(Строка.Номенклатура = Номенклатура.Шуруп40х35хром, Строка.Количество, Шуруп40х35хром);
		Евровинт50 = ?(Строка.Номенклатура = Номенклатура.Евровинт50, Строка.Количество, Евровинт50);
		ФлянецХромированный = ?(Строка.Номенклатура = Номенклатура.ФлянецХромированный, Строка.Количество, ФлянецХромированный);
		
	КонецЦикла;
	
	ПараметрыФурнитуры = Новый Структура;
	
	ПараметрыФурнитуры.Вставить("Шуруп16х35черный", Шуруп16х35черный);
	ПараметрыФурнитуры.Вставить("Шуруп40х35черный", Шуруп40х35черный);
	ПараметрыФурнитуры.Вставить("Дюбель6х40черный", Дюбель6х40черный);
	ПараметрыФурнитуры.Вставить("Шуруп30х35черный", Шуруп30х35черный);
	ПараметрыФурнитуры.Вставить("Шуруп16х35хром", Шуруп16х35хром);
	ПараметрыФурнитуры.Вставить("Шуруп40х35золото", Шуруп40х35золото);
	ПараметрыФурнитуры.Вставить("Шуруп16х35золото", Шуруп16х35золото);
	ПараметрыФурнитуры.Вставить("Шуруп40х35хром", Шуруп40х35хром);
	ПараметрыФурнитуры.Вставить("Евровинт50", Евровинт50);
	ПараметрыФурнитуры.Вставить("ФлянецХромированный", ФлянецХромированный);
	
	Возврат ПараметрыФурнитуры;
	
КонецФункции // ПосчитатьКоличествоКрпежа()

&НаКлиенте
Процедура СотовыеЭлементы(Команда)
	
	АдресТаблицы = ПолучитьАдресТаблицы();
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("АдресТаблицы", АдресТаблицы);
	ПараметрыПодбора.Вставить("Подразделение", Объект.Подразделение);
	ОткрытьФорму("Документ.Спецификация.Форма.ФормаСотовыеЭлементы", ПараметрыПодбора, Элементы.Комплектация);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКаталогу(Команда = Неопределено)
	
	ПоказатьОповещениеПользователя("Табличные части изменены");
	
	//Очистка Табличных частей от данных полученных ранее
	ПерезаполнитьТаблицу(Объект.СписокДеталей);
	ПерезаполнитьТаблицу(Объект.СписокЯщики);
	ПерезаполнитьТаблицу(Объект.Комплектация);
	
	Объект.СписокНоменклатуры.Очистить();
	ОбработкаИзделийПоКаталогу();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПетлиДетали(idДетали)
	
	Строки = Объект.ПетлиДетали.НайтиСтроки(Новый Структура("ИдентификаторДетали", idДетали));
	
	Для Каждого Стр ИЗ Строки Цикл
		Объект.ПетлиДетали.Удалить(Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусСпецификации(фнСпецификацияСсылка)
	
	Возврат Документы.Спецификация.ПолучитьСтатусСпецификации(фнСпецификацияСсылка);
	
КонецФункции

#КонецОбласти

#Область События_реквизитов_шапки

&НаКлиенте
Процедура МонтажникОчистка(Элемент, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	Объект.ДатаОтгрузки = Неопределено;
	Объект.ДатаМонтажа = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетУслугПриИзменении(Элемент)
	
	ПересчитатьНоменклатуру = Истина;
	
	СтруктураПараметров = Новый Структура;
	ЕстьМонтаж = Объект.ПакетУслуг = ПредопределенноеЗначение("Перечисление.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж");
	СтруктураПараметров.Вставить("ЕстьМонтаж", ЕстьМонтаж);
	ОбновитьЭлементыФормы(ЭтаФорма, СтруктураПараметров);
	
	Если НЕ ЕстьМонтаж Тогда
		
		Объект.Монтажник = Неопределено;
		Объект.ДатаМонтажа = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОплатыПриИзменении(Элемент)
	
	ПересчитатьСуммы();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если Объект.Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ЧастноеЛицо") Тогда
		Объект.Контрагент = Неопределено;
	КонецЕсли;
	
	Объект.Дилерский = ЛексСервер.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "Дилер");
	
	ПересчитатьСуммы();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дилерский", Объект.Дилерский);
	ОбновитьЭлементыФормы(ЭтаФорма, СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = Новый НастройкиКомпоновкиДанных;
	
	Отбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	Отбор.ПравоеЗначение = ПредопределенноеЗначение("Справочник.Контрагенты.ЧастноеЛицо");
	Отбор.Использование = Истина;
	
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", Настройки);
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыФормы.Вставить("ТекущаяСтрока", Объект.Контрагент);
	КонецЕсли;
	
	ВыбранныйКонтрагент = ОткрытьФормуМодально("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, Элементы.Контрагент);
	
	Если ВыбранныйКонтрагент <> Неопределено Тогда
		
		Объект.Контрагент = ВыбранныйКонтрагент;
		
		СтруктураПараметров = Новый Структура;
		ОбновитьЭлементыФормы(ЭтаФорма, СтруктураПараметров);
		ПересчитатьСуммы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресМонтажаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
		
		ТекстСообщения = "Укажите подразделение";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Подразделение", "Объект");
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.АдресМонтажа = "Введите адрес" Тогда
		
		СтарыйАдрес = "";
		
	Иначе
		
		СтарыйАдрес = Объект.АдресМонтажа;
		
	КонецЕсли;
	
	ПараметрыАдреса = Новый Структура;
	ПараметрыАдреса.Вставить("ГородВладелец", Объект.Город);
	ПараметрыАдреса.Вставить("Километраж", Объект.Километраж);
	ПараметрыАдреса.Вставить("СтарыйАдрес", СтарыйАдрес);
	
	СтруктураАдреса = ОткрытьФормуМодально("ОбщаяФорма.ФормаВводаАдреса", ПараметрыАдреса, ЭтаФорма);
	
	Если ТипЗнч(СтруктураАдреса) = Тип("Структура") Тогда
		
		Объект.АдресМонтажа = СтруктураАдреса.Адрес;
		Объект.Километраж = СтруктураАдреса.Километраж;
		
		Модифицированность = Истина;
		ПересчитатьНоменклатуру = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНажатие(Элемент, СтандартнаяОбработка)
	
	Если Договор = "Введите договор" Тогда
		
		Если Модифицированность Тогда
			Записать();
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("Основание", Объект.Ссылка);
		ОткрытьФорму("Документ.Договор.Форма.ФормаДокумента", ПараметрыЗаполнения, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПересчитатьНоменклатуру = Истина;
	ОбщаяНоменклатура = ПолучитьОбщуюНоменклатуру(Объект.Подразделение, Объект.КухоннаяКоллекция);
	УведомлениеМатериалПодЗаказ = ПолучитьУведомлениеМатериалПодЗаказ(Объект.Подразделение);
	УстановитьГород();
	
КонецПроцедуры

&НаКлиенте
Процедура ОфисОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИзмененГород = ПроверитьГородОфисаНаСервере(ВыбранноеЗначение, Объект.Офис);
	
	Если ИзмененГород Тогда
		
		Объект.АдресМонтажа = "Введите адрес";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьГородОфисаНаСервере(Офис1, Офис2)
	
	Город1 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Офис1, "Город");
	Город2 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Офис2, "Город");
	
	Возврат Город1 <> Город2;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДеталиЗапрещены(Изделие) 
	
	Запрет = Ложь;
	
	Если Изделие.ЭтоДетали И РольДоступна("ДеталиВСпецификацииЗапрет") Тогда
		 Запрет = Истина;
	КонецЕсли;
	
	Возврат Запрет;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьВидИзделияКухня(Изделие) 
	
	ВидИзделияКухня = Ложь;
	
	Если ЗначениеЗаполнено(Изделие) Тогда
		ВидИзделияКухня = (Изделие.ВидИзделия = Перечисления.ВидыИзделий.Кухня);
	КонецЕсли;
	
	Возврат ВидИзделияКухня;
	
КонецФункции

&НаКлиенте
Процедура ИзделиеПриИзменении(Элемент)
	
	Если ДеталиЗапрещены(Объект.Изделие) Тогда
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вам запрещено создавать спецификации с изделием: Детали.");
		 Объект.Изделие = Неопределено;
		 Возврат;
	КонецЕсли;
	 
	Объект.НастройкиКоллекции.Очистить();
	Объект.КухоннаяКоллекция = Неопределено; 
	
	ВидИзделияКухня = ПроверитьВидИзделияКухня(Объект.Изделие);
	
	ОбщаяНоменклатура = ПолучитьОбщуюНоменклатуру(Объект.Подразделение, Объект.КухоннаяКоллекция);
	
	ПересчитатьНоменклатуру = Истина;
	
	СтруктураИзделия = ПолучитьСвойстваИзделия(Объект.Изделие, Объект.Контрагент);
	
	ЗапретРедактирования = СтруктураИзделия.ЗапретРедактирования;
	
	Если СтруктураИзделия.ЗапретРедактирования
		И (Объект.СписокДеталей.Количество() > 0
		ИЛИ Объект.СписокЯщики.Количество() > 0
		ИЛИ Объект.Комплектация.Количество() > 0
		ИЛИ Объект.СписокДверей.Количество() > 0
		ИЛИ Объект.СписокИзделийПоКаталогу.Количество() > 0) Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Табличные части будут очищены." + Символы.ПС + "Продолжить?" + Символы.ПС + "(В случае отказа Изделие будет - Детали)";
		
		Если Вопрос(Текст, Режим, 0) = КодВозвратаДиалога.Нет Тогда
			Объект.Изделие = ЛексСервер.ПолучитьИзделиеПоНастройке("ЭтоДетали");
		Иначе
			Объект.СписокДеталей.Очистить();
			Объект.СписокЯщики.Очистить();
			Объект.Комплектация.Очистить();
			Объект.СписокДверей.Очистить();
			Объект.СписокИзделийПоКаталогу.Очистить();
			Объект.СписокСерийныхИзделий.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Изделие) Тогда
		ЗаполнитьПакетУслуг(Объект.Изделие);
	Иначе
		Элементы.ПакетУслуг.СписокВыбора.Очистить();
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗапретРедактирования", СтруктураИзделия.ЗапретРедактирования);
	СтруктураПараметров.Вставить("Переделка", СтруктураИзделия.Переделка);
	СтруктураПараметров.Вставить("СерийноеИзделие", СтруктураИзделия.СерийноеИзделие);
	СтруктураПараметров.Вставить("Заблокировать", НЕ ЗначениеЗаполнено(Объект.Изделие) ИЛИ НЕ ЗначениеЗаполнено(Объект.ПакетУслугИзделия));
	СтруктураПараметров.Вставить("ВидИзделияКухня", ВидИзделияКухня);
	
	ОбновитьЭлементыФормы(ЭтаФорма, СтруктураПараметров);
	
	Объект.ПакетУслугИзделия = Неопределено;
	
	ЗаполнитьДоступныеПакетыУслуг();
	
КонецПроцедуры

&НаКлиенте
Процедура МонтажникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Спецификация", Объект.Ссылка);
	ПараметрыФормы.Вставить("Город", Объект.Город);
	
	Если ЗначениеЗаполнено(Объект.Монтажник) Тогда
		ПараметрыФормы.Вставить("Монтажник", Объект.Монтажник);
		ПараметрыФормы.Вставить("ДатаМонтажа", Объект.ДатаМонтажа);
	КонецЕсли;
	
	ОткрытьФорму("Документ.Спецификация.Форма.ФормаВыбораМонтажника", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область События_таблицы_Материалы

&НаКлиенте
Процедура СписокДеталейОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИзменитьБезОкругленияДоЛистов(Ложь);
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("АдресХранилища")
			И ЭтоАдресВременногоХранилища(ВыбранноеЗначение.АдресХранилища) Тогда
			
			Если ВыбранноеЗначение.Свойство("Модифицированность") И НЕ Модифицированность Тогда
				
				Модифицированность = ВыбранноеЗначение.Модифицированность;
				
				Если Модифицированность Тогда
					ПересчитатьНоменклатуру = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			ЗагрузитьТабличнуюЧасть(ВыбранноеЗначение.АдресХранилища, Элемент.Имя);
			
			Если ВыбранноеЗначение.Свойство("АдресХранилищаПетли") Тогда
				 ЗагрузитьТаблицуПетли(ВыбранноеЗначение.АдресХранилищаПетли);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		
		ЗагрузитьТабличнуюЧасть(ВыбранноеЗначение, Элемент.Имя);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуПетли(Адрес)
	
	Значение = ПолучитьИзВременногоХранилища(Адрес);
	Объект.ПетлиДетали.Загрузить(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДеталейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Собрать();
	
КонецПроцедуры

#КонецОбласти

#Область События_таблицы_Ящики

&НаКлиенте
Процедура СписокЯщикиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИзменитьБезОкругленияДоЛистов(Ложь);
	
	Если ВыбранноеЗначение.Свойство("АдресХранилища")
		И ЭтоАдресВременногоХранилища(ВыбранноеЗначение.АдресХранилища) Тогда
		
		Если ВыбранноеЗначение.Свойство("Модифицированность") И НЕ Модифицированность Тогда
			
			Модифицированность = ВыбранноеЗначение.Модифицированность;
			
			Если Модифицированность Тогда
				ПересчитатьНоменклатуру = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		ЗагрузитьТабличнуюЧасть(ВыбранноеЗначение.АдресХранилища, Элемент.Имя);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЯщикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Собрать();
	
КонецПроцедуры

#КонецОбласти

#Область События_таблицы_Двери

&НаКлиенте
Процедура ДобавитьНовуюДверь(Команда)
	
	ЗаписатьПустуюСпецификацию();
	
	ПараметрыФормы = Новый Структура("Спецификация", Объект.Ссылка);
	Форма = ПолучитьФорму("Справочник.Двери.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
	Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДвериСоСпецификации(Команда)
	
	ЗаписатьПустуюСпецификацию();
	
	Форма = ПолучитьФорму("Справочник.Двери.Форма.ФормаВыбора", , ЭтаФорма);
	Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДверейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СсылкаНаДверь = Элемент.ТекущиеДанные.Двери;
	ТолькоПросмотрФормы = ТолькоПросмотр ИЛИ Элементы.СтраницаДвери.ТолькоПросмотр;
	ПараметрыФормы = Новый Структура("Ключ", СсылкаНаДверь);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотрФормы);
	ПараметрыФормы.Вставить("Спецификация", Объект.Ссылка);
	ОткрытьФорму("Справочник.Двери.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьДверь(Дверь, Спецификация)
	
	ОбъектДвери = Дверь.ПолучитьОбъект();
	НашаДверь = ОбъектДвери.Скопировать();
	НашаДверь.Записать();
	
	Дверь = НашаДверь.Ссылка;
	
	Возврат Дверь;
	
КонецФункции 

#КонецОбласти

#Область События_таблицы_ИзделияПоКаталогу

&НаКлиенте
Процедура ИзделияПоКаталогуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Собрать();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзделияПоКаталогуОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИзменитьБезОкругленияДоЛистов(Ложь);
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("Модифицированность") И НЕ Модифицированность Тогда
			
			Модифицированность = ВыбранноеЗначение.Модифицированность;
			
			Если Модифицированность Тогда
				ПересчитатьНоменклатуру = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		ЗагрузитьИзФормыИзделийПоКаталогу(ВыбранноеЗначение);
		
	Иначе
		
		ПересчитатьНоменклатуру = Истина;
		ЗагрузитьТабличнуюЧасть(ВыбранноеЗначение, Элемент.Имя);
		
	КонецЕсли;
	
	ЗаполнитьПоКаталогу();
	ОбновитьВидимостьНастройкиКоллекции();
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФормыИзделийПоКаталогу(Данные)
	
	ЗначениеДетали = ПолучитьИзВременногоХранилища(Данные.Детали);
	ЗначениеФасады = ПолучитьИзВременногоХранилища(Данные.Фасады);
	
	Объект["СписокИзделийПоКаталогу"].Загрузить(ЗначениеДетали);
	Объект["ФасадыКаталога"].Загрузить(ЗначениеФасады);
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	ПересчитатьНоменклатуру = Истина;
	
	Если ВыбранноеЗначение.Таблица = "Комплектация" Тогда
		ЗагрузитьТабличнуюЧасть(ВыбранноеЗначение.АдресТаблицы, ВыбранноеЗначение.Таблица);
	Иначе
		ДобавитьТабЧасть(ВыбранноеЗначение.АдресТаблицы, ВыбранноеЗначение.Таблица);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьТабЧасть(АдресТаблицы, Таблица)
	
	ТЗ = ПолучитьИзВременногоХранилища(АдресТаблицы);
	СправочникГрупп = Справочники.НоменклатурныеГруппы;
	МассивСтрок = Новый Массив;
	
	Если ТипЗнч(ТЗ) = Тип("ТаблицаЗначений") Тогда
		
		Для каждого Строка Из Объект.Комплектация Цикл
			
			НужнаяНоменклатурнаяГруппа = Ложь;
			Номенклатура = Строка.Номенклатура;
			Группа = Номенклатура.НоменклатурнаяГруппа;
			
			Если ЗначениеЗаполнено(Группа) Тогда
				
				Если Таблица = "СотовыеЭлементы" Тогда
					
					НужнаяНоменклатурнаяГруппа = Группа = СправочникГрупп.СотовыеПолки 
					ИЛИ Группа = СправочникГрупп.СотовыеЭлементы
					ИЛИ Группа = СправочникГрупп.Корзины 
					ИЛИ Группа.ПринадлежитЭлементу(СправочникГрупп.Направляющие);
					
				ИначеЕсли Таблица = "Фурнитура" Тогда
					
					//Можно будет внести уголки, подумаем
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Таблица = "СотовыеЭлементы" Тогда
				
				Предопределенный = Номенклатура = ОбщаяНоменклатура.Прищепки
				ИЛИ Номенклатура = ОбщаяНоменклатура.Наконечник
				ИЛИ Номенклатура = ОбщаяНоменклатура.Клипсы
				ИЛИ Номенклатура = ОбщаяНоменклатура.Карманы
				ИЛИ Номенклатура = ОбщаяНоменклатура.КронштейнДляСотовойПолки;
				
			ИначеЕсли Таблица = "Фурнитура" Тогда
				
				Предопределенный = Номенклатура = ОбщаяНоменклатура.Шуруп40х35золото
				ИЛИ Номенклатура = ОбщаяНоменклатура.Шуруп16х35золото
				ИЛИ Номенклатура = ОбщаяНоменклатура.Шуруп40х35хром
				ИЛИ Номенклатура = ОбщаяНоменклатура.Шуруп16х35хром
				ИЛИ Номенклатура = ОбщаяНоменклатура.Евровинт50
				ИЛИ Номенклатура = ОбщаяНоменклатура.ФлянецХромированный
				ИЛИ Номенклатура = ОбщаяНоменклатура.Шуруп16х35черный
				ИЛИ Номенклатура = ОбщаяНоменклатура.Шуруп30х35черный
				ИЛИ Номенклатура = ОбщаяНоменклатура.Шуруп30х35черный
				ИЛИ Номенклатура = ОбщаяНоменклатура.Дюбель6х40черный;
				
			КонецЕсли;
			
			Если НужнаяНоменклатурнаяГруппа ИЛИ Предопределенный Тогда
				
				МассивСтрок.Добавить(Строка);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого Элемент Из МассивСтрок Цикл
			
			Объект.Комплектация.Удалить(Элемент);
			
		КонецЦикла;
		
		Для каждого Строчка Из ТЗ Цикл
			
			НоваяСтрока = Объект.Комплектация.Добавить();
			НоваяСтрока.Номенклатура = Строчка.Номенклатура;
			НоваяСтрока.Количество = Строчка.Количество;
			НоваяСтрока.ЕдиницаИзмерения = Строчка.ЕдиницаИзмерения;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции // ДобавитьТабЧасть()

#КонецОбласти

#Область События_таблицы_МатериалЗаказчика

&НаКлиенте
Процедура СписокМатериаловЗаказчикаНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		СписокВыбора = Элементы.СписокМатериаловЗаказчикаНоменклатура.СписокВыбора;
		
		НайденныйЭлемент = СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
		
		Если НайденныйЭлемент <> Неопределено Тогда
			
			//RonEXI: После обновления бсп теперь при удалении элемента списка, его нельзя выбрать.
			//СписокВыбора.Удалить(НайденныйЭлемент);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокМатериаловЗаказчикаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокМатериаловЗаказчикаПередУдалением(Элемент, Отказ)
	
	Номенклатура = Элементы.СписокМатериаловЗаказчика.ТекущиеДанные.Номенклатура;
	СписокВыбора = Элементы.СписокМатериаловЗаказчикаНоменклатура.СписокВыбора;
	СписокВыбора.Добавить(Номенклатура);
	
КонецПроцедуры

#КонецОбласти

#Область События_таблицы_ПодЗаказ

&НаКлиенте
Процедура СписокМатериаловПодЗаказПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить(Новый ПараметрВыбора("Отбор.Поставщик", Истина));
	МассивОтбора.Добавить(Новый ПараметрВыбора("Отбор.Подразделение", Объект.Подразделение));
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокМатериаловПоЗаказЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокМатериаловПодЗаказ.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КомплектацияНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Комплектация.ТекущиеДанные;
	
	Если ТекущиеДанные.НомерИзделия <> 0 Тогда		
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("НоменклатурнаяГруппа", ПолучитьНомГруппыНеЛистовойМатериал());
	Отбор.Вставить("Базовый", Истина);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы.Вставить("ТекущаяСтрока", ТекущиеДанные.Номенклатура);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНомГруппыНеЛистовойМатериал()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидМатериала", Перечисления.ВидыМатериалов.Листовой);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатурныеГруппы.Ссылка
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ
	|	НЕ (НоменклатурныеГруппы.ВидМатериала = &ВидМатериала)";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Группы = Новый СписокЗначений;
	
	Для Каждого Стр Из ТЗ Цикл
		Группы.Добавить(Стр.Ссылка);
	КонецЦикла;
	
	Возврат Группы;
	
КонецФункции

&НаКлиенте
Процедура КомплектацияНоменклатураНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Комплектация.ТекущиеДанные;
	
	Если ТекущиеДанные.НомерИзделия <> 0 Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБезОкругленияДоЛистов(Команда)
	
	ПересчитатьНоменклатуру = Истина;
	ИзменитьБезОкругленияДоЛистов(НЕ Объект.БезОкругленияДоЛистов);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьБезОкругленияДоЛистов(Значение)
	
	Объект.БезОкругленияДоЛистов = Значение;
	
	Если Объект.БезОкругленияДоЛистов Тогда
		УведомлениеОкруглениеДоЛистов = "Материал не округляется до листов!";
	Иначе
		УведомлениеОкруглениеДоЛистов = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектацияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТДанные = Элементы.Комплектация.ТекущиеДанные;
	
	Если Копирование И (ТДанные.НомерИзделия <> 0) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ФиксМассивчик = Новый ФиксированныйМассив(СписокНоменклатурныхГрупп.Массив);
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Базовый", Истина));
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ЗапретИспользования", Ложь));
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.НоменклатурнаяГруппа", ФиксМассивчик));
	ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	Элементы.КомплектацияНоменклатура.ПараметрыВыбора = ПараметрыВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокМатериаловПодЗаказСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокМатериаловПодЗаказ.ТекущиеДанные;
	ТекущиеДанные.Цена = ?(ТекущиеДанные.Количество > 0, ТекущиеДанные.Сумма / ТекущиеДанные.Количество, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектацияПередУдалением(Элемент, Отказ)
	
	ТДанные = Элементы.Комплектация.ТекущиеДанные;
	
	Если ТДанные.НомерИзделия <> 0 И ТДанные.ПоКаталогуМестоОбработки = "Цех" Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектацияНоменклатураОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КомплектацияПриАктивизацииСтроки(Элемент)
	
	// { Васильев Александр Леонидович [01.11.2016]
	// Клади в правильную область, если добавляешь.
	// Ещё такое поведение можно условным оформлением организовать, без кода.
	
	ТДанные = Элементы.Комплектация.ТекущиеДанные;
	Если ТДанные <> Неопределено Тогда
		Элементы.КомплектацияНоменклатура.ТолькоПросмотр = (ТДанные.НомерИзделия <> 0);
		Элементы.КомплектацияКоличество.ТолькоПросмотр = (ТДанные.НомерИзделия <> 0);
	КонецЕсли;
	
	// } Васильев Александр Леонидович [01.11.2016]
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБлижайшуюДату(Команда)
	
	//RonEXI: Запись потому что нужно заполнить список номенклатуры.
	Записать();
	
	Объект.ДатаОтгрузки = ОпределитьДатуОтгрузкиБезСрочности();
	
	Если ЗначениеЗаполнено(Объект.ДатаОтгрузки) Тогда
		Объект.Срочный = Ложь;
		//RonEXI: Запись чтобы изменилась дата изготовления.
		Записать();
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьДатуОтгрузкиБезСрочности()
	
	СтоимостьУслуг = Документы.Спецификация.ПолучитьСтоимостьУслугБезВнешних(Объект.СписокНоменклатуры.Выгрузить());
	СтоимостьУслуг = СтоимостьУслуг.ЗарплатаЦеха;
	
	ДнейНаИзготовление = 2 + ?(Объект.Изделие.ДнейНаИзготовление > Объект.ДнейНаИзготовлениеПоНоменклатуре, Объект.Изделие.ДнейНаИзготовление - 1, Объект.ДнейНаИзготовлениеПоНоменклатуре);
	
	Если ЗначениеЗаполнено(Объект.Подразделение.ВремяПриемаСрочных) И Час(Объект.Подразделение.ВремяПриемаСрочных-1) < Час(ТекущаяДата()) Тогда
		ДнейНаИзготовление = ДнейНаИзготовление + 1;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("КонецПериода", Дата('3000.01.01'));
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("СтоимостьУслуг", СтоимостьУслуг);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеховойЛимит.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ЦеховойЛимит.Обороты(&ДатаДокумента, &КонецПериода, День, Подразделение = &Подразделение) КАК ЦеховойЛимит
	|ГДЕ
	|	ЕСТЬNULL(ЦеховойЛимит.СтоимостьУслугПланОборот, 0) - ЕСТЬNULL(ЦеховойЛимит.СтоимостьУслугФактОборот, 0) > &СтоимостьУслуг
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ДеньНайден = Ложь;
	Счетчик = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Счетчик = Счетчик + 1;
		
		//+1 потому что отгрузка на след день.
		Если Счетчик = (ДнейНаИзготовление + 1) Тогда
			ДеньНайден = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ДеньНайден Тогда
		Возврат Выборка.Период;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен плановый лимит.");
		Возврат Дата("00010101");
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОбщуюНоменклатуру(Подразделение, Коллекция)
	Возврат ЛексСерверПовтИсп.ПолучитьОбщуюНоменклатуруПолностью(Подразделение, Коллекция);
КонецФункции

&НаКлиенте
Процедура ПодобратьОбрезки(Команда)
	
	Если Объект.СписокЛистовНоменклатуры.Количество() > 0 Тогда
		
		Массив = Новый Массив();
		
		Для Каждого Строка Из Объект.СписокЛистовНоменклатуры Цикл
			Массив.Добавить(Строка.Номенклатура);
		КонецЦикла;
		
		Таблица = Объект.ОбрезкиЛистовогоМатериала;
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("СписокНоменклатуры", Массив);
		ПараметрыОткрытияФормы.Вставить("Подразделение", Объект.Подразделение);
		ПараметрыОткрытияФормы.Вставить("ТаблицаОбрезков", ВыгрузитьНужнуюТаблицуВХранилище(Таблица));
		
		ОткрытьФорму("Документ.Спецификация.Форма.ФормаПодбораОбрезков", ПараметрыОткрытияФормы, Элементы.ОбрезкиЛистовогоМатериала);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Листовой материал не заполнен или не используется. Сохраните спецификацию перед подбором.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбрезкиЛистовогоМатериалаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ПересчитатьНоменклатуру = Истина;
	ЗагрузитьТабличнуюЧасть(ВыбранноеЗначение.АдресХранилища, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОбрезкиЛистовогоМатериалаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтгрузкиПриИзменении(Элемент)
	
	Если Объект.ДатаОтгрузки < ТекущаяДата() Тогда
		Объект.ДатаОтгрузки = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьГород()
	
	Если Объект.Дилерский Тогда
		Результат = ЛексСервер.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "Город")
	ИначеЕсли ЗначениеЗаполнено(Объект.Офис) Тогда
		Результат = ЛексСервер.ЗначениеРеквизитаОбъекта(Объект.Офис, "Город")
	Иначе
		Результат = ЛексСервер.ЗначениеРеквизитаОбъекта(Объект.Подразделение, "Город")
	КонецЕсли;
	
	Объект.Город = Результат;
	
КонецФункции

&НаКлиенте
Процедура ОфисПриИзменении(Элемент)
	
	ПересчитатьНоменклатуру = Истина;
	УстановитьГород();
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектацияПриИзменении(Элемент)
	ПересчитатьНоменклатуру = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокМатериаловПодЗаказПриИзменении(Элемент)
	ПересчитатьНоменклатуру = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокМатериаловЗаказчикаПриИзменении(Элемент)
	ПересчитатьНоменклатуру = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СкладГотовойПродукцииПриИзменении(Элемент)
	ПересчитатьНоменклатуру = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокСерийныхИзделийПриИзменении(Элемент)
	ПересчитатьНоменклатуру = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	ПересчитатьНоменклатуру = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПакетУслугИзделияПриИзменении(Элемент)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Заблокировать", НЕ ЗначениеЗаполнено(Объект.Изделие) ИЛИ НЕ ЗначениеЗаполнено(Объект.ПакетУслугИзделия));
	
	ОбновитьЭлементыФормы(ЭтаФорма, СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура КухоннаяКоллекцияПриИзменении(Элемент)
	
	Объект.НастройкиКоллекции.Очистить();
	
	Если ЗначениеЗаполнено(Объект.КухоннаяКоллекция) Тогда
		
		НастройкиПоУмолчанию = ПолучитьНастройкиКухоннойКоллекции(Объект.КухоннаяКоллекция);
		
		Стр = Объект.НастройкиКоллекции.Добавить();
		Стр.Коллекция = Объект.КухоннаяКоллекция;
		Стр.ВысотаКоробовВерх = НастройкиПоУмолчанию.ВысотаКоробовВерх;
		Стр.ВысотаКоробовНиз = НастройкиПоУмолчанию.ВысотаКоробовНиз;
		Стр.ОбщаяВысота = НастройкиПоУмолчанию.ОбщаяВысота;
		
		Элементы.НастройкиКоллекции.ТекущаяСтрока = 0;
		
	КонецЕсли;
	
	ОбщаяНоменклатура = ПолучитьОбщуюНоменклатуру(Объект.Подразделение, Объект.КухоннаяКоллекция);
	
	ОбновитьВидимостьНастройкиКоллекции();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиКухоннойКоллекции(Ссылка)
	
	Стр = Новый Структура();
	Стр.Вставить("ВысотаКоробовВерх", Ссылка.ВысотаКоробовВерх);
	Стр.Вставить("ВысотаКоробовНиз", Ссылка.ВысотаКоробовНиз);
	Стр.Вставить("ОбщаяВысота", Ссылка.ОбщаяВысота);
	
	Возврат Стр;
	
КонецФункции

&НаКлиенте
Процедура НастройкиКоллекцииФормаПриИзменении(Элемент)
	
	ТекДанные = Объект.НастройкиКоллекции[0];
	
	ТекДанные.ШиринаКухниЛево = 0;
	ТекДанные.ШиринаКухниПраво = 0;
	ТекДанные.ШиринаКухниЦентр = 0;
	
	ТекДанные.ГлубинаКухниЛево = 0;
	ТекДанные.ГлубинаКухниПраво = 0;
	ТекДанные.ГлубинаКухниЦентр = 0;
	
	Если ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.Прямая")
		ИЛИ ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПрямаяСтенаСлева")
		ИЛИ ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПрямаяСтенаСправа")
		ИЛИ ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПрямаяСтеныСДвухСторон") Тогда
		 ТекДанные.КоличествоСторон = 1;
	ИначеЕсли ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.Угловая")
		ИЛИ ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.УгловаяСтенаСлева")
		ИЛИ ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.УгловаяСтенаСправа")
		ИЛИ ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.УгловаяСтеныСДвухСторон") Тогда
		 ТекДанные.КоличествоСторон = 2;
	ИначеЕсли ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПОбразная")
		ИЛИ ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПОбразнаяСтенаСлева")
		ИЛИ ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПОбразнаяСтенаСправа")
		ИЛИ ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПОбразнаяСтеныСДвухСторон") Тогда
		 ТекДанные.КоличествоСторон = 3;
	КонецЕсли;
	
	ОбновитьВидимостьНастройкиКоллекции();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьНастройкиКоллекции()
	
	Если Объект.НастройкиКоллекции.Количество() > 0 Тогда
		
		Элементы.ГруппаКоллекцияРазмеры.Видимость = Истина;
		
		ТекДанные = Объект.НастройкиКоллекции[0];
		
		Если ЗначениеЗаполнено(ТекДанные.Форма) Тогда
			
			 Элементы.ГруппаКоллекцияФормаРазмеры.Видимость = Истина;
			 
			 Элементы.КартинкаФормаКухниПрямая.Видимость = Ложь;
			 Элементы.КартинкаФормаКухниПрямаяСтенаСлева.Видимость = Ложь;
			 Элементы.КартинкаФормаКухниПрямаяСтенаСправа.Видимость = Ложь;
			 Элементы.КартинкаФормаКухниПрямаяСтеныСДвухСторон.Видимость = Ложь;
			 
			 Элементы.КартинкаФормаКухниУгловая.Видимость = Ложь;
			 Элементы.КартинкаФормаКухниУгловаяСтенаСлева.Видимость = Ложь;
			 Элементы.КартинкаФормаКухниУгловаяСтенаСправа.Видимость = Ложь;
			 Элементы.КартинкаФормаКухниУгловаяСтеныСДвухСторон.Видимость = Ложь;
			 
			 Элементы.КартинкаФормаКухниПОбразная.Видимость = Ложь;
			 Элементы.КартинкаФормаКухниПОбразнаяСтенаСлева.Видимость = Ложь;
			 Элементы.КартинкаФормаКухниПОбразнаяСтенаСправа.Видимость = Ложь;
			 Элементы.КартинкаФормаКухниПОбразнаяСтеныСДвухСторон.Видимость = Ложь;
			 
			 Элементы.НастройкиКоллекцииШиринаКухниЛево.Видимость = Ложь;
			 Элементы.НастройкиКоллекцииШиринаКухниПраво.Видимость = Ложь;
			 Элементы.НастройкиКоллекцииГлубинаКухниЛево.Видимость = Ложь;
			 Элементы.НастройкиКоллекцииГлубинаКухниПраво.Видимость = Ложь;
			 
			 Если ТекДанные.КоличествоСторон = 2 Тогда
				  Элементы.НастройкиКоллекцииШиринаКухниЛево.Видимость = Истина;
				  Элементы.НастройкиКоллекцииГлубинаКухниЛево.Видимость = Истина;
			 ИначеЕсли ТекДанные.КоличествоСторон = 3 Тогда
				  Элементы.НастройкиКоллекцииШиринаКухниЛево.Видимость = Истина;
			 	  Элементы.НастройкиКоллекцииШиринаКухниПраво.Видимость = Истина;
				  Элементы.НастройкиКоллекцииГлубинаКухниЛево.Видимость = Истина;
			 	  Элементы.НастройкиКоллекцииГлубинаКухниПраво.Видимость = Истина;
			 КонецЕсли;
			 
			 Если ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.Прямая") Тогда
			 	Элементы.КартинкаФормаКухниПрямая.Видимость = Истина;
			 ИначеЕсли ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПрямаяСтенаСлева") Тогда
				Элементы.КартинкаФормаКухниПрямаяСтенаСлева.Видимость = Истина;	
			 ИначеЕсли ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПрямаяСтенаСправа") Тогда
				Элементы.КартинкаФормаКухниПрямаяСтенаСправа.Видимость = Истина;	
			 ИначеЕсли ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПрямаяСтеныСДвухСторон") Тогда
				Элементы.КартинкаФормаКухниПрямаяСтеныСДвухСторон.Видимость = Истина;	
			 ИначеЕсли ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.Угловая") Тогда
				Элементы.КартинкаФормаКухниУгловая.Видимость = Истина;
			 ИначеЕсли ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.УгловаяСтенаСлева") Тогда
				Элементы.КартинкаФормаКухниУгловаяСтенаСлева.Видимость = Истина;
			 ИначеЕсли ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.УгловаяСтенаСправа") Тогда
				Элементы.КартинкаФормаКухниУгловаяСтенаСправа.Видимость = Истина;
			 ИначеЕсли ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.УгловаяСтеныСДвухСторон") Тогда
				Элементы.КартинкаФормаКухниУгловаяСтеныСДвухСторон.Видимость = Истина;
			 ИначеЕсли ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПОбразная") Тогда
				Элементы.КартинкаФормаКухниПОбразная.Видимость = Истина;
			 ИначеЕсли ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПОбразнаяСтенаСлева") Тогда
				Элементы.КартинкаФормаКухниПОбразнаяСтенаСлева.Видимость = Истина;
			 ИначеЕсли ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПОбразнаяСтенаСправа") Тогда
				Элементы.КартинкаФормаКухниПОбразнаяСтенаСправа.Видимость = Истина;
			 ИначеЕсли ТекДанные.Форма = ПредопределенноеЗначение("Перечисление.ФормыКухонь.ПОбразнаяСтеныСДвухСторон") Тогда
				Элементы.КартинкаФормаКухниПОбразнаяСтеныСДвухСторон.Видимость = Истина;
			 КонецЕсли;
 
		Иначе
			 Элементы.ГруппаКоллекцияФормаРазмеры.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		 Элементы.ГруппаКоллекцияРазмеры.Видимость = Ложь;
	КонецЕсли;
	
	Если ВидИзделияКухня Тогда
		Элементы.ГруппаКухонныеКоллекции.Доступность = НЕ (Объект.СписокИзделийПоКаталогу.Количество() > 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполненностьДанныхКухКоллекции()
	
	Заполнено = Ложь;
	
	Если ЗначениеЗаполнено(Объект.КухоннаяКоллекция) И Объект.НастройкиКоллекции.Количество() > 0 Тогда
		
		Данные = Объект.НастройкиКоллекции[0];
		
		Если ЗначениеЗаполнено(Данные.Форма) Тогда
			
			КоличествоСторон = Данные.КоличествоСторон; 
			
			Если КоличествоСторон = 1 Тогда
				
				Если ЗначениеЗаполнено(Данные.ШиринаКухниЦентр) 
				   И ЗначениеЗаполнено(Данные.ГлубинаКухниЦентр) Тогда
					 Заполнено = Истина;	
				КонецЕсли;
				  
			ИначеЕсли КоличествоСторон = 2 Тогда
				
				Если ЗначениеЗаполнено(Данные.ШиринаКухниЛево) И ЗначениеЗаполнено(Данные.ШиринаКухниЦентр) 
				   И ЗначениеЗаполнено(Данные.ГлубинаКухниЛево) И ЗначениеЗаполнено(Данные.ГлубинаКухниЦентр) Тогда
					 Заполнено = Истина;	
				КонецЕсли;
				
			ИначеЕсли КоличествоСторон = 3 Тогда
			 
				Если ЗначениеЗаполнено(Данные.ШиринаКухниЛево) И ЗначениеЗаполнено(Данные.ШиринаКухниЦентр) И ЗначениеЗаполнено(Данные.ШиринаКухниПраво)
				   И ЗначениеЗаполнено(Данные.ГлубинаКухниЛево) И ЗначениеЗаполнено(Данные.ГлубинаКухниЦентр) И ЗначениеЗаполнено(Данные.ГлубинаКухниПраво) Тогда
					 Заполнено = Истина;	
				КонецЕсли;
				
			КонецЕсли;

		КонецЕсли;
		
	Иначе		
		Заполнено = Истина;	
	КонецЕсли;
	     
	Возврат Заполнено;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуПодбораНоменклатуры(НомГруппы, ЭлементФормы)
	
	Пар = Новый Структура();
	Пар.Вставить("НомГруппы", НомГруппы);
	Пар.Вставить("Подразделение", Объект.Подразделение);
	Пар.Вставить("Офис", Объект.Офис);
	
	Если Объект.Дилерский Тогда
		Пар.Вставить("Контрагент", Объект.Контрагент);
	КонецЕсли;
	

	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбора", Пар, ЭлементФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКоллекцииСтолешницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомГруппы = Новый СписокЗначений;
	НомГруппы.Добавить(ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Столешница"));
	
	ОткрытьФормуПодбораНоменклатуры(НомГруппы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКоллекцииКромкаСтолешницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомГруппы = Новый СписокЗначений;
	НомГруппы.Добавить(ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Кромка2_42"));
	НомГруппы.Добавить(ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Кромка2_45"));
	
	ОткрытьФормуПодбораНоменклатуры(НомГруппы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКоллекцииПристенокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомГруппы = Новый СписокЗначений;
	НомГруппы.Добавить(ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Пристенок"));
	
	ОткрытьФормуПодбораНоменклатуры(НомГруппы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКоллекцииКромкаПристенокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомГруппы = Новый СписокЗначений;
	НомГруппы.Добавить(ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Кромка045_19"));
	
	ОткрытьФормуПодбораНоменклатуры(НомГруппы, Элемент);
	
КонецПроцедуры
