
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	БухгалтерскийУчетСервер.ПроведениеДенежныхСредств(Ссылка, Движения);
	
	Если СчетДт = ПланыСчетов.Управленческий.РасчетныйСчет И
		Субконто2Дт.ПринадлежитПодразделению <> Подразделение Тогда
		ВзаиморасчетыПодразделений();
	КонецЕсли;
	
	Если СчетКт = ПланыСчетов.Управленческий.ВзаиморасчетыСПокупателями Тогда
		Если ТипЗнч(Субконто2Кт) = Тип("ДокументСсылка.Договор") Тогда
			ДобавитьПоказателиСотрудникам();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Для Каждого Элемент Из СчетДт.ВидыСубконто Цикл
	//	ПроверяемыеРеквизиты.Добавить("Субконто" +Элемент.НомерСтроки+ "Дт");
	//КонецЦикла;
	//
	//Для Каждого Элемент Из СчетКт.ВидыСубконто Цикл
	//	ПроверяемыеРеквизиты.Добавить("Субконто" +Элемент.НомерСтроки+ "Кт");
	//КонецЦикла;
	
КонецПроцедуры

Процедура ВзаиморасчетыПодразделений()
	
	ДопПроводки = Движения.Управленческий.Добавить();
	ДопПроводки.Период = Дата;
	ДопПроводки.СчетДт = ЛексСервер.ПолучитьЗатратныйСчетПодразделения(Подразделение);
	ДопПроводки.СчетКт = ПланыСчетов.Управленческий.ВзаиморасчетыСПоставщиками;
	ДопПроводки.Подразделение = Подразделение;
	ДопПроводки.Сумма = Сумма;
	ДопПроводки.Содержание = "Взаиморасчеты между подразделениями";
	
	ДопПроводки = Движения.Управленческий.Добавить();
	ДопПроводки.Период = Дата;
	ДопПроводки.СчетДт = ПланыСчетов.Управленческий.ВзаиморасчетыСПоставщиками;
	ДопПроводки.СчетКт = ПланыСчетов.Управленческий.Доходы;
	ДопПроводки.Подразделение = Субконто2Дт.ПринадлежитПодразделению;
	ДопПроводки.Сумма = Сумма;
	ДопПроводки.Содержание = "Взаиморасчеты между подразделениями";
	
КонецПроцедуры

Процедура ДобавитьПоказателиСотрудникам()
	
	ПроцентПоделиться = Субконто2Кт.ПроцентПоделиться / 100;
	ПроцентАвтора = 1 - ПроцентПоделиться;
	
	ДопПроводки = Движения.Управленческий.Добавить();
	ДопПроводки.Период = Дата;
	ДопПроводки.СчетДт = ПланыСчетов.Управленческий.ПоказателиСотрудника;
	ДопПроводки.Подразделение = Подразделение;
	ДопПроводки.СубконтоДт.ВидыПоказателейСотрудников = Перечисления.ВидыПоказателейСотрудников.ВыручкаПоДоговорам;
	ДопПроводки.СубконтоДт.ФизическиеЛица = Субконто2Кт.Автор.ФизическоеЛицо;
	ДопПроводки.Сумма = Сумма * ПроцентАвтора;
	
	ДопПроводки.Содержание = "Показатели сотрудников";
	
	Если ПроцентПоделиться <> 0 Тогда
		
		ДопПроводки = Движения.Управленческий.Добавить();
		ДопПроводки.Период = Дата;
		ДопПроводки.СчетДт = ПланыСчетов.Управленческий.ПоказателиСотрудника;
		ДопПроводки.Подразделение = Подразделение;
		ДопПроводки.СубконтоДт.ВидыПоказателей = Перечисления.ВидыПоказателейСотрудников.ВыручкаПоДоговорам;
		ДопПроводки.СубконтоДт.ФизическиеЛица = Субконто2Кт.Поделиться;
		ДопПроводки.Сумма = Сумма * ПроцентПоделиться;
		ДопПроводки.Содержание = "Показатели сотрудников";
		
	КонецЕсли;
	
КонецПроцедуры
