
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	БухгалтерскийУчетСервер.ПроведениеДенежныхСредств(Ссылка, Движения);
	
	Если СчетДт = ПланыСчетов.Управленческий.РасчетныйСчет И
		Субконто2Дт.ПринадлежитПодразделению <> Подразделение Тогда
		ВзаиморасчетыПодразделений();
	КонецЕсли;
	
	Если СчетКт = ПланыСчетов.Управленческий.ВзаиморасчетыСПокупателями Тогда
		Если ТипЗнч(Субконто2Кт) = Тип("ДокументСсылка.Договор") ИЛИ ТипЗнч(Субконто2Кт) = Тип("ДокументСсылка.ДополнительноеСоглашение") Тогда
			ДобавитьПоказателиСотрудникам();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Для Каждого Элемент Из СчетДт.ВидыСубконто Цикл
	//	ПроверяемыеРеквизиты.Добавить("Субконто" +Элемент.НомерСтроки+ "Дт");
	//КонецЦикла;
	//
	//Для Каждого Элемент Из СчетКт.ВидыСубконто Цикл
	//	ПроверяемыеРеквизиты.Добавить("Субконто" +Элемент.НомерСтроки+ "Кт");
	//КонецЦикла;
	
КонецПроцедуры

Процедура ВзаиморасчетыПодразделений()
	
	ДопПроводки = Движения.Управленческий.Добавить();
	ДопПроводки.Период = Дата;
	ДопПроводки.СчетДт = ЛексСервер.ПолучитьЗатратныйСчетПодразделения(Подразделение);
	ДопПроводки.СчетКт = ПланыСчетов.Управленческий.ВзаиморасчетыСПоставщиками;
	ДопПроводки.Подразделение = Подразделение;
	ДопПроводки.Сумма = Сумма;
	ДопПроводки.Содержание = "Взаиморасчеты между подразделениями";
	
	ДопПроводки = Движения.Управленческий.Добавить();
	ДопПроводки.Период = Дата;
	ДопПроводки.СчетДт = ПланыСчетов.Управленческий.ВзаиморасчетыСПоставщиками;
	ДопПроводки.СчетКт = ПланыСчетов.Управленческий.Доходы;
	ДопПроводки.Подразделение = Субконто2Дт.ПринадлежитПодразделению;
	ДопПроводки.Сумма = Сумма;
	ДопПроводки.Содержание = "Взаиморасчеты между подразделениями";
	
КонецПроцедуры

Процедура ДобавитьПоказателиСотрудникам()
	
	Если ТипЗнч(Субконто2Кт) = Тип("ДокументСсылка.ДополнительноеСоглашение") Тогда
		ПроцентПоделиться = Субконто2Кт.Договор.ПроцентПоделиться / 100;
		ПроцентАвтора = 1 - ПроцентПоделиться;
		ФизЛицоПоделиться = Субконто2Кт.Договор.Поделиться;
	Иначе
		ПроцентПоделиться = Субконто2Кт.ПроцентПоделиться / 100;
		ПроцентАвтора = 1 - ПроцентПоделиться;
		ФизЛицоПоделиться = Субконто2Кт.Поделиться;
	КонецЕсли;                                                  
	
	ДопПроводки = Движения.Управленческий.Добавить();
	ДопПроводки.Период = Дата;
	ДопПроводки.СчетДт = ПланыСчетов.Управленческий.ПоказателиСотрудника;
	ДопПроводки.Подразделение = Подразделение;
	ДопПроводки.СубконтоДт.ВидыПоказателейСотрудников = Перечисления.ВидыПоказателейСотрудников.ВыручкаПоДоговорам;
	ДопПроводки.СубконтоДт.ФизическиеЛица = Субконто2Кт.Автор.ФизическоеЛицо;
	ДопПроводки.Сумма = Сумма * ПроцентАвтора;
	
	ДопПроводки.Содержание = "Показатели сотрудников";
	
	Если ПроцентПоделиться <> 0 Тогда
		
		ДопПроводки = Движения.Управленческий.Добавить();
		ДопПроводки.Период = Дата;
		ДопПроводки.СчетДт = ПланыСчетов.Управленческий.ПоказателиСотрудника;
		ДопПроводки.Подразделение = Подразделение;
		ДопПроводки.СубконтоДт.ВидыПоказателейСотрудников = Перечисления.ВидыПоказателейСотрудников.ВыручкаПоДоговорам;
		ДопПроводки.СубконтоДт.ФизическиеЛица = ФизЛицоПоделиться;
		ДопПроводки.Сумма = Сумма * ПроцентПоделиться;
		ДопПроводки.Содержание = "Показатели сотрудников";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПриходДенежныхСредств.Ссылка) КАК Количество
		|ИЗ
		|	Документ.ПриходДенежныхСредств КАК ПриходДенежныхСредств
		|ГДЕ
		|	ПриходДенежныхСредств.Проведен";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
		
			КоличествоДокументов = 0;
		
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		НомерДоговора = "";
		Если ТипЗнч(ЭтотОбъект.Субконто2Кт) = Тип("ДокументСсылка.Договор") Тогда
			
			НомерДоговора = ЭтотОбъект.Субконто2Кт.Номер;
			
		ИначеЕсли ТипЗнч(ЭтотОбъект.Субконто2Кт) = Тип("ДокументСсылка.ДополнительноеСоглашение") Тогда
			
			НомерДоговора = ЭтотОбъект.Субконто2Кт.Договор.Номер;
			
		КонецЕсли;
		
		НадоПрисвоитьНомер = СтрДлина(НомерДоговора) > 0;
		
		Если НадоПрисвоитьНомер Тогда
			
			ВыборкаДетальныеЗаписи.Следующий();
			КоличествоДокументов = ВыборкаДетальныеЗаписи.Количество + 1;
			ЭтотОбъект.ФискальныйНомер = НомерДоговора + "_" + КоличествоДокументов;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
