////////////////////////////////////////////////////////////////////////////////
// Подсистема "Настройка порядка элементов".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// См. эту функцию в модуле НастройкаПорядкаЭлементовСлужебный.
Функция ИзменитьПорядокЭлементов(Ссылка, УстановленныеОтборы, ОтображениеСписком, ПередвинутьВверх) Экспорт
	
	Возврат НастройкаПорядкаЭлементовСлужебный.ИзменитьПорядокЭлементов(
		Ссылка, УстановленныеОтборы, ОтображениеСписком, ПередвинутьВверх);
	
КонецФункции

