
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ОтделТехническогоКонтроля";
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Защита = Ложь;
		ТабДок.ТолькоПросмотр = Истина;
		ТабДок.ОтображатьЗаголовки = Ложь;
		СформироватьНаСервере(ТабДок, ПараметрКоманды, ТекущаяДата());
		ТабДок.Показать("ОТК");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере(ТабДок, НаряЗадание, Дата)
	
	Отчеты.ОтделТехническогоКонтроля.СформироватьОтчет(ТабДок, НаряЗадание.Подразделение, Дата);
	
КонецФункции
