
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	СпецификацияСсылка 	= Параметры.СпецификацияСсылка;
	ХранимыйФайлФлэш 	= Параметры.ХранимыйФайл;
	
	Если ХранимыйФайлФлэш = "Раскрой" Тогда
		
		ИмяHTML 			= ЛексСервер.ПолучитьИмяХТМЛ(Справочники.Файлы.РаскройHtml);
		СтрокаДляФлэш 	= Параметры.СтрокаРаскрояЛДСП;

	ИначеЕсли ХранимыйФайлФлэш = "КривойПил" Тогда
		
		ИмяHTML 			= ЛексСервер.ПолучитьИмяХТМЛ(Справочники.Файлы.КривойПилHtml);
		СтрокаДляФлэш 	= Параметры.СтрокаКривогоПила;
		
	ИначеЕсли ХранимыйФайлФлэш = "РаскройСтекла" Тогда
		
		ИмяHTML 			= ЛексСервер.ПолучитьИмяХТМЛ(Справочники.Файлы.РаскройСтеклаHTML);
		СтрокаДляФлэш 	= Параметры.СтрокаРаскрояСтекла;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПредупредитьНаКлиенте() 
	Строка = Новый ФорматированнаяСтрока("Обновите справочник файлов!",,,,"e1cib/command/ОбщаяКоманда.СинхронизацияФайлов");
	Предупреждение(Строка);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	url = ЛексКлиент.ПутьHTML(ИмяHTML);

	Если url <> "" Тогда
		Попытка
			Элементы.ХТМЛ.Документ.url = url;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки;
	Иначе
		ПредупредитьНаКлиенте();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ХТМЛПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Элементы.ХТМЛ.Документ.getElementById("mylink").tag = СтрокаДляФлэш;

КонецПроцедуры
