
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Параметры.Свойство("СпецификацияСсылка") Тогда
		СпецификацияСсылка 	= Параметры.СпецификацияСсылка;
	КонецЕсли;
		
	ХранимыйФайлФлэш = Параметры.ХранимыйФайл;
	РаскройГотов = Ложь;
	
	Если ХранимыйФайлФлэш = "КривойПил" Тогда
		
		ИмяHTML = ЛексСервер.ПолучитьИмяХТМЛ(Справочники.Файлы.КривойПилHtml);
		СтрокаДляФлэш = Параметры.СтрокаКривогоПила;
		
	ИначеЕсли ХранимыйФайлФлэш = "НовыйРаскрой" Тогда
		
		//Параметры.ВидОтображения
		//1 - Сохраняем флэшку в картинку, при проведении спецификации
		//2 - Обычный просмотр флэшки, до проведения
		ИмяHTML = ЛексСервер.ПолучитьИмяХТМЛ(Справочники.Файлы.НовыйРаскройHtml);
		СтрокаДляФлэш = Параметры.ВидОтображения + Параметры.СтрокаНовогоРаскрояЛДСП;
		
		РаскройГотов = Параметры.ВидОтображения = "2";
		
		ЭтаФорма.Ширина = ?(РаскройГотов, 150, 51);
		ЭтаФорма.Высота = ?(РаскройГотов, 60, 15);
		Элементы.ХТМЛ.ТолькоПросмотр = НЕ РаскройГотов;
		
	КонецЕсли;                

КонецПроцедуры

&НаКлиенте
Процедура ПредупредитьНаКлиенте()
	Строка = Новый ФорматированнаяСтрока("Обновите справочник файлов!",,,,"e1cib/command/ОбщаяКоманда.СинхронизацияФайлов");
	Предупреждение(Строка);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	url = ЛексКлиент.ПутьHTML(ИмяHTML);

	Если url <> "" Тогда
		Попытка
			Элементы.ХТМЛ.Документ.url = url;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки;
	Иначе
		ПредупредитьНаКлиенте();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ХТМЛПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ПолученнаяСтрока = Элементы.ХТМЛ.Документ.getElementById("output").tag;
	
	Если Найти(ПолученнаяСтрока, "save") > 0 Тогда
		
		РаскройГотов = Истина;
		Закрыть(ПолученнаяСтрока);
		Возврат;
		
	КонецЕсли;
	
	Роспил = Найти(СтрокаДляФлэш, "%РОСПИЛ%") > 0;
	Лекс = Найти(СтрокаДляФлэш, "%ЛЕКС%") > 0;
	
	РабочийКаталог = ФайловыеФункцииСлужебныйКлиент.ВыбратьПутьККаталогуДанныхПользователя();
	Код = "";
	
	Если Роспил Тогда
		
		Код = "ЛоготипРоспил";
		
	ИначеЕсли Лекс Тогда
		
		Код = "ЛоготипЛекс";
		
	КонецЕсли;
	
	ПутьКИзображению = РабочийКаталог + Код + ".jpg";
	ФайлНаДиске = Новый Файл(ПутьКИзображению);
	
	Если ФайлНаДиске.Существует() Тогда
		
		ПутьЛоготипа = ПутьКИзображению;
		
	Иначе
		
		ПутьЛоготипа = "";
		
	КонецЕсли;
	
	ПутьЛоготипа = ЛексКлиентСервер.ПеревестиСтрокуВКодыСимволов(ПутьЛоготипа);
	
	Если Лекс Тогда
		
		СтрокаДляФлэш = СтрЗаменить(СтрокаДляФлэш, "%ЛЕКС%", ПутьЛоготипа);
		
	ИначеЕсли Роспил Тогда
		
		СтрокаДляФлэш = СтрЗаменить(СтрокаДляФлэш, "%РОСПИЛ%", ПутьЛоготипа);
		
	КонецЕсли;
	
	Элементы.ХТМЛ.Документ.getElementById("input").tag = СтрокаДляФлэш;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)

	Отказ = НЕ РаскройГотов;
	
КонецПроцедуры


//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	// СтандартныеПодсистемы.ВерсионированиеОбъектов
//	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
//	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
//	
//	Если Параметры.Свойство("СпецификацияСсылка") Тогда
//		СпецификацияСсылка = Параметры.СпецификацияСсылка;
//	КонецЕсли;
//		
//	ОпределительФлеш = Параметры.ХранимыйФайл;
//	РаскройГотов = Ложь;
//	
//	Если ОпределительФлеш = "КривойПил" Тогда
//		
//		ИмяHTML = ЛексСервер.ПолучитьИмяХТМЛ(Справочники.Файлы.КривойПилHtml);
//		СтрокаДляФлэш = Параметры.СтрокаКривогоПила;
//		
//	ИначеЕсли ОпределительФлеш = "НовыйРаскрой" Тогда
//		
//		//Параметры.ВидОтображения
//		//1 - Сохраняем флэшку в картинку, при проведении спецификации
//		//2 - Обычный просмотр флэшки, до проведения
//		ИмяHTML = ЛексСервер.ПолучитьИмяХТМЛ(Справочники.Файлы.НовыйРаскройHtml);
//		СтрокаДляФлэш = Параметры.ВидОтображения + Параметры.СтрокаНовогоРаскрояЛДСП;
//		
//		РаскройГотов = Параметры.ВидОтображения = "2";
//		
//		ЭтаФорма.Ширина = ?(РаскройГотов, 150, 51);
//		ЭтаФорма.Высота = ?(РаскройГотов, 60, 15);
//		Элементы.ХТМЛ.ТолькоПросмотр = НЕ РаскройГотов;
//		
//	ИначеЕсли ОпределительФлеш = "Редактор3д" Тогда
//		
//		ИмяHTML = ЛексСервер.ПолучитьИмяХТМЛ(Справочники.Файлы.Редактор3DHtml);
//		
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура ПредупредитьНаКлиенте()
//	Строка = Новый ФорматированнаяСтрока("Обновите справочник файлов!",,,,"e1cib/command/ОбщаяКоманда.СинхронизацияФайлов");
//	Предупреждение(Строка);	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)

//	url = ЛексКлиент.ПутьHTML(ИмяHTML);

//	Если url <> "" Тогда
//		Попытка
//			Элементы.ХТМЛ.Документ.url = url;
//		Исключение
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
//			Отказ = Истина;
//		КонецПопытки;
//	Иначе
//		ПредупредитьНаКлиенте();
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура ХТМЛПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
//	
//	ПолученнаяСтрока = Элементы.ХТМЛ.Документ.getElementById("output").tag;
//	
//	Если ОпределительФлеш = "Редактор3д" Тогда
//		
//		Элементы.ХТМЛ.ТолькоПросмотр = Ложь;
//		Чтение = Новый ЧтениеXML;
//		Чтение.УстановитьСтроку(ПолученнаяСтрока);
//		Чтение.Прочитать();
//		ОбъектХДТО = ФабрикаXDTO.ПрочитатьXML(Чтение);
//		
//		Если ОбъектХДТО.Actions = "Init" Тогда
//		
//			ОбъектХДТО.Param = "New";
//			Запись = Новый ЗаписьXML;
//			Запись.УстановитьСтроку(); 
//			Запись.ЗаписатьОбъявлениеXML();
//			//Запись.ОткрытьФайл("c:\111.xml");
//			ФабрикаXDTO.ЗаписатьXML(Запись, ОбъектХДТО);
//			Стр = Запись.Закрыть();
//			Элементы.ХТМЛ.Документ.getElementById("input").tag = Стр;
//			Элементы.ХТМЛ.Документ.getElementById("input").Click();
//			
//		ИначеЕсли ОбъектХДТО.Actions = "GetMat" Тогда
//			
//			Параметр = ОбъектХДТО.Param;
//			
//			Стр = ПолучитьОбъектХДТО(Параметр);
//			Элементы.ХТМЛ.Документ.getElementById("input").tag = Стр;
//			Элементы.ХТМЛ.Документ.getElementById("input").Click();
//		
//		КонецЕсли;
//			
//	Иначе
//		
//		Если Найти(ПолученнаяСтрока, "save") > 0 Тогда
//			
//			РаскройГотов = Истина;
//			Закрыть(ПолученнаяСтрока);
//			Возврат;
//			
//		КонецЕсли;
//		
//		Роспил = Найти(СтрокаДляФлэш, "%РОСПИЛ%") > 0;
//		Лекс = Найти(СтрокаДляФлэш, "%ЛЕКС%") > 0;
//		
//		РабочийКаталог = ФайловыеФункцииСлужебныйКлиент.ВыбратьПутьККаталогуДанныхПользователя();
//		Код = "";
//		
//		Если Роспил Тогда
//			
//			Код = "ЛоготипРоспил";
//			
//		ИначеЕсли Лекс Тогда
//			
//			Код = "ЛоготипЛекс";
//			
//		КонецЕсли;
//		
//		ПутьКИзображению = РабочийКаталог + Код + ".jpg";
//		ФайлНаДиске = Новый Файл(ПутьКИзображению);
//		
//		Если ФайлНаДиске.Существует() Тогда
//			
//			ПутьЛоготипа = ПутьКИзображению;
//			
//		Иначе
//			
//			ПутьЛоготипа = "";
//			
//		КонецЕсли;
//		
//		ПутьЛоготипа = ЛексКлиентСервер.ПеревестиСтрокуВКодыСимволов(ПутьЛоготипа);
//		
//		Если Лекс Тогда
//			
//			СтрокаДляФлэш = СтрЗаменить(СтрокаДляФлэш, "%ЛЕКС%", ПутьЛоготипа);
//			
//		ИначеЕсли Роспил Тогда
//			
//			СтрокаДляФлэш = СтрЗаменить(СтрокаДляФлэш, "%РОСПИЛ%", ПутьЛоготипа);
//			
//		КонецЕсли;
//		
//		Элементы.ХТМЛ.Документ.getElementById("input").tag = СтрокаДляФлэш;
//		
//	КонецЕсли;

//КонецПроцедуры

//&НаСервере
//Функция ПолучитьОбъектХДТО(Параметр)
//	
//	ТипСписокТегов = ФабрикаXDTO.Тип("m1223asterleks.ru/Flash1C", "TegsList");
//	ТипСписокМатериалов = ФабрикаXDTO.Тип("m1223asterleks.ru/Flash1C", "ItemList");
//	СписокТегов = ФабрикаXDTO.Создать(ТипСписокТегов);
//	СписокМатериалов = ФабрикаXDTO.Создать(ТипСписокМатериалов);
//	
//	Если ЗначениеЗаполнено(Параметр) Тогда
//		
//		ТипЭлементНоменклатуры = ФабрикаXDTO.Тип("m1223asterleks.ru/Flash1C", "ItemType");
//		ТипКоманды = ФабрикаXDTO.Тип("m1223asterleks.ru/Flash1C", "Actions");
//		
//		СписокТегов = ФабрикаXDTO.Создать(ТипСписокТегов);
//		СписокНоменклатуры = ФабрикаXDTO.Создать(ТипСписокМатериалов);
//		
//		НоменклатурныеГруппы = Справочники.НоменклатурныеГруппы;
//		НомГруппа = НоменклатурныеГруппы.ПустаяСсылка();
//		
//		Если Параметр = "ЛДСП" Тогда
//			
//			НомГруппа =  НоменклатурныеГруппы.ЛДСП16;
//			
//		ИначеЕсли Параметр = "Стекло" Тогда
//			
//			НомГруппа =  НоменклатурныеГруппы.Стекло;
//			
//		ИначеЕсли Параметр = "ДВП" Тогда
//			
//			НомГруппа =  НоменклатурныеГруппы.ДВП;
//			
//		КонецЕсли;
//		
//		Запрос = Новый Запрос;
//		Запрос.УстановитьПараметр("НоменклатурнаяГруппа", НомГруппа);
//		Запрос.Текст =
//		"ВЫБРАТЬ
//		|	Номенклатура.Ссылка,
//		|	Номенклатура.Наименование,
//		|	Номенклатура.ГлубинаДетали,
//		|	Номенклатура.ДлинаДетали,
//		|	Номенклатура.ШиринаДетали,
//		|	Номенклатура.Цвет
//		|ИЗ
//		|	Справочник.Номенклатура КАК Номенклатура
//		|ГДЕ
//		|	Номенклатура.НоменклатурнаяГруппа = &НоменклатурнаяГруппа";
//		
//		РезультатЗапроса = Запрос.Выполнить();
//		
//		Выборка = РезультатЗапроса.Выбрать();
//		
//		Команда = ФабрикаXDTO.Создать(ТипКоманды);
//		Команда = "GetMat";
//		
//		Пока Выборка.Следующий() Цикл
//			
//			ЭлементНоменклатуры = ФабрикаXDTO.Создать(ТипЭлементНоменклатуры);
//			ЭлементНоменклатуры.Name = Выборка.Наименование;
//			СтрокаСсылка = Строка(Выборка.Ссылка.УникальныйИдентификатор());
//			ЭлементНоменклатуры.Link = СтрокаСсылка;
//			ЭлементНоменклатуры.DepthDetails = Выборка.ГлубинаДетали;
//			ЭлементНоменклатуры.WidthDetails = Выборка.ШиринаДетали;
//			ЭлементНоменклатуры.LengthDetails = Выборка.ДлинаДетали;
//			Цвет = Строка(Выборка.Цвет);
//			ЭлементНоменклатуры.Color = Цвет;
//			
//			СписокМатериалов.Item.Добавить(ЭлементНоменклатуры);
//			
//		КонецЦикла;
//		
//		СписокТегов.ItemList = СписокМатериалов;
//		СписокТегов.Actions = Команда;
//		
//	Иначе
//		
//		СписокМатериалов.Item.Добавить(СоздатьСписокМатериалов("ЛДСП"));
//		СписокМатериалов.Item.Добавить(СоздатьСписокМатериалов("Стекло"));
//		СписокМатериалов.Item.Добавить(СоздатьСписокМатериалов("ДВП"));
//		
//		СписокТегов.ItemList = СписокМатериалов;
//		СписокТегов.Actions = "GetMat";
//		
//	КонецЕсли;
//		
//		Запись = Новый ЗаписьXML;
//		Запись.УстановитьСтроку(); 
//		Запись.ЗаписатьОбъявлениеXML();
//		ФабрикаXDTO.ЗаписатьXML(Запись, СписокТегов);
//		Стр = Запись.Закрыть();
//		Возврат Стр;
//	
//КонецФункции

//&НаСервере
//Функция СоздатьСписокМатериалов(Материал)
//	
//	ТипЭлементСписка = ФабрикаXDTO.Тип("m1223asterleks.ru/Flash1C", "ItemType");
//	ЭлементСписка = ФабрикаXDTO.Создать(ТипЭлементСписка);
//	ЭлементСписка.Name = Материал;
//	Возврат ЭлементСписка;
//	
//КонецФункции // СоздатьСписокМатериалов()


//&НаКлиенте
//Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)

//	Отказ = НЕ РаскройГотов;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ХТМЛДокументСформирован(Элемент)
//	
//	
//	
//КонецПроцедуры

