
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ТипПечатиДвери = 0;
	
	ОпределительФлеш = "";
	Спецификация = Документы.Спецификация.ПустаяСсылка();
	
	Если Параметры.Свойство("ХранимыйФайл") Тогда
		
		ОпределительФлеш = Параметры.ХранимыйФайл;
		
	КонецЕсли;
	
	РаскройГотов = Ложь;
	
	Если ОпределительФлеш = "КривойПил" Тогда
		
		ИмяHTML = ЛексСервер.ПолучитьИмяХТМЛ(Справочники.Файлы.КривойПилHtml);
		СтрокаДляФлэш = Параметры.СтрокаКривогоПила;
		Спецификация = ?(Параметры.Свойство("Спецификация"), Параметры.Спецификация, Спецификация);
		
	ИначеЕсли ОпределительФлеш = "НовыйРаскрой" Тогда
		
		//Параметры.ВидОтображения
		//1 - Сохраняем флэшку в картинку, при проведении спецификации
		//2 - Обычный просмотр флэшки, до проведения
		
		Спецификация = ?(Параметры.Свойство("Спецификация"), Параметры.Спецификация, Спецификация);
		
		ИмяHTML = ЛексСервер.ПолучитьИмяХТМЛ(Справочники.Файлы.НовыйРаскройHtml);
		СтрокаДляФлэш = Параметры.ВидОтображения + Параметры.СтрокаНовогоРаскрояЛДСП;
		
		РаскройГотов = Параметры.ВидОтображения = "2";
		
		Ширина = ?(РаскройГотов, 150, 51);
		Высота = ?(РаскройГотов, 60, 15);
		Элементы.ХТМЛ.ТолькоПросмотр = НЕ РаскройГотов;
		
	ИначеЕсли ОпределительФлеш = "ЧертежДвери" Тогда
		
		СтруктураМассивовДверей = Новый Структура;
		СтруктураМассивовДверей.Вставить("КартинкиДверей", Новый Массив);
		СтруктураМассивовДверей.Вставить("ФлэшСтроки", Параметры.МассивДверейФлэш);
		
		Если ЗначениеЗаполнено(Параметры.Договор) Тогда
			
			СтруктураМассивовДверей.Вставить("Договор", Параметры.Договор);
			СтруктураМассивовДверей.Вставить("Спецификация", Параметры.Договор.Спецификация);
			ТипПечатиДвери = 1;
			
		Иначе
			
			СтруктураМассивовДверей.Вставить("Договор", "");
			СтруктураМассивовДверей.Вставить("Спецификация", Параметры.Спецификация);
			
		КонецЕсли; 
		
		СтруктураМассивовДверей.Вставить("ДвериСсылки", Параметры.МассивДверейСсылки);
		СтруктураМассивовДверей.Вставить("ТекущаяДверь", Параметры.МассивДверейСсылки.Получить(0));
		СтруктураМассивовДверей.Вставить("КомментарийДвери",Параметры.МассивДверейСсылки[0].Комментарий);
		ИмяHTML = ЛексСервер.ПолучитьИмяХТМЛ(Справочники.Файлы.ДвериHtml);
		СтрокаДляФлэш = Параметры.МассивДверейФлэш.Получить(0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредупредитьНаКлиенте()
	
	Строка = Новый ФорматированнаяСтрока("Обновите справочник файлов!",,,,"e1cib/command/ОбщаяКоманда.СинхронизацияФайлов");
	Предупреждение(Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	url = ЛексКлиент.ПутьHTML(ИмяHTML);
	
	Если url <> "" Тогда
		
		Попытка
			Элементы.ХТМЛ.Документ.url = url;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки;
		
	Иначе
		
		ПредупредитьНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХТМЛПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ОпределительФлеш = "ЧертежДвери" Тогда
		ПолученнаяСтрока = Элементы.ХТМЛ.Документ.getElementById("forw").tag;
	Иначе
		
		ПолученнаяСтрока = Элементы.ХТМЛ.Документ.getElementById("output").tag;
		КоличествоКликов = КоличествоКликов + 1;
		
	КонецЕсли;
	
	Если ОпределительФлеш = "ЧертежДвери" Тогда
		
		Команда = Лев(ПолученнаяСтрока, 4); // код команды, первые 4 символа
		ЗначениеОтФлэш = Прав(ПолученнаяСтрока, СтрДлина(ПолученнаяСтрока) - 5); // полученные значения аргументов от флэш
		ЭлементДляВвода = Элементы.ХТМЛ.Документ.getElementById("back");
		
		Если Команда = "init" Тогда
			
			Просмотр = "0";
			ЭлементДляВвода.tag = "ppic☻"+СтрокаДляФлэш+"☻"+Просмотр+"☻"+ЛексКлиент.ПолучитьЛоготип(СтруктураМассивовДверей.Спецификация);
			ЭлементДляВвода.click();
			
		ИначеЕсли Команда = "prtx" Тогда
			
			Если ТипПечатиДвери = 1 Тогда 
				Примечание = ЛексСервер.УстановитьПримечание();
			Иначе
				Примечание = "%НЕКЛИЕНТУ%" + СтруктураМассивовДверей.КомментарийДвери;
			КонецЕсли;
			
			ЭлементДляВвода.tag = "prtx☻"+ Примечание + "☻" + ТекущаяДата() + Символы.ПС
			+ СтруктураМассивовДверей.Договор + Символы.ПС + СтруктураМассивовДверей.Спецификация
			+ Символы.ПС + СтруктураМассивовДверей.ТекущаяДверь;
			ЭлементДляВвода.click();
			
		ИначеЕсли Команда = "ppic" Тогда
			
			СтруктураМассивовДверей.КартинкиДверей.Добавить(ЗначениеОтФлэш);
			РаскройГотов = Истина;
			Закрыть(СтруктураМассивовДверей.КартинкиДверей);
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Если Найти(ПолученнаяСтрока, "save") > 0 Тогда
			
			РаскройГотов = Истина;
			Закрыть(ПолученнаяСтрока);
			Возврат;
			
		КонецЕсли;
		
		СтрокаДляФлэш = СтрЗаменить(СтрокаДляФлэш, "%ЛОГОТИП%", ЛексКлиент.ПолучитьЛоготип(Спецификация));
		Элементы.ХТМЛ.Документ.getElementById("input").tag = СтрокаДляФлэш;
		
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
//	
// { Васильев Александр Леонидович [27.07.2015]
// Почистил старое от 3Д редактора
// Про эту функцию пока не понятно. Оставлю на всякий случай.
// } Васильев Александр Леонидович [27.07.2015]
//	
//	Элементы.ХТМЛ.Документ.getElementById("input").tag = СтрокаДляФлэш;
//	Элементы.ХТМЛ.Документ.getElementById("input").Click();
//	
//КонецПроцедуры

