
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка 		= Ложь;
	СхемаКомпоновкиДанных 	= ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки 							= СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 				= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	НастройкаДаты = КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.Элементы[0].Значение;
	
	Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Подразделение", );
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческийОстатки.Субконто2 КАК Договор,
	|	ВЫБОР
	|		КОГДА УправленческийОстатки.СуммаОстаток <= 0
	|			ТОГДА УправленческийОстатки.Субконто2.СуммаДокумента + УправленческийОстатки.СуммаОстаток
	|		ИНАЧЕ УправленческийОстатки.СуммаОстаток
	|	КОНЕЦ КАК Остаток
	|ПОМЕСТИТЬ СписокДоговоров
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Остатки(, Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ВзаиморасчетыСПокупателями), , ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Документ.Договор)) КАК УправленческийОстатки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА УправленческийОстатки.СуммаОстаток <= 0
	|				ТОГДА УправленческийОстатки.Субконто2.СуммаДокумента + УправленческийОстатки.СуммаОстаток
	|			ИНАЧЕ УправленческийОстатки.СуммаОстаток
	|		КОНЕЦ > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорРассрочка.Ссылка.Ссылка КАК Договор,
	|	ДоговорРассрочка.Ссылка.Автор КАК Автор,
	|	ДоговорРассрочка.Ссылка.СуммаДокумента КАК СуммаДоговора,
	|	ДоговорРассрочка.Ссылка.Комментарий КАК Комментарий,
	|	ДоговорРассрочка.Ссылка.Подразделение
	|ИЗ
	|	Документ.Договор.Рассрочка КАК ДоговорРассрочка
	|ГДЕ
	|	ДоговорРассрочка.Дата < &ТекущаяДата
	|	И ДоговорРассрочка.Ссылка В
	|			(ВЫБРАТЬ
	|				СписокДоговоров.Договор
	|			ИЗ
	|				СписокДоговоров КАК СписокДоговоров)";
	
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(НастройкаДаты.Дата));
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Колонки.Добавить("СуммаПени");
	ТЗ.Колонки.Добавить("СуммаПросрочки");	
	ТЗ.Колонки.Добавить("ДнейПросрочки");
	ТЗ.Колонки.Добавить("ПервыйПросроченныйПлатеж");
	
	Количество = ТЗ.Количество();
	
	Если Количество > 0 Тогда
		
		Для Счетчик = 1 По Количество Цикл
			
			Элемент = ТЗ[Количество - Счетчик];
			
			ПросрочкаПеня 									= Документы.Договор.РасчетПени(Элемент.Договор, НастройкаДаты.Дата);
			Элемент.СуммаПени 							= ПросрочкаПеня.СуммаПени;
			Элемент.СуммаПросрочки 					= ПросрочкаПеня.СуммаПросрочки;
			Элемент.ДнейПросрочки 						= ПросрочкаПеня.ДнейПросрочки;
			Элемент.ПервыйПросроченныйПлатеж 	= ПросрочкаПеня.ДатаПервыйПлатеж;
			
			Если (Число(Элемент.СуммаПросрочки) <= 0 И Число(Элемент.СуммаПени) = 0) Тогда
				
				ТЗ.Удалить(Элемент);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

