
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = ПолучитьПараметрыФормы(ПараметрКоманды); 	
	Если ПараметрыФормы.ЕстьМонтаж Тогда
		Оповещение = Новый ОписаниеОповещения("ИзменитьМонтаж", ЭтотОбъект, ПараметрКоманды);
		ОткрытьФорму("Документ.Спецификация.Форма.ФормаВыбораМонтажника", ПараметрыФормы, , , , , Оповещение);
	Иначе
		Сообщить("Нет монтажа " + ПараметрКоманды);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ИзменитьМонтаж(ВыбранныйМонтаж, Спецификация)
	ИзменитьМонтажНаСервере(ВыбранныйМонтаж, Спецификация);
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормы(Спецификация)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЕстьМонтаж", Спецификация.ПакетУслуг = Перечисления.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж);
	ПараметрыФормы.Вставить("НачалоПериода", Спецификация.Дата);
	ПараметрыФормы.Вставить("КонецПериода", Спецификация.Дата + 30 * 86400);
	ПараметрыФормы.Вставить("Офис", Спецификация.Офис);
	ПараметрыФормы.Вставить("Монтажник", Спецификация.Монтажник);
	ПараметрыФормы.Вставить("ДатаМонтажа", Спецификация.ДатаМонтажа);

	Возврат ПараметрыФормы;

КонецФункции

	
&НаСервере
Процедура ИзменитьМонтажНаСервере(ВыбранныйМонтаж, Спецификация) Экспорт	
	
	Если ЗначениеЗаполнено(ВыбранныйМонтаж) Тогда
		//Если ДеньНедели(ВыбранныйМонтаж.ДатаМонтажа) > 1 Тогда
		//	МинусДней = 1;
		//Иначе
		//	МинусДней = 2;
		//КонецЕсли;
		//ВыбранныйМонтаж.Вставить("ДатаОтгрузки", ВыбранныйМонтаж.ДатаМонтажа - МинусДней * 86400);

		Объект = Спецификация.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Объект, ВыбранныйМонтаж);
		Если Объект.Проведен Тогда
			Объект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			Объект.Записать();
		КонецЕсли
		
	КонецЕсли;	

КонецПроцедуры