
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Спецификация", ПараметрКоманды);
	ЕстьМонтаж = ОпределитьМонтаж(ПараметрКоманды);
	Если ЕстьМонтаж Тогда
		ОткрытьФорму("Документ.Спецификация.Форма.ФормаВыбораМонтажника", ПараметрыФормы);
	Иначе
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Нет монтажа %1", ПараметрКоманды); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьМонтаж(Спецификация)
	ЕстьМонтаж = Спецификация.ПакетУслуг = Перечисления.ПакетыУслуг.ДоставкаДоКлиентаИМонтаж;
	Возврат ЕстьМонтаж;
КонецФункции