
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВыбранныйМонтажник = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаВыбораМонтажника", ПолучитьПараметрыФормы(ПараметрКоманды));
	ИзменитьМонтаж(ПараметрКоманды, ВыбранныйМонтажник);

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормы(Спецификация)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НачалоПериода", Спецификация.Дата);
	ПараметрыФормы.Вставить("КонецПериода", Спецификация.Дата + 30 * 86400);
	ПараметрыФормы.Вставить("Офис", Спецификация.Офис);
	ПараметрыФормы.Вставить("Монтажник", Спецификация.Монтажник);
	ПараметрыФормы.Вставить("ДатаМонтажа", Спецификация.ДатаМонтажа);
	
	Возврат ПараметрыФормы;

КонецФункции

	
&НаСервере
Процедура ИзменитьМонтаж(Спецификация, ВыбранныйМонтажник)	
	
	Если ЗначениеЗаполнено(ВыбранныйМонтажник) Тогда
		//Если ДеньНедели(ВыбранныйМонтажник.ДатаМонтажа) > 1 Тогда
		//	МинусДней = 1;
		//Иначе
		//	МинусДней = 2;
		//КонецЕсли;
		//ВыбранныйМонтажник.Вставить("ДатаОтгрузки", ВыбранныйМонтажник.ДатаМонтажа - МинусДней * 86400);

		Объект = Спецификация.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Объект, ВыбранныйМонтажник);
		Если Объект.Проведен Тогда
			Объект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			Объект.Записать();
		КонецЕсли
		
	КонецЕсли;	

КонецПроцедуры