////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контактная информация"
// 
////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Разбирает представление контактной информации и возвращает строку XML со значениями полей
//
//  Параметры:
//      Текст        - строка XML
//      ОжидаемыйТип - ссылка на вид КИ или перечисление типа КИ для контроля типов
//
Функция ПарсингКонтактнойИнформацииXML(Текст, ОжидаемыйВид) Экспорт
	Возврат КонтактнаяИнформацияСлужебный.ПарсингКонтактнойИнформацииXML(Текст, ОжидаемыйВид);
КонецФункции    

//  Возвращает представление контактной информации, хранящееся внутри XML.
//
//  Параметры:
//      Текст - XML строка контактной информации
//
Функция ПредставлениеКонтактнойИнформацииXML(Текст) Экспорт
	Возврат КонтактнаяИнформацияСлужебный.ПредставлениеКонтактнойИнформации(Текст);
КонецФункции                                                  

//  Возвращает или устанавливает комментарий для контактной информации
//
//  Параметры:
//      Текст         - XML строка контактной информации. Строка может измениться.
//      НовоеЗначение - необязательный устанавливаемый новый комментарий. Если параметр не указан,
//                      то значение параметра "Текст" не меняется, иначе он принимает значение XML,
//                      соответствующее сериализованной КИ с новым комментарием
//  Возвращаемое значение:
//      Комментарий, хранящийся внутри XML. Возможно обновленный после установки из параметра "НовоеЗначение"
//
Функция КомментарийКонтактнойИнформацииXML(Текст, НовоеЗначение=Неопределено) Экспорт
	Возврат КонтактнаяИнформацияСлужебный.КомментарийКонтактнойИнформации(Текст, НовоеЗначение);
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

//  Возвращает значение перечисления типа соответствующего переданному виду КИ
//
//  Параметры:
//      ВидИнформации - ссылка на справочник ВидыКонтактнойИнформации 
//
Функция ТипВидаКонтактнойИнформации(ВидИнформации) Экспорт
	Возврат ВидИнформации.Тип;
КонецФункции
