
&НаСервереБезКонтекста
Функция ПолучитьСуммуСпецификации(Спецификация)

	Возврат Спецификация.СуммаДокумента;

КонецФункции 

&НаКлиенте
Процедура СпецификацияПриИзменении(Элемент)
	
	Объект.СуммаДокумента = ПолучитьСуммуСпецификации(Объект.Спецификация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ИзменениеДоговора.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);
	ПлатежиДоговора.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменениеДоговора.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);
	ПлатежиДоговора.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)
	
	Объект.СуммаДокумента = Объект.СуммаДокумента - Объект.СуммаДокумента * Скидка / 100;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ИзменениеДоговора.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);
	ПлатежиДоговора.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);
	                          
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДоговораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежиДоговораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры
