
&НаСервереБезКонтекста
Функция ПолучитьСуммуСпецификации(Спецификация)
	
	// { Васильев Александр Леонидович [01.09.2014]
	// Аяйяй, а как же ЗначениеРеквизитаОбъекта? :)
	// } Васильев Александр Леонидович [01.09.2014]
	
	Возврат Спецификация.СуммаДокумента;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьСуммуДоговора()
	
	Объект.СуммаДокумента = Объект.СуммаДокумента - Объект.СуммаДокумента * Скидка / 100;
	
КонецПроцедуры

&НаКлиенте
Процедура СпецификацияПриИзменении(Элемент)
	
	Объект.СуммаДокумента = ПолучитьСуммуСпецификации(Объект.Спецификация);
	ПолучитьСуммуДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьПараметрыЗапросов(Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыЗапросов(Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)
	
	ПолучитьСуммуДоговора();
	ПересчитатьРассрочку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	УстановитьПараметрыЗапросов(Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДоговораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежиДоговораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьПараметрыЗапросов(СсылкаНаДоговор, КонтекстФормы)
	
	КонтекстФормы.ИзменениеДоговора.Параметры.УстановитьЗначениеПараметра("Договор", СсылкаНаДоговор);
	КонтекстФормы.ПлатежиДоговора.Параметры.УстановитьЗначениеПараметра("Договор", СсылкаНаДоговор);
	
КонецФункции

&НаКлиенте
Процедура МесяцевРассрочкиПриИзменении(Элемент)
	
	ПересчитатьРассрочку();
	
КонецПроцедуры

&НаКлиенте
Функция ПересчитатьРассрочку()
	
	// { Васильев Александр Леонидович [01.09.2014]
	// Объединить с договором
	// } Васильев Александр Леонидович [01.09.2014]
	
	Объект.Рассрочка.Очистить();
	Если Объект.МесяцевРассрочки = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДатаРассрочки = Объект.Дата;
	НужноРаспределить = Объект.СуммаДокумента;
	ОсталосьРаспределить = НужноРаспределить;
	
	Для ы = 1 По Объект.МесяцевРассрочки Цикл
		
		ДатаРассрочки = ДобавитьМесяц(ДатаРассрочки, 1);
		
		Если ы = Объект.МесяцевРассрочки Тогда
			
			СуммаРаспределения = ОсталосьРаспределить;
			
		Иначе
			
			ПредполагаемаяСумма = Окр(НужноРаспределить / Объект.МесяцевРассрочки, -2);
			СуммаРаспределения = Мин(ПредполагаемаяСумма, ОсталосьРаспределить);
			
		КонецЕсли;
		
		ОсталосьРаспределить = ОсталосьРаспределить - СуммаРаспределения;
		НоваяСтрока = Объект.Рассрочка.Добавить();
		НоваяСтрока.Дата = ДатаРассрочки;
		НоваяСтрока.Сумма = СуммаРаспределения;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	ПересчитатьРассрочку();
	
КонецПроцедуры