
&НаСервереБезКонтекста
Функция ПолучитьСуммуСпецификации(Спецификация)

	Возврат Спецификация.СуммаДокумента;

КонецФункции 

&НаКлиенте
Процедура СпецификацияПриИзменении(Элемент)
	
	Объект.СуммаДокумента = ПолучитьСуммуСпецификации(Объект.Спецификация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ИзменениеДоговора.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);
	ПлатежиДоговора.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменениеДоговора.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);
	ПлатежиДоговора.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);
	
КонецПроцедуры
