////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контроль динамического обновления конфигурации"
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Обработчик события ПриНачалеРаботыСистемы вызывается
// для выполнения действий, требуемых для подсистемы 
// "Контроль динамического обновления конфигурации".
//
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	Обрабатывать = Ложь;
	
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		Обрабатывать = Истина;
	Иначе
		Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
		Обрабатывать = НЕ ЛексСервер.ПолучитьДоступностьРолиДляНеполноправногоПользователя("ПечатьЭтикеток", Пользователь);
	КонецЕсли;
	
	Если Обрабатывать Тогда
	 	ПодключитьОбработчикОжидания("ОбработчикОжиданияПроверкиДинамическогоИзмененияИБ", 20 * 60); // раз в 20 минут
	КонецЕсли;
	
КонецПроцедуры
