
&НаКлиенте
Процедура ЛинейкаВерхНизФормулаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьРедакторФормул(Элемент.ТекстРедактирования, Элемент);	
КонецПроцедуры

&НаКлиенте
Процедура ЛинейкаЛевоПравоФормулаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьРедакторФормул(Элемент.ТекстРедактирования, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторФормул(Формула, Элемент)
	
	ПараметрыФормы = Новый Структура("Формула, ИмяПеременной, Режим", Формула, Элемент.Имя, "Присадки");
	Форма = ПолучитьФорму("ОбщаяФорма.РедакторФормул", ПараметрыФормы, Элемент);
	Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	Форма.Открыть();
	
КонецПроцедуры


&НаКлиенте
Процедура СверлоЛевоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьРедакторФормул(Элемент.ТекстРедактирования, Элемент);
КонецПроцедуры


&НаКлиенте
Процедура СверлоПравоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьРедакторФормул(Элемент.ТекстРедактирования, Элемент);
КонецПроцедуры

