////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	АдресныйКлассификатор.ПолучитьПараметрыАутентификации(КодПользователя, Пароль);
	ЗапомнитьПароль = ? (ПустаяСтрока(Пароль), Ложь, Истина);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ПерейтиКРегистрацииНаСайтеНажатие(Элемент)
	ЗапуститьПриложение("http://users.v8.1c.ru/");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия на кнопку "Продолжить"
//
// Параметр закрытия формы: Неопределено - пользователь отказался от ввода пароля
//							Структура  - 
//							            ключ "Статус", булево - истина или ложь в зависмости от успеха вызова
//							            ключ "КодПользователя", строка - в случае если статус Истина содержит
//							                                    код пользователя
//							            ключ "Пароль", строка - в случае если статус Истина содержит пароль
&НаКлиенте
Процедура СохранитьДанныеАутентификацииИПродолжитьВыполнить()
	
	СохранитьДанныеАутентификацииИПродолжитьВыполнитьНаСервере();
	Закрыть(Новый Структура("Статус, КодПользователя ,Пароль", Истина, КодПользователя, Пароль));
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура СохранитьДанныеАутентификацииИПродолжитьВыполнитьНаСервере()
	
	АдресныйКлассификатор.СохранитьПараметрыАутентификации(КодПользователя, ?(ЗапомнитьПароль, Пароль, Неопределено));
	
КонецПроцедуры


