
&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("АдресТаблицы", ПолучитьАдресТаблицы(ТаблицаВыбранных));
	
	ОповеститьОВыборе(Структура);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресТаблицы(Знач фТаблица)
	
	Возврат ПоместитьВоВременноеХранилище(фТаблица.Выгрузить());;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Подразделение = Параметры.Подразделение;
	УстановитьПараметрыЗапроса(Остатки, Подразделение);
	ТаблицаВыбранных.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресТаблицы));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьПараметрыЗапроса(ДинамическийСписок, фПодразделение)
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Подразделение", фПодразделение);
	
КонецФункции

&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Остатки.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ДобавитьВыбранныйОбрезок(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьВыбранныйОбрезок(Строка)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура");
	Отбор.Вставить("Ширина");
	Отбор.Вставить("Высота");
	
	ЗаполнитьЗначенияСвойств(Отбор, Строка);
	
	НайденныеСтроки = ТаблицаВыбранных.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаРедактирования = ТаблицаВыбранных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРедактирования, Строка);
	Иначе
		СтрокаРедактирования = НайденныеСтроки[0];
	КонецЕсли;
	
	СтрокаРедактирования.Количество = СтрокаРедактирования.Количество + 1;
	
КонецФункции
