
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаголовокФормы") Тогда 
		Заголовок = Параметры.ЗаголовокФормы;
	КонецЕсли;
	
	Если Параметры.Свойство("ВладелецФайла") Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("Владелец", Параметры.ВладелецФайла);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Просмотр(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;	
	ЛексКлиент.ОткрытьФайл(ТекДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ВладелецФайла = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Владелец"));
	ВладелецФайла = ВладелецФайла.Значение;

	СоздатьФайл(ВладелецФайла);
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФайл(ВладелецФайла)
	
	РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
	
	Если НЕ РасширениеПодключено Тогда
		Возврат;	
	КонецЕсли;
		
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.Заголовок = НСтр("ru = 'Выбор файла'");
	ВыборФайла.Фильтр = НСтр("ru = 'Все файлы (*.*)|*.*'");
	
	Результат = ВыборФайла.Выбрать();
	ПолноеИмяФайла = ВыборФайла.ПолноеИмяФайла;

	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ПолноеИмяФайла);

	ВремяСоздания = ТекущаяДата();
	ИмяСоздания = Файл.ИмяБезРасширения;
	ИмяФайла = ИмяСоздания + Файл.Расширение;
	Расширение = Файл.Расширение;
	Пиктограмма = ФайловыеФункцииСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(Файл.Расширение);
	
	РазмерВКб = Файл.Размер() / 1024;
	Если РазмерВКб < 1 Тогда
		РазмерВКб = 1;	
	КонецЕсли;
	
	ПомещаемыеФайлы = Новый Массив;
	Описание = Новый ОписаниеПередаваемогоФайла(Файл.ПолноеИмя, "");
	ПомещаемыеФайлы.Добавить(Описание);

	ПомещенныеФайлы = Новый Массив;

	Если НЕ ПоместитьФайлы(ПомещаемыеФайлы,ПомещенныеФайлы,,Ложь,ЭтаФорма.УникальныйИдентификатор) Тогда

		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка при помещении файла ""%1"" во временное хранилище.'"),Файл.ПолноеИмя);
		
	КонецЕсли;
		
	Если ПомещенныеФайлы.Количество() = 1 Тогда
		АдресВременногоХранилищаФайла = ПомещенныеФайлы[0].Хранение;
	КонецЕсли;
	
	СтруктураФайла = Новый Структура();
	СтруктураФайла.Вставить("ВладелецФайла",ВладелецФайла);
	СтруктураФайла.Вставить("Наименование",ИмяСоздания);
	СтруктураФайла.Вставить("АдресВременногоХранилищаФайла",АдресВременногоХранилищаФайла);
	СтруктураФайла.Вставить("Дата",ТекущаяДата());
	СтруктураФайла.Вставить("Автор",ПользователиКлиентСервер.ТекущийПользователь());
	СтруктураФайла.Вставить("Размер",РазмерВКб);
	СтруктураФайла.Вставить("Расширение", Расширение);
	СтруктураФайла.Вставить("Пиктограмма", Пиктограмма);
	
	НовыйФайл = ЛексСервер.СоздатьФайл(СтруктураФайла);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", НовыйФайл);

	ОткрытьФорму("Справочник.ФайлыЛекс.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
				
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	ЛексКлиент.ОткрытьФайл(ТекДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры
