
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура=Параметры.Номенклатура;
	Подразделение=Параметры.Подразделение;
	
КонецПроцедуры

&НаСервере
Функция СформироватьТабличныйДокумент()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДок.Защита = Истина;
	
	Макет = Отчеты.КонтрольНоменклатуры.ПолучитьМакет("МакетИсторияЦены");
	
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОблЗаголовок.Параметры.Подразделение = Подразделение;
	ОблЗаголовок.Параметры.Номенклатура = Номенклатура;

	ТабДок.Вывести(ОблЗаголовок);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиНоменклатуры.Период КАК Период,
	|	НастройкиНоменклатуры.Регистратор КАК Документ,
	|	НастройкиНоменклатуры.Регистратор.Автор КАК Автор,
	|	НастройкиНоменклатуры.ПлановаяЗакупочная КАК Закупочная,
	|	НастройкиНоменклатуры.Розничная КАК Розничная
	|ИЗ
	|	РегистрСведений.НастройкиНоменклатуры КАК НастройкиНоменклатуры
	|ГДЕ
	|	НастройкиНоменклатуры.Подразделение = &Подразделение
	|	И НастройкиНоменклатуры.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ТабДок.Вывести(ОблШапка);
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			 ОблСтрока.Параметры.Заполнить(Выборка);
			 ТабДок.Вывести(ОблСтрока);
			 
		КонецЦикла;
		
	КонецЕсли;

	Возврат ТабДок;	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТабличныйДокумент = СформироватьТабличныйДокумент();
КонецПроцедуры


