
Функция ПолучитьСтруктуруПодставляемойНоменклатурыПоЦветуЛДСП(Номенклатура, Подразделение) Экспорт
	
	Возврат РегистрыСведений.СоответствиеНоменклатуры.ПолучитьСтруктуруСоответствий(Номенклатура, Подразделение);
	
КонецФункции // ПолучитьСтруктуруПодставляемойНоменклатурыПоЦветуЛДСП()

Функция ПолучитьСтруктуруПодставляемойНоменклатурыПоЦветуПоГруппе(Номенклатура, НоменклатурнаяГруппа, Подразделение) Экспорт
	
	Возврат РегистрыСведений.СоответствиеНоменклатуры.ПолучитьСоответствие(Номенклатура, НоменклатурнаяГруппа, Подразделение);
	
КонецФункции // ПолучитьСтруктуруПодставляемойНоменклатурыПоЦветуПоГруппе()

Функция ОбновитьДоступностьЭлементов(фнЭлементы, ВидОперации) Экспорт
	
	СчетаДоступны = ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПрочийПриход")
	ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПрочийРасход");
	
	фнЭлементы.СчетДт.Доступность =СчетаДоступны;
	фнЭлементы.СчетКт.Доступность = СчетаДоступны;
	
	СтатьиДДСДоступны = ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОтПодотчетногоЛица")
	И ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыдачаПодотчетномуЛицу");
	
	фнЭлементы.Субконто1Дт.Доступность = СтатьиДДСДоступны;
	фнЭлементы.Субконто1Кт.Доступность = СтатьиДДСДоступны;
	
КонецФункции

Процедура ЗаполнитьТипыСубконто(фнЭлементы, ВидСчета, фнОбъект) Экспорт
	
	ЗаголовкиСубконто = Новый Структура;
	ЗаголовкиСубконто.Вставить("Субконто1", Ложь);
	ЗаголовкиСубконто.Вставить("Субконто2", Ложь);
	ЗаголовкиСубконто.Вставить("Субконто3", Ложь);
	
	Субконто = фнОбъект["Счет" + ВидСчета].ВидыСубконто;
	Для Каждого Стр Из Субконто Цикл
		ИмяСубконто = "Субконто" + Стр.НомерСтроки + ВидСчета;
		фнОбъект[ИмяСубконто] = Стр.ВидСубконто.ТипЗначения.ПривестиЗначение(фнОбъект[ИмяСубконто]);
		фнЭлементы[ИмяСубконто].Заголовок = Стр.ВидСубконто.Наименование;
		ЗаголовкиСубконто["Субконто" + Стр.НомерСтроки] = Истина;
	КонецЦикла;
	
	фнЭлементы["Субконто1" + ВидСчета].Видимость = ЗаголовкиСубконто["Субконто1"];
	фнЭлементы["Субконто2" + ВидСчета].Видимость = ЗаголовкиСубконто["Субконто2"];
	фнЭлементы["Субконто3" + ВидСчета].Видимость = ЗаголовкиСубконто["Субконто3"];
	
КонецПроцедуры