
&НаКлиенте
Процедура ПодразделениеПолучательПриИзменении(Элемент)
	
	Если Строка(Объект.ПодразделениеПолучатель) = "Управление" Тогда
		Если Вопрос("Хотите сдать прибыль в Управление?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Объект.ПередачаПрибыли = Истина;
		КонецЕсли;
	Иначе
			Объект.ПередачаПрибыли = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//ПодпискиНаСобытия.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ДенежныеСредстваОстатки.СуммаОстаток
	//|ИЗ
	//|	РегистрНакопления.ДенежныеСредства.Остатки(&МоментВремени, Счет = &Счет) КАК ДенежныеСредстваОстатки
	//|ГДЕ
	//|	ДенежныеСредстваОстатки.СуммаОстаток < 0";
	//Запрос.УстановитьПараметр("МоментВремени", Новый Граница(Объект.Дата, ВидГраницы.Включая));
	//Запрос.УстановитьПараметр("Счет", Объект.Счет);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	
	//	//Отказ = Истина;
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("На счете %1 недостаточно денежных средств. Из требуемых %2 есть всего %3", Объект.Счет, Объект.Сумма, Выборка.СуммаОстаток + Объект.Сумма);
	//	Сообщение.Поле = "Сумма";
	//	Сообщение.УстановитьДанные(Объект);
	//	Сообщение.Сообщить(); 
	//
	//КонецЕсли;
	
КонецПроцедуры


