
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктОбОказанныхУслугах") Тогда
		ПодготовитьПечатнуюФорму("АктОбОказанныхУслугах", "Акт об оказанных услугах", "Документ.СлужебнаяЗаписка.АктОбОказанныхУслугах",
		МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	Если НужноПечататьМакет Тогда
		
		Если ИмяМакета = "АктОбОказанныхУслугах" Тогда
			ТабДок = ПечатьАктОбОказанныхУслугах(МассивОбъектов, ОбъектыПечати);
		КонецЕсли;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьАктОбОказанныхУслугах(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_АктОбОказанныхУслугах";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СлужебнаяЗаписка.Ссылка,
	|	СлужебнаяЗаписка.ВерсияДанных,
	|	СлужебнаяЗаписка.ПометкаУдаления,
	|	СлужебнаяЗаписка.Номер,
	|	СлужебнаяЗаписка.Дата,
	|	СлужебнаяЗаписка.Проведен,
	|	СлужебнаяЗаписка.Автор,
	|	СлужебнаяЗаписка.Адресат,
	|	СлужебнаяЗаписка.ВидСлужебнойЗаписки,
	|	СлужебнаяЗаписка.Документ,
	|	СлужебнаяЗаписка.Ознакомлен,
	|	СлужебнаяЗаписка.Проблема,
	|	СлужебнаяЗаписка.Тема,
	|	ВЫРАЗИТЬ(СлужебнаяЗаписка.Документ КАК Документ.Договор).Контрагент КАК Заказчик,
	|	СлужебнаяЗаписка.Документ.Контрагент.Фамилия + "" "" + ПОДСТРОКА(СлужебнаяЗаписка.Документ.Контрагент.Имя, 1, 1) + "". "" + ПОДСТРОКА(СлужебнаяЗаписка.Документ.Контрагент.Отчество, 1, 1) + ""."" КАК ФИО
	|ИЗ
	|	Документ.СлужебнаяЗаписка КАК СлужебнаяЗаписка
	|ГДЕ
	|	СлужебнаяЗаписка.Ссылка В(&МассивОбъектов)";
	
	Макет = Документы.СлужебнаяЗаписка.ПолучитьМакет("АктОбОказанныхУслугах");
	Тело = Макет.ПолучитьОбласть("Тело");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Тело.Параметры.Заполнить(Выборка);
			
		ТабДок.Вывести(Тело);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 1, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции