
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если СтатусСлужебнойЗаписки = Перечисления.СтатусыСлужебныхЗаписок.Ознакомлен 
		И ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.Поручение Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Статус не подходит для данного вида Служебной записки");
	ИначеЕсли СтатусСлужебнойЗаписки = Перечисления.СтатусыСлужебныхЗаписок.СлужебнаяПроверка 
		И (ВидСлужебнойЗаписки <> Перечисления.ВидыСлужебнойЗаписки.НарушениеСроков
		И ВидСлужебнойЗаписки <> Перечисления.ВидыСлужебнойЗаписки.НарушенияВРаботе) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Статус не подходит для данного вида Служебной записки");
	ИначеЕсли СтатусСлужебнойЗаписки = Перечисления.СтатусыСлужебныхЗаписок.Исполнение 
		И ВидСлужебнойЗаписки <> Перечисления.ВидыСлужебнойЗаписки.Поручение Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Статус не подходит для данного вида Служебной записки");
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Если ВидСлужебнойЗаписки <> Перечисления.ВидыСлужебнойЗаписки.Поручение Тогда 
			ДатаКонтроля = Дата + 4 * 86400;
			Если  (ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.НарушениеСроков
				ИЛИ  ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.НарушенияВРаботе)
				И СтатусСлужебнойЗаписки = Перечисления.СтатусыСлужебныхЗаписок.СлужебнаяПроверка Тогда
				ДатаКонтроля = Дата + 5 * 86400;
			КонецЕсли;
		КонецЕсли;
				
		Если ДеньНедели(Дата) >= 5 Тогда
			ДатаКонтроля = ДатаКонтроля + 86400;
		КонецЕсли;
		ДатаКонтроля = КонецДня(ДатаКонтроля);
		
		Если НЕ Проведен И (СтатусСлужебнойЗаписки = Перечисления.СтатусыСлужебныхЗаписок.Ознакомлен 
			ИЛИ СтатусСлужебнойЗаписки = Перечисления.СтатусыСлужебныхЗаписок.Выполнена) Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Если ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.НарушенияВРаботе Тогда
		Движение = Движения.ОшибкиСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Виновный;
		Движение.Количество = 1;
	КонецЕсли;
	
	Движения.ОшибкиСотрудников.Записывать = Истина;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Документ = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.НарушенияВРаботе Тогда
		ПроверяемыеРеквизиты.Добавить("Виновный");
	КонецЕсли;
	
	Если СтатусСлужебнойЗаписки = Перечисления.СтатусыСлужебныхЗаписок.Исполнение Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаКонтроля");
	КонецЕсли;
	
КонецПроцедуры
