
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	ПользовательАдминистратор = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Администратор);
	
	СменаДаты = ПользовательАдминистратор;
	НашаДата = ТекущаяДата();
	
	Если НЕ ЗначениеЗаполнено(ДатаВАрхив) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ДатаВАрхив = ТекущаяДата();
		
	КонецЕсли;
	
	УстановитьДилера();
	
	ПодпискиНаСобытия.ПередЗаписьюДокументаИлиСправочника(ЭтотОбъект);
	
КонецПроцедуры

Функция УстановитьДилера()
	
	Если НЕ ЗначениеЗаполнено(Дилер) Тогда
		
		фнДилер = Неопределено;
		
		Если ТипЗнч(Адресат) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
			фнДилер = Адресат;
		ИначеЕсли ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
			фнДилер = ПользователиКлиентСервер.ТекущийПользователь();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(фнДилер) Тогда
			Дилер = фнДилер;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.НарушенияВРаботе Тогда
		Движение = Движения.ОшибкиСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Адресат.ФизическоеЛицо;
		Движение.Количество = 1;
	КонецЕсли;
	
	Движения.ОшибкиСотрудников.Записывать = Истина;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		Документ = ДанныеЗаполнения.Ссылка;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
			И ДанныеЗаполнения.Свойство("Текст") Тогда
				Проблема = ДанныеЗаполнения.Текст;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		
		Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
		Контрагент = Пользователь.ОбъектАвторизации;
		
		Супервайзер = Справочники.Пользователи.НайтиПоРеквизиту("ФизическоеЛицо", Контрагент.Супервайзер);
		Адресат = Супервайзер;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ДатаВАрхив = Дата(1, 1, 1);
	
КонецПроцедуры
