
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Дата = ТекущаяДата();
	//ДатаКонтроля = Дата + 172800;
	//Если ДеньНедели(Дата) >= 5 Тогда
	//	ДатаКонтроля = ДатаКонтроля + 86400;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Если ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.ТехническаяОшибка Тогда
		Движение = Движения.ОшибкиСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Виновный;
		Движение.Количество = 1;
	КонецЕсли;
	
	Движения.ОшибкиСотрудников.Записывать = Истина;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Документ = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.ТехническаяОшибка Тогда
		ПроверяемыеРеквизиты.Добавить("Виновный");
	КонецЕсли;
	
КонецПроцедуры
