
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ВидСлужебнойЗаписки <> Перечисления.ВидыСлужебнойЗаписки.Поручение Тогда 
		ДатаКонтроля = Дата + 2 * 86400;
	КонецЕсли;
	
	Если ДеньНедели(Дата) >= 5 Тогда
		ДатаКонтроля = ДатаКонтроля + 86400;
	КонецЕсли;
	ДатаКонтроля = КонецДня(ДатаКонтроля);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Если ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.НарушенияВРаботе Тогда
		Движение = Движения.ОшибкиСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Виновный;
		Движение.Количество = 1;
	КонецЕсли;
	
	Движения.ОшибкиСотрудников.Записывать = Истина;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Документ = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.НарушенияВРаботе Тогда
		
		ПроверяемыеРеквизиты.Добавить("Виновный");
		
	ИначеЕсли ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.Поручение Тогда
		
		ПроверяемыеРеквизиты.Добавить("ДатаКонтроля");	
		
	КонецЕсли;
	
КонецПроцедуры
