
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	УстановитьДилера();
	
КонецПроцедуры

Функция УстановитьДилера()
	
	Если НЕ ЗначениеЗаполнено(Дилер) Тогда
		
		фнДилер = Неопределено;
		
		Если ТипЗнч(Адресат) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
			фнДилер = Адресат;
		ИначеЕсли ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
			фнДилер = ПользователиКлиентСервер.АвторизованныйПользователь();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(фнДилер) Тогда
			Дилер = фнДилер;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.НарушенияВРаботе 
		И ТипЗнч(Адресат) = Тип("СправочникСсылка.Пользователи") Тогда
		Движение = Движения.ОшибкиСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Адресат.ФизическоеЛицо;
		Движение.Количество = 1;
	КонецЕсли;
	
	Движения.ОшибкиСотрудников.Записывать = Истина;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			
			Если ДанныеЗаполнения.Свойство("Текст") Тогда
				Проблема = ДанныеЗаполнения.Текст;
			КонецЕсли;
			
			Если ДанныеЗаполнения.Свойство("Ссылка") Тогда
				Документ = ДанныеЗаполнения.Ссылка;
			КонецЕсли;
			
		Иначе
			
			Документ = ДанныеЗаполнения;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		
		Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
		Контрагент = Пользователь.ОбъектАвторизации;
		
		Супервайзер = Справочники.Пользователи.НайтиПоРеквизиту("ФизическоеЛицо", Контрагент.Супервайзер);
		Адресат = Супервайзер;
		
	КонецЕсли;
	
КонецПроцедуры