
&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаКлиенте();
	
	Если Объект.Материалы.Количество() > 0 Тогда
		
		Ответ = Вопрос("Таблица будет перезаполнена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			ЗаполнитьНаСервере();
			
		КонецЕсли;
		
	Иначе
		
		ЗаполнитьНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Документы.ПриходМатериаловЗаказчика.ЗаполнитьМатериалыЗаказчика(Объект.Материалы, Объект.Спецификация);
	
КонецПроцедуры

&НаКлиенте
Процедура СпецификацияПриИзменении(Элемент)
	
	ЗаполнитьНаКлиенте();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры
