#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
#Область СлужебныеПроцедурыИФункции
 
// Заполняет настройки вариантов отчета.
// Подробнее - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	
	Отчет = МодульВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.Задания);
	Отчет.Описание = НСтр("ru = 'Список и сводная статистика по выполнению заданий.'");
	
	Вариант = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, Отчет, "СписокЗаданий");
	Вариант.Описание = НСтр("ru = 'Список всех заданий за указанный период.'");
	
	Вариант = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, Отчет, "СтатистикаЗаданий");
	Вариант.Описание = НСтр("ru = 'Сводная диаграмма по всем выполненным, отмененным заданиям и заданиям в работе.'");
	
	Вариант = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, Отчет, "СтатистикаЦикловВыполненияПроверки");
	Вариант.Описание = НСтр("ru = 'Топ 10 авторов по среднему количеству перепроверок заданий.'");
	
	Вариант = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, Отчет, "СтатистикаДлительности");
	Вариант.Описание = НСтр("ru = 'Топ 10 авторов по средней длительности выполнения заданий.'");
	
КонецПроцедуры
 
#КонецОбласти

#КонецЕсли