
Процедура ОповещениеСлужебныхЗаписок() Экспорт
		
	МассивСлужебок = ЛексСервер.ПолучитьСписокНеОзнакомленныхСлужебок();
	ЕстьСлужебки = МассивСлужебок.Количество() > 0;
	
	ЭтоДилер = ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя();
	ЕстьПеределки = Ложь;
	ЕстьОбращения = Ложь;
	
	Если НЕ ЭтоДилер Тогда
		
		МассивОбращений = ЛексСервер.ПолучитьСписокАктивныхОбращений();
		ЕстьОбращения = МассивОбращений.Количество() > 0;
		
		МассивПеределок = ЛексСервер.ПолучитьНомераПередлокИСрочек(ПользователиКлиентСервер.АвторизованныйПользователь());
		ЕстьПеределки = МассивПеределок.Количество() > 0;
		
	КонецЕсли;
	
	Если ЕстьСлужебки ИЛИ ЕстьПеределки ИЛИ ЕстьОбращения Тогда
		
		ПараметрыФормы = Новый Структура;
		
		Если ЕстьСлужебки Тогда
			
			ПараметрыФормы.Вставить("МассивСлужебок", МассивСлужебок);
			
		КонецЕсли;
		
		Если ЕстьПеределки Тогда
			
			ПараметрыФормы.Вставить("МассивПеределокИСрочек", МассивПеределок);
			
		КонецЕсли;
		
		Если ЕстьОбращения Тогда
			
			ПараметрыФормы.Вставить("МассивОбращений", МассивОбращений);
			
		КонецЕсли;
		
		ОткрытьФорму("ОбщаяФорма.ФормаНеОзнакомленныхСлужебок", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры
