
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивМакетов = ОпределитьМакеты(ПараметрКоманды);
	
	Если ЗначениеЗаполнено(МассивМакетов) Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.НарядЗадание", СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивМакетов), ПараметрКоманды, ПараметрыВыполненияКоманды, Неопределено);
	Иначе
		Предупреждение("Документы на печать отсутствуют!");
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ОпределитьМакеты(Документ)
	
	МассивМакетов = Новый Массив;
	МассивМакетов.Добавить("ПечатьНарядЗадания");
	МассивМакетов.Добавить("ПечатьОТК");
	МассивМакетов.Добавить("ПечатьМатериалПоЦеховымЗонам");
	МассивМакетов.Добавить("ПечатьМатериалПоВидам");
	МассивМакетов.Добавить("ПечатьЛистовойМатериал");
	МассивМакетов.Добавить("ПечатьХлыстовойМатериал");

	Возврат МассивМакетов;
	
КонецФункции
