#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Групповое изменение объектов

// Возвращает список реквизитов, которые не нужно редактировать
// с помощью обработки группового изменения объектов
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ДляРабочегоСтола");
	Результат.Добавить("Предмет");
	Результат.Добавить("Пометка");
	Возврат Результат;
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

Функция ОтправитьЗаметкуНаСайт(ЗаметкаСсылка) Экспорт
	
	Если ТипЗнч(ЗаметкаСсылка.Предмет) = Тип("ДокументСсылка.Спецификация") Тогда
		
		СпецификацияСсылка = ЗаметкаСсылка.Предмет; 
		
		ТекДата = ТекущаяДата();
		НомерСпец = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(СпецификацияСсылка.Номер);	
		ТекстЗаметки = ЗаметкаСсылка.ТекстСодержания;
		
		Стр = "<?xml version=""1.0""?>
		|<notes>
	    |<order_number>" + НомерСпец + "</order_number>
	    |<date>" + ТекДата + "</date>
	    |<text>" + ТекстЗаметки + "</text>
		|</notes>";

		Соединение = Новый HTTPСоединение("rospil.me",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	 
	  	запросPOST = Новый HTTPЗапрос("/api/order-note"); 
		запросPOST.Заголовки.Вставить("Accept", "application/atom+xml");
	    запросPOST.Заголовки.Вставить("Content-type", "text/plain; charset=" + "UTF-8");

	    запросPOST.УстановитьТелоИзСтроки(Стр,"UTF-8",ИспользованиеByteOrderMark.НеИспользовать);
	 
	    Соединение.ОтправитьДляОбработки(запросPOST, "c:\111\request.txt");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли