
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элемент=Параметры.ВыбранныйЭлементСсылка.Номенклатура;
	СсылкаНаЭлемент=Элемент;
	СсылкаЕдиницаИзмерения=Элемент.ЕдиницаИзмерения;
	СсылкаКратность=Элемент.Кратность;
	Наименование=Элемент.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ЭтаФорма.Закрыть();
	Если Количество<>0 Тогда
		Если СсылкаКратность<>0 Тогда
			Количество = СсылкаКратность*Цел(Количество/СсылкаКратность);	
		КонецЕсли; 
		ЭтаФорма.ВладелецФормы.ВыбранныеДобавитьЭлемент(Количество, СсылкаНаЭлемент, СсылкаЕдиницаИзмерения, СсылкаКратность);
	КонецЕсли;

КонецПроцедуры
