
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элемент=Параметры.ВыбранныйЭлементСсылка;
	СсылкаНаЭлемент=Элемент;
	СсылкаЕдиницаИзмерения=Элемент.ЕдиницаИзмерения;
	Наименование=Элемент.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура OK(Команда)
	ЭтаФорма.Закрыть();
	Если Количество<>0 Тогда
		ЭтаФорма.ВладелецФормы.ВыбранныеДобавитьЭлемент(Количество, СсылкаНаЭлемент, СсылкаЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
