
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Ответ = Вопрос(НСтр("ru = 'Загружать информацию о пользователях?'"), РежимДиалогаВопрос.ДаНетОтмена, ,
		КодВозвратаДиалога.Да);
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	АдресВХранилище = Неопределено;
	Если НЕ ПоместитьФайл(АдресВХранилище, "*.zip") Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьДанныеНаСервере(АдресВХранилище, Ответ = КодВозвратаДиалога.Да);
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗагрузитьДанныеНаСервере(Знач АдресВХранилище, Знач ЗагружатьПользователей)
	
	ДанныеАрхива = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
	ДанныеАрхива.Записать(ИмяАрхива);
	ДанныеАрхива = Неопределено;
	
	ВыгрузкаЗагрузкаДанных.ЗагрузитьТекущуюОбластьИзАрхива(ИмяАрхива, ЗагружатьПользователей);
	
	Попытка
		УдалитьФайлы(ИмяАрхива);
	Исключение
		// Дополнительная обработка не требуется, возможно возникновение исключения при удалении временного файла
	КонецПопытки;
	
КонецПроцедуры
