// { Васильев Александр Леонидович [27.08.2013]
// тут проёб. судя по названию модуля он должен быть ТОЛЬКО серверным
// у нас же стоит флаг Вызов сервера :(
// } Васильев Александр Леонидович [27.08.2013]

// Возвращает массив документов
// подвязанных к указанному
// dmn 2011_11_01
Функция НайтиПодчиненныеДокументы(ОснованиеСсылка, СтрокаМетаданные, ИмяРеквизита) Экспорт
	
	Если ОснованиеСсылка.Пустая() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	" + СтрокаМетаданные + " КАК Таблица
	|ГДЕ
	|	Таблица."+ИмяРеквизита+" = &ОснованиеСсылка";
	Запрос.УстановитьПараметр("ОснованиеСсылка", ОснованиеСсылка);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // НайтиПодчиненныеДокументы()

// Формирует реквизиты организации.
// В основном для печатных форм
//
// Параметры
//  Организация  - СправочникСсылкаОрганизация - организация
//                 реквизиты которой получаем
//
// Возвращаемое значение:
//   Структура   - структура с реквизитами организации
//
Функция ПолучитьРеквизитыОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	Справочник.Организации
	|ГДЕ
	|	Ссылка = &Организация";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Результат.Вставить("ОГРН", Выборка.ОГРН);
	Результат.Вставить("ДействуетНаОсновании", Выборка.ДействуетНаОсновании);
	Результат.Вставить("ДатаВыдачиОГРН", Формат(Выборка.ДатаВыдачиОГРН, "ДЛФ=DD"));
	Результат.Вставить("ИНН", Выборка.ИНН);
	Результат.Вставить("КПП", Выборка.КПП);
	Результат.Вставить("БИК", Выборка.БИК);
	Результат.Вставить("РасчетныйСчет", Выборка.РасчетныйСчет);
	Результат.Вставить("КорреспондирующийСчет", Выборка.КорреспондирующийСчет);
	Результат.Вставить("ПочтовыйИндекс", Выборка.ПочтовыйИндекс);
	Результат.Вставить("ЮридическийАдрес", Выборка.ЮридическийАдрес);
	Результат.Вставить("Банк", Выборка.Банк);
	Результат.Вставить("ПолноеНаименованиеОрганизации", Выборка.ПолноеНаименование);
	Результат.Вставить("КраткоеНаименование", Выборка.Наименование);
	Результат.Вставить("НаселенныйПункт", Выборка.НаселенныйПункт);
	Результат.Вставить("ТелефонОрганизации", Выборка.ТелефонОфиса);
	
	Возврат Результат;
	
КонецФункции // ПолучитьРеквизитыОрганизации()

Функция НастройкаПользователя(Пользователь, ИмяПараметра) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Значения.Значение,
	|	Настройки.ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.НастройкиПользователей КАК Настройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПользователей КАК Значения
	|		ПО (Значения.Настройка = Настройки.Ссылка)
	|ГДЕ
	|	Значения.Пользователь = &Пользователь
	|	И Настройки.Наименование = &ИмяПараметра";
	Запрос.Параметры.Вставить("Пользователь",Пользователь);
	Запрос.Параметры.Вставить("ИмяПараметра",ИмяПараметра);
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	Если ТаблицаЗначений.Количество()>0 Тогда
		СтрокаТаблицы = ТаблицаЗначений[0];
		Если СтрокаТаблицы.Значение=Null Или СтрокаТаблицы.Значение=Неопределено Тогда
			Значение = СтрокаТаблицы.ТипЗначения.ПривестиЗначение(Значение);
		Иначе
			Значение = СтрокаТаблицы.Значение;
		КонецЕсли;
	Иначе
		Значение = Неопределено;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ПолучитьДолгКонтрагентаНаДату(Контрагент, Период, СписокПодразделений) Экспорт
	
	Ответ = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			&Период,
	|			Контрагент = &Контрагент
	|				И Подразделение В (&СписокПодразделений)) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Ответ = Выборка.СуммаОстаток;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции // ПолучитьДолгКонтрагентаНаДату()

Функция УстановитьНастройкуПользователя(Пользователь, ИмяНастройки, Значение) Экспорт
	
	Настройка = ПланыВидовХарактеристик.НастройкиПользователей.НайтиПоНаименованию(ИмяНастройки);
	Если Настройка <> ПланыВидовХарактеристик.НастройкиПользователей.ПустаяСсылка() Тогда
		
		Набор = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
		Набор.Отбор.Пользователь.Установить(Пользователь);
		Набор.Отбор.Настройка.Установить(Настройка);
		Запись = Набор.Добавить();
		Запись.Пользователь = Пользователь;
		Запись.Настройка = Настройка;
		Запись.Значение = Значение;
		Набор.Записать();
		
	КонецЕсли;
	
КонецФункции // УстановитьНастройкуПользователя()

Функция ПолучитьДоверенностьСотрудника(Сотрудник, Организация) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НомерДоверенности", "Нет");
	Результат.Вставить("ДатаДоверенности", "Нет");
	
	#Если Никогда Тогда
		Сотрудник = Справочники.ФизическиеЛица.НайтиПоКоду();
	#КонецЕсли
	
	СтрокаДоверенность = Сотрудник.Доверенности.Найти(Организация);
	Если НЕ СтрокаДоверенность = Неопределено Тогда
		Результат.НомерДоверенности = СтрокаДоверенность.НомерДоверенности;
		Результат.ДатаДоверенности = Формат(СтрокаДоверенность.ДатаДоверенности, "ДЛФ=D");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьДоверенностьСотрудника()

// для формирования строки в раскрой
Функция СоздатьТаблицу(Строка) Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	ЧислоКолонок = СтрЧислоВхождений(Строка,",");
	К = 0;
	Пока К <= ЧислоКолонок Цикл
		Инд = Найти(Строка,",");
		Если Инд <> 0 Тогда
			НазвКолонки = Лев(Строка,Инд-1);
			Строка = Сред(Строка,Инд+1);
		Иначе
			НазвКолонки = Строка;
		КонецЕсли;
		Таблица.Колонки.Добавить(НазвКолонки);
		К=К+1;
	КонецЦикла;
	Возврат Таблица;
	
КонецФункции

Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита);
	Возврат Результат[ИмяРеквизита];
	
КонецФункции

Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты) Экспорт
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	Возврат Результат;
	
КонецФункции

//Получает список необходимых номенклатурных групп(список значений) 
// Параметры
//  СписокНоменклатурныхГрупп  - СписокЗначений - 
//  Подразделение  - Справочник.Подразделение - 
//и формирует структуру массивов этих групп
Функция ОтборНоменклатурныхГрупп(СписокНоменклатурныхГрупп, Подразделение) Экспорт
	
	СтруктураМассивов = Новый Структура;
	Для каждого НоменклатурнаяГруппа Из СписокНоменклатурныхГрупп Цикл
		ИмяГруппы = Справочники.НоменклатурныеГруппы.ПолучитьИмяПредопределенного(НоменклатурнаяГруппа.Значение);
		СтруктураМассивов.Вставить(ИмяГруппы, Новый Массив);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокНоменклатурныхГрупп", СписокНоменклатурныхГрупп);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка,
	|	СпрНоменклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	|ИЗ
	|	РегистрСведений.НоменклатураПодразделений КАК НоменклатураПодразделений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО (НоменклатураПодразделений.Подразделение = &Подразделение)
	|			И НоменклатураПодразделений.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	СпрНоменклатура.НоменклатурнаяГруппа В(&СписокНоменклатурныхГрупп)
	|	И СпрНоменклатура.Базовый
	|	И НоменклатураПодразделений.Доступность
	|
	|УПОРЯДОЧИТЬ ПО
	|	СпрНоменклатура.Наименование
	|ИТОГИ ПО
	|	НоменклатурнаяГруппа";
	
	Результат = Запрос.Выполнить();
	ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИтоги.Следующий() Цикл
		
		Выборка = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ИмяГруппы = Справочники.НоменклатурныеГруппы.ПолучитьИмяПредопределенного(ВыборкаИтоги.НоменклатурнаяГруппа);
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураМассивов[ИмяГруппы].Добавить(Выборка.Ссылка);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СтруктураМассивов;
	
КонецФункции // ОтборНоменклатурныхГрупп()

Функция ПолучитьИмяХТМЛ (Значение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранимыеФайлыВерсий.ХранимыйФайл,
	|	ХранимыеФайлыВерсий.ВерсияФайла.Владелец КАК Владелец,
	|	ХранимыеФайлыВерсий.ВерсияФайла.Владелец.ТекущаяВерсияРасширение КАК Расширение
	|ИЗ
	|	РегистрСведений.ХранимыеФайлыВерсий КАК ХранимыеФайлыВерсий
	|ГДЕ
	|	ХранимыеФайлыВерсий.ВерсияФайла.Владелец.ВладелецФайла = ЗНАЧЕНИЕ(Справочник.ПапкиФайлов.Html)
	|	И ХранимыеФайлыВерсий.ВерсияФайла.Владелец.ТекущаяВерсия.НомерВерсии = ХранимыеФайлыВерсий.ВерсияФайла.НомерВерсии
	|	И ХранимыеФайлыВерсий.ВерсияФайла.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Значение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ПутьХТМЛ = "Рабочий_" + Строка(Выборка.Владелец)+"."+Выборка.Расширение;
	Выборка.Сбросить();
	
	Возврат ПутьХТМЛ;
	
КонецФункции

Функция РасчитатьНорматив(Подразделение, Дата) Экспорт 
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	ПлановыйЛимит.Норматив,
	|	ПлановыйЛимит.НормативныйМаксимум,
	|	ПлановыйЛимит.КоэффициентСверхнорматива
	|ИЗ
	|	РегистрСведений.ПлановыйЛимит.СрезПоследних(&Период, Подразделение = &Подразделение) КАК ПлановыйЛимит";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Выборка 	= Запрос.Выполнить().Выбрать();
	Норматив 	= Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Норматив = Новый Структура;
		
		Норматив.Вставить("Норматив", Выборка.Норматив);
		Норматив.Вставить("НормативныйМаксимум", Выборка.НормативныйМаксимум);
		Норматив.Вставить("КоэффициентСверхнорматива", Выборка.КоэффициентСверхнорматива);
		
	КонецЦикла;
	
	Возврат Норматив;
	
КонецФункции 

Функция ПроверитьЛимит(Подразделение, Дата, ЗарплатаЦеха, Стоимость) Экспорт 
	
	Лимит	 	= ЛексСервер.РасчитатьНорматив(Подразделение, Дата);
	Норматив	= Новый Структура;
	Норматив.Вставить("КоэффициентСверхнорматива", 1);
	Норматив.Вставить("ПревышенМаксимум", Ложь);
	Норматив.Вставить("Сверхнормативный", Ложь);
	
	Если Лимит <> Неопределено Тогда
		
		РаботНаДень = Лимит.СуммаОборот;
		
		Если РаботНаДень + ЗарплатаЦеха > Лимит.Норматив и РаботНаДень + ЗарплатаЦеха < Лимит.НормативныйМаксимум Тогда
			
			Норматив.Вставить("КоэффициентСверхнорматива", Лимит.НормативныйМаксимум);
			Норматив.Вставить("СуммаСверхнорматива", Стоимость * (Норматив.КоэффициентСверхнорматива-1));
			Норматив.Вставить("Сверхнормативный", Истина);
			
		ИначеЕсли РаботНаДень + ЗарплатаЦеха > Лимит.Максимум Тогда
			
			Норматив.Вставить("ПревышенМаксимум", Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Норматив;
	
КонецФункции

Функция ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Данные.Номер);
	Дата = Формат(Данные.Дата, "ДФ=dd.MM.yy");
	ИмяДокумента = Данные.Ссылка.Метаданные().Синоним;
	Представление = ИмяДокумента + " № " + Номер + " от " + Дата;
	
КонецФункции

Функция ПолучитьОстатокОперационнойКассыНаДату(Период, ОперационнаяКасса, Подразделение) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Возврат 0;
	КонецЕсли;
	
	Ответ = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ОперационнаяКасса", ОперационнаяКасса);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УправленческийОстатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Остатки(
	|			&Период,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ОперационнаяКасса),
	|			,
	|			Субконто2 = &ОперационнаяКасса
	|				И Подразделение = &Подразделение) КАК УправленческийОстатки";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Ответ = Выборка.СуммаОстаток;
	КонецЕсли;
	
	Возврат Ответ;
	
	
КонецФункции

Функция ПолучитьЗатратныйСчетПодразделения(Подразделение) Экспорт
	
	ВидПодразделения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "ВидПодразделения");
	
	Если ВидПодразделения = Перечисления.ВидыПодразделений.Производство Тогда
		Счет = ПланыСчетов.Управленческий.РасходыПроизводства;
	ИначеЕсли ВидПодразделения = Перечисления.ВидыПодразделений.Розница Тогда
		Счет = ПланыСчетов.Управленческий.РасходыРозничнойСети;
	ИначеЕсли ВидПодразделения = Перечисления.ВидыПодразделений.Управление Тогда
		Счет = ПланыСчетов.Управленческий.РасходыУправления;
	ИначеЕсли ВидПодразделения = Перечисления.ВидыПодразделений.Логистик Тогда
		Счет = ПланыСчетов.Управленческий.РасходыЛогистики;
	КонецЕсли;
	
	Возврат Счет;
	
КонецФункции

Функция ПолучитьОсновноеПроизводство(Подразделение) Экспорт
	
	Регион = ЛексСервер.ЗначениеРеквизитаОбъекта(Подразделение, "Регион");
	
	Возврат ПолучитьПодразделениеПоРегиону(Регион, Перечисления.ВидыПодразделений.Производство);
	
КонецФункции

Функция ПолучитьОсновнуюРозницу(Подразделение) Экспорт
	
	Регион = ЛексСервер.ЗначениеРеквизитаОбъекта(Подразделение, "Регион");
	
	Возврат ПолучитьПодразделениеПоРегиону(Регион, Перечисления.ВидыПодразделений.Розница);
	
КонецФункции

Функция ПолучитьПодразделениеПоРегиону(Регион, ВидПодразделения) Экспорт
	
	Подразделение = Справочники.Подразделения.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регион", Регион);
	Запрос.УстановитьПараметр("ВидПодразделения", ВидПодразделения);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Подразделения.Ссылка
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|ГДЕ
	|	Подразделения.Регион = &Регион
	|	И Подразделения.ВидПодразделения = &ВидПодразделения";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Подразделение = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Подразделение;
	
КонецФункции

Функция ПолучитьСтатьюДоходаУправления(Подразделение) Экспорт
	
	Статья = Неопределено;
	
	ВидПодразделения = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Подразделение, "ВидПодразделения");
	
	Если ВидПодразделения = Перечисления.ВидыПодразделений.Логистик Тогда
		Статья = Справочники.СтатьиДоходовРасходов.ДоходыОтЛогиста;
	ИначеЕсли ВидПодразделения = Перечисления.ВидыПодразделений.Производство Тогда
		Статья = Справочники.СтатьиДоходовРасходов.ДоходыОтПроизводства;
	ИначеЕсли ВидПодразделения = Перечисления.ВидыПодразделений.Розница Тогда
		Статья = Справочники.СтатьиДоходовРасходов.ДоходыОтРозницы;
	КонецЕсли;
	
	Возврат Статья;
	
КонецФункции

// Списывает материалы со склада, приходует в цех или на склад готовой продукции
//
// Параметры
//  Ссылка - ссылка на документ Наряд, ТребованиеНакладная или Комплектация
//  Движения - коллекция движений проводимого документа
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с недостающими материалами
//
Функция ПеремещениеМатериаловСЛогистики(Ссылка, Движения) Экспорт
	
	Отказ = Ложь;
	Комплектация = ТипЗнч(Ссылка) = Тип("ДокументСсылка.Комплектация");
	ИтогСуммаРеализации = 0;
	
	НехваткаМатериалов = Новый ТаблицаЗначений;
	НехваткаМатериалов.Колонки.Добавить("Номенклатура");
	НехваткаМатериалов.Колонки.Добавить("КоличествоТребуется");
	НехваткаМатериалов.Колонки.Добавить("КоличествоОстаток");
	НехваткаМатериалов.Колонки.Добавить("НомерСтроки");
	
	Если Комплектация Тогда
		
		СвойстваДокумента = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "Подразделение, Дата");
		СвойстваДокумента.Вставить("Склад", ОбщегоНазначения.ПолучитьЗначениеРеквизита(СвойстваДокумента.Подразделение, "ОсновнойСклад"));
		Спецификация = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Ссылка, "Спецификация");
		
	Иначе
		
		СвойстваДокумента = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "Подразделение, Дата, Склад");
		
	КонецЕсли;
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склады);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(СписокНоменклатуры.НомерСтроки) КАК НомерСтроки,
	|	СписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(СписокНоменклатуры.Количество) КАК Количество
	|ПОМЕСТИТЬ СписокНоменклатуры
	|ИЗ
	|	Документ.НарядЗадание.СписокНоменклатуры КАК СписокНоменклатуры
	|ГДЕ
	|	СписокНоменклатуры.Ссылка В(&Ссылка) И СписокНоменклатуры.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокНоменклатуры.НомерСтроки,
	|	СписокНоменклатуры.Номенклатура,
	|	СписокНоменклатуры.Количество
	|ИЗ
	|	СписокНоменклатуры КАК СписокНоменклатуры";
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НарядЗадание", "ТребованиеНакладная");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СУММА(СписокНоменклатуры.Количество)", "СУММА(СписокНоменклатуры.Отпущено)");
	ИначеЕсли Комплектация Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НарядЗадание", "Комплектация");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СУММА(СписокНоменклатуры.Количество)", "СУММА(СписокНоменклатуры.КоличествоСклад + СписокНоменклатуры.КоличествоЦех)");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат НехваткаМатериалов;
	КонецЕсли;
	
	ТЗНоменклатура = РезультатЗапроса.Выгрузить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Управленческий");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Подразделение", Справочники.Подразделения.Логистика);
	ЭлементБлокировки.УстановитьЗначение("Счет", ПланыСчетов.Управленческий.МатериалыНаСкладе);
	ЭлементБлокировки.УстановитьЗначение(ПланыВидовХарактеристик.ВидыСубконто.Склады, СвойстваДокумента.Склад);
	
	ЭлементБлокировки.ИсточникДанных = ТЗНоменклатура;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура, "Номенклатура");
	Блокировка.Заблокировать();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокНоменклатуры.НомерСтроки,
	|	СписокНоменклатуры.Номенклатура,
	|	СписокНоменклатуры.Номенклатура.Базовый КАК Базовый,
	|	СписокНоменклатуры.Номенклатура.БазоваяНоменклатура КАК БазоваяНоменклатура,
	|	СписокНоменклатуры.Количество,
	|	ЕСТЬNULL(УправленческийОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(УправленческийОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА СписокНоменклатуры.Номенклатура.КоэффициентБазовых = 0
	|			ТОГДА 1
	|		ИНАЧЕ СписокНоменклатуры.Номенклатура.КоэффициентБазовых
	|	КОНЕЦ КАК КоэффициентБазовых,
	|	СписокНоменклатуры.Количество * ВЫБОР
	|		КОГДА СписокНоменклатуры.Номенклатура.КоэффициентБазовых = 0
	|			ТОГДА 1
	|		ИНАЧЕ СписокНоменклатуры.Номенклатура.КоэффициентБазовых
	|	КОНЕЦ * ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Внутренняя, 0) КАК СуммаРеализации
	|ИЗ
	|	СписокНоменклатуры КАК СписокНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
	|				&МоментВремени,
	|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.МатериалыНаСкладе),
	|				&ВидыСубконто,
	|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.Логистика)
	|					И Субконто1 = &Склад
	|					И Субконто2 В
	|						(ВЫБРАТЬ
	|							СписокНоменклатуры.Номенклатура
	|						ИЗ
	|							СписокНоменклатуры)) КАК УправленческийОстатки
	|		ПО СписокНоменклатуры.Номенклатура = УправленческийОстатки.Субконто2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&МоментВремени,
	|				Регион = &Регион
	|					И (Номенклатура В
	|							(ВЫБРАТЬ
	|								СписокНоменклатуры.Номенклатура
	|							ИЗ
	|								СписокНоменклатуры)
	|						ИЛИ Номенклатура В
	|							(ВЫБРАТЬ
	|								СписокНоменклатуры.Номенклатура.БазоваяНоменклатура
	|							ИЗ
	|								СписокНоменклатуры))) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО (СписокНоменклатуры.Номенклатура.БазоваяНоменклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|				ИЛИ СписокНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)";
	
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("МоментВремени", Ссылка.МоментВремени());
	Запрос.УстановитьПараметр("Регион", Ссылка.Подразделение.Регион);
	Запрос.УстановитьПараметр("Склад", СвойстваДокумента.Склад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КоличествоОстаток < Выборка.Количество Тогда
			
			НоваяСтрока = НехваткаМатериалов.Добавить();
			НоваяСтрока.Номенклатура = Выборка.Номенклатура;
			НоваяСтрока.НомерСтроки = Выборка.НомерСтроки;
			НоваяСтрока.КоличествоТребуется = Выборка.Количество;
			НоваяСтрока.КоличествоОстаток = Выборка.КоличествоОстаток;
			
			Отказ = Истина;
			Продолжить;
			
		КонецЕсли;
		
		////////////
		// ЛОГИСТИКА
		
		// Списывам материал со склада, увеличиваем расходы
		
		Если Выборка.КоличествоОстаток < Выборка.Количество ИЛИ Выборка.КоличествоОстаток = 0 Тогда
			
			Себестоимость = 0;
			
		Иначе
			
			Себестоимость = Выборка.Количество / Выборка.КоличествоОстаток * Выборка.СуммаОстаток;
			
		КонецЕсли;
		
		Движение = Движения.Управленческий.Добавить();
		Движение.Период = СвойстваДокумента.Дата;
		Движение.Подразделение = Справочники.Подразделения.Логистика;
		Движение.СчетКт = ПланыСчетов.Управленческий.МатериалыНаСкладе;
		Движение.СубконтоКт.Склады = СвойстваДокумента.Склад;
		Движение.СубконтоКт.Номенклатура = Выборка.Номенклатура;
		Движение.КоличествоКт = Выборка.Количество;
		Движение.СчетДт = ПланыСчетов.Управленческий.РасходыЛогистики;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = Справочники.СтатьиДоходовРасходов.РасходыСебестоимостьМатериалаЛогистика;
		Движение.Сумма = Себестоимость;
		
		////////////////
		// ПРОИЗВОДСТВО
		
		// { Васильев Александр Леонидович [13.12.2013]
		// списываем себестоимость материалов на расходы
		// при передаче в цех или на склад готовой продукции
		// } Васильев Александр Леонидович [13.12.2013]
		
		//Если НЕ Комплектация Тогда
		// Оприходуем материалы в цех по внутренней цене
		Движение = Движения.Управленческий.Добавить();
		Движение.Период = СвойстваДокумента.Дата;
		Движение.Подразделение = СвойстваДокумента.Подразделение;
		Движение.Сумма = Выборка.СуммаРеализации;
		Движение.СчетДт = ПланыСчетов.Управленческий.ОсновноеПроизводство;
		Движение.СубконтоДт.Номенклатура = ?(Выборка.Базовый, Выборка.Номенклатура, Выборка.БазоваяНоменклатура);
		Движение.КоличествоДт = Выборка.Количество * Выборка.КоэффициентБазовых;
		Движение.СчетКт = ПланыСчетов.Управленческий.ВзаиморасчетыСПодразделениями;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Подразделения] = Справочники.Подразделения.Логистика;
		
		// расходы сразу же
		Движение = Движения.Управленческий.Добавить();
		Движение.Период = СвойстваДокумента.Дата;
		Движение.Подразделение = СвойстваДокумента.Подразделение;
		Движение.Сумма = Выборка.СуммаРеализации;
		Движение.СчетДт = ПланыСчетов.Управленческий.РасходыПроизводства;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = Справочники.СтатьиДоходовРасходов.РасходыНаПроизводственныйМатериал;
		Движение.СчетКт = ПланыСчетов.Управленческий.ОсновноеПроизводство;
		Движение.СубконтоКт.Номенклатура = ?(Выборка.Базовый, Выборка.Номенклатура, Выборка.БазоваяНоменклатура);
		//Если Комплектация Тогда
		//	Движение.КоличествоКт = Выборка.Количество * Выборка.КоэффициентБазовых;
		//КонецЕсли; 
		
		//КонецЕсли;
		
		ИтогСуммаРеализации = Выборка.СуммаРеализации + ИтогСуммаРеализации;
		
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		
		// ДОХОДЫ ЛОГИСТИКА
		
		// Доходы, взаиморасчетыСПроизводством
		
		Движение = Движения.Управленческий.Добавить();
		Движение.Период = СвойстваДокумента.Дата;
		Движение.Подразделение = Справочники.Подразделения.Логистика;
		
		Движение.СчетДт = ПланыСчетов.Управленческий.ВзаиморасчетыСПодразделениями;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Подразделения] = СвойстваДокумента.Подразделение;
		
		Движение.СчетКт = ПланыСчетов.Управленческий.Доходы;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = Справочники.СтатьиДоходовРасходов.ДоходыЛогистаОтПроизводства;
		
		Движение.Сумма = ИтогСуммаРеализации;
		
		//Если Комплектация Тогда
		//	Движение = Движения.Управленческий.Добавить();
		//	Движение.Период = СвойстваДокумента.Дата;
		//	Движение.Подразделение = СвойстваДокумента.Подразделение;
		//	Движение.Сумма = ИтогСуммаРеализации;
		//	Движение.СчетДт = ПланыСчетов.Управленческий.РасходыПроизводства;
		//	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = Справочники.СтатьиДоходовРасходов.РасходыНаПроизводственныйМатериал;
		//	Движение.СчетКт = ПланыСчетов.Управленческий.ВзаиморасчетыСПодразделениями;
		//	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Подразделения] = Справочники.Подразделения.Логистика;
		//КонецЕсли;
		
	КонецЕсли;
	
	Возврат НехваткаМатериалов;
	
КонецФункции

// Добавление показателей сотрудникам за договоры
//
// Параметры:
//  Движение  - РегистрБухгалтерииНаборЗаписей.Управленческий
//
//  Договор  - Документ.Договор - Если проводится договор - то ссылка на него, если соглашение - реквизит "договор"
//
//  Сумма  - Число - Сумма проводимого документа
//
//  Коментарий  - Строка - Коментарий проводимого документа
//
Процедура СформироватьПоказателиСотрудников(Движения, Ссылка) Экспорт
	
	Дата 		= ОбщегоНазначения.ПолучитьЗначениеРеквизита(Ссылка, "Дата");
	Сумма 	= ОбщегоНазначения.ПолучитьЗначениеРеквизита(Ссылка, "СуммаДокумента");
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Договор") Тогда
		
		Договор 		= Ссылка;
		Соглашение 	= Ложь;
		
	Иначе
		
		Договор 		= ОбщегоНазначения.ПолучитьЗначениеРеквизита(Ссылка, "Договор");
		Соглашение 	= Истина;
		
	КонецЕсли;
	
	СвойстваДокумента = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Договор, "Подразделение, Автор, Поделиться, ПроцентПоделиться, Комментарий");
	
	// показатели автору договора
	
	ОставшийсяПроцент 	= 100 - СвойстваДокумента.ПроцентПоделиться;
	СуммаСотруднику 		= Сумма /100 * ОставшийсяПроцент;
	Количество 				= 0.01 * ОставшийсяПроцент; 
	
	ДобавитьПоказательСотрудника(СвойстваДокумента.Подразделение, Договор.Автор.ФизическоеЛицо, Движения, Дата, СуммаСотруднику, Количество, Соглашение);
	
	// показатели "Поделиться"
	
	Если ЗначениеЗаполнено(СвойстваДокумента.Поделиться) И СвойстваДокумента.ПроцентПоделиться > 0 Тогда
		
		СуммаСотруднику 	= Сумма /100 * СвойстваДокумента.ПроцентПоделиться;
		Количество 			= 0.01*СвойстваДокумента.ПроцентПоделиться; 
		
		ДобавитьПоказательСотрудника(СвойстваДокумента.Подразделение, СвойстваДокумента.Поделиться, Движения, Дата, СуммаСотруднику, Количество, Соглашение);
		
	КонецЕсли;
	
КонецПроцедуры // ПроведениеДоговораИлиДопСоглашения()

// <Описание процедуры>
//
// Параметры:
//  Ссылка  - Документы.Договор, Документы.ДополнительноеСоглашение
//
//  СвойстваДокумента  - Структура - Значения реквизитов передаваемого документа
//
//  Проводки  - РегистрБухгалтерииНаборЗаписей.Управленческий - новая строка
//
//  Дата  - Дата - Дата проводимого документа
//
// Соглашение  - Булево - Договор или ДопСоглашение
//
Процедура ДобавитьПоказательСотрудника(Подразделение, ФизическоеЛицо, Движения, Дата, Сумма, Количество, Соглашение)
	
	// { Васильев Александр Леонидович [21.10.2013]
	// изменилась логика
	// Количество заключенных договоров отдельно, стоимость отдельно (разные показатели)
	// значение показателя -- ресурс регистра Сумма
	// } Васильев Александр Леонидович [21.10.2013]
	
	Проводки 							= Движения.Управленческий.Добавить();
	Проводки.Период				= Дата;
	Проводки.Подразделение	= Подразделение;
	Проводки.СчетДт				= ПланыСчетов.Управленческий.ПоказателиСотрудника;
	
	Проводки.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ВидыПоказателейСотрудников] 	= Перечисления.ВидыПоказателейСотрудников.СтоимостьЗаключенныхДоговоров;
	Проводки.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ФизическиеЛица] 	= ФизическоеЛицо;
	
	Проводки.Сумма 			= Сумма;
	
	Если НЕ Соглашение Тогда
		Проводки 							= Движения.Управленческий.Добавить();
		Проводки.Период				= Дата;
		Проводки.Подразделение	= Подразделение;
		Проводки.СчетДт				= ПланыСчетов.Управленческий.ПоказателиСотрудника;
		
		Проводки.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ВидыПоказателейСотрудников] 	= Перечисления.ВидыПоказателейСотрудников.КоличествоЗаключенныхДоговоров;
		Проводки.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ФизическиеЛица] 	= ФизическоеЛицо;
		
		Проводки.Сумма 			= Количество;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПроведениеДоговора()

Функция ЗаполнитьРеквизитОтверстиями(Данные, СтрокаОтверстий, ШиринаДетали, ВысотаДетали) Экспорт 
	
	ТаблицаОтверстий = ОпределитьШагОтверстия(ЗначениеИзСтрокиВнутр(СтрокаОтверстий), ШиринаДетали, ВысотаДетали);
	
	СтрокаСверху = ТаблицаОтверстий.Найти("Сверху", "РасположениеОтверстия");
	СтрокаСнизу = ТаблицаОтверстий.Найти("Снизу", "РасположениеОтверстия");
	СтрокаСлева = ТаблицаОтверстий.Найти("Слева", "РасположениеОтверстия");
	СтрокаСправа = ТаблицаОтверстий.Найти("Справа", "РасположениеОтверстия");
	СтрокаЦентр = ТаблицаОтверстий.Найти("Центр", "РасположениеОтверстия");
	СтрокаЦентр7 = ТаблицаОтверстий.Найти("Центр7", "РасположениеОтверстия");
	СтрокаЦентр8 = ТаблицаОтверстий.Найти("Центр8", "РасположениеОтверстия");
	
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		Данные.Вставить("Разделитель", "☻");
		ЭтоСтруктура = Истина;
	ИначеЕсли ТипЗнч(Данные) = Тип("Строка") Тогда
		Данные = "";
		ЭтоСтруктура = Ложь;
	КонецЕсли;
	
	Европаз = ТаблицаОтверстий.НайтиСтроки(Новый Структура ("ВидОтверстий", Перечисления.ВидыОтверстий.Европаз));
	Для Каждого Строка Из Европаз Цикл
		Если Строка.РасположениеОтверстия = "Сверху" Тогда
			Если ЭтоСтруктура Тогда
				Данные.ЕвроПазВерх = "1";
			Иначе
				Данные = ""; 
			КонецЕсли;
			СтрокаСверху = Неопределено;
		ИначеЕсли Строка.РасположениеОтверстия = "Снизу" Тогда
			Если ЭтоСтруктура Тогда
				Данные.ЕвроПазНиз = "1";		
			Иначе
				Данные = "";
			КонецЕсли;	
			СтрокаСнизу = Неопределено;
		ИначеЕсли Строка.РасположениеОтверстия = "Слева" Тогда
			Если ЭтоСтруктура Тогда
				Данные.ЕвроПазЛево = "1";
			Иначе	
				Данные = "";
			КонецЕсли;	
			СтрокаСлева = Неопределено;
		ИначеЕсли Строка.РасположениеОтверстия = "Справа" Тогда
			Если ЭтоСтруктура Тогда
				Данные.ЕвроПазПраво = "1";
			Иначе
				Данные = "";
			КонецЕсли;
			СтрокаСправа = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрокаСверху) Тогда
		ВидОтверстийЗначение = ПолучитьВидОтверстийЗначение(СтрокаСверху.ВидОтверстий);
		Если ЭтоСтруктура Тогда
			Данные.Вставить("Сторона1", ВидОтверстийЗначение + "_1_" + СтрокаСверху.Количество + "_" + СтрокаСверху.Смещение + "_" + СтрокаСверху.Шаг + "_" + СтрокаСверху.Отступ);	
		Иначе
			Данные = Данные + ВидОтверстийЗначение + "_1_" + СтрокаСверху.Количество + "_" + СтрокаСверху.Смещение + "_" + СтрокаСверху.Шаг + "_" + СтрокаСверху.Отступ + "#";	
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаСнизу) Тогда
		ВидОтверстийЗначение = ПолучитьВидОтверстийЗначение(СтрокаСнизу.ВидОтверстий);
		Если ЭтоСтруктура Тогда
			Данные.Вставить("Сторона2", ВидОтверстийЗначение + "_2_" + СтрокаСнизу.Количество + "_" + СтрокаСнизу.Смещение + "_" + СтрокаСнизу.Шаг + "_" + СтрокаСнизу.Отступ);	
		Иначе
			Данные = Данные + ВидОтверстийЗначение + "_2_" + СтрокаСнизу.Количество + "_" + СтрокаСнизу.Смещение + "_" + СтрокаСнизу.Шаг + "_" + СтрокаСнизу.Отступ + "#";	
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаСлева) Тогда
		ВидОтверстийЗначение = ПолучитьВидОтверстийЗначение(СтрокаСлева.ВидОтверстий);
		Если ЭтоСтруктура Тогда
			Данные.Вставить("Сторона3", ВидОтверстийЗначение + "_3_" + СтрокаСлева.Количество + "_" + СтрокаСлева.Смещение + "_" + СтрокаСлева.Шаг + "_" + СтрокаСлева.Отступ);	
		Иначе
			Данные = Данные + ВидОтверстийЗначение + "_3_" + СтрокаСлева.Количество + "_" + СтрокаСлева.Смещение + "_" + СтрокаСлева.Шаг + "_" + СтрокаСлева.Отступ + "#";	
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаСправа) Тогда
		ВидОтверстийЗначение = ПолучитьВидОтверстийЗначение(СтрокаСправа.ВидОтверстий);
		Если ЭтоСтруктура Тогда
			Данные.Вставить("Сторона4", ВидОтверстийЗначение + "_4_" + СтрокаСправа.Количество + "_" + СтрокаСправа.Смещение + "_" + СтрокаСправа.Шаг + "_" + СтрокаСправа.Отступ);	
		Иначе
			Данные = Данные + ВидОтверстийЗначение + "_4_" + СтрокаСправа.Количество + "_" + СтрокаСправа.Смещение + "_" + СтрокаСправа.Шаг + "_" + СтрокаСправа.Отступ + "#";	
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаЦентр) Тогда
		ВидОтверстийЗначение = ПолучитьВидОтверстийЗначение(СтрокаЦентр.ВидОтверстий);
		ДопСтрока = Строка(СтрокаЦентр.ВысотаПервойЛинии);
		Если ВидОтверстийЗначение = "1" Тогда
			Если СтрокаЦентр.ВысотаВторойЛинии > 0 Тогда
				ДопСтрока = ДопСтрока + "_" + Строка(СтрокаЦентр.ВысотаВторойЛинии);
			КонецЕсли;
		ИначеЕсли ВидОтверстийЗначение = "5" Тогда
			ДопСтрока = ДопСтрока + "_" + Строка(СтрокаЦентр.КоличествоКолонок);
		КонецЕсли;
		Если ЭтоСтруктура Тогда
			Данные.Вставить("Сторона5", ВидОтверстийЗначение + "_5_" + СтрокаЦентр.Количество + "_" + СтрокаЦентр.Смещение + "_" + СтрокаЦентр.Шаг + "_" + ДопСтрока + "_" + СтрокаЦентр.Отступ);
		Иначе
			Данные = Данные + ВидОтверстийЗначение + "_5_" + СтрокаЦентр.Количество + "_" + СтрокаЦентр.Смещение + "_" + СтрокаЦентр.Шаг + "_" + ДопСтрока + "_" + СтрокаЦентр.Отступ + "#";
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаЦентр7) Тогда
		ВидОтверстийЗначение = ПолучитьВидОтверстийЗначение(СтрокаЦентр7.ВидОтверстий);
		Если СтрокаЦентр7.ВысотаПервойЛинии > 0 Тогда
			Если ЭтоСтруктура Тогда
				Данные.Вставить("Сторона6", ВидОтверстийЗначение + "_5_" + СтрокаЦентр7.Количество + "_" + СтрокаЦентр7.Смещение + "_" + СтрокаЦентр7.Шаг + "_" + СтрокаЦентр7.ВысотаПервойЛинии + "_1_" + СтрокаЦентр7.Отступ);
			Иначе
				Данные = Данные + ВидОтверстийЗначение + "_5_" + СтрокаЦентр7.Количество + "_" + СтрокаЦентр7.Смещение + "_" + СтрокаЦентр7.Шаг + "_" + СтрокаЦентр7.ВысотаПервойЛинии + "_1_" + СтрокаЦентр7.Отступ + "#";
			КонецЕсли;
		КонецЕсли;
		Если СтрокаЦентр7.ВысотаВторойЛинии > 0 Тогда
			Если ЭтоСтруктура Тогда
				Данные.Вставить("Сторона7", ВидОтверстийЗначение + "_5_" + СтрокаЦентр7.Количество + "_" + СтрокаЦентр7.Смещение + "_" + СтрокаЦентр7.Шаг + "_" + СтрокаЦентр7.ВысотаВторойЛинии + "_1_" + СтрокаЦентр7.Отступ);
			Иначе
				Данные = Данные + ВидОтверстийЗначение + "_5_" + СтрокаЦентр7.Количество + "_" + СтрокаЦентр7.Смещение + "_" + СтрокаЦентр7.Шаг + "_" + СтрокаЦентр7.ВысотаВторойЛинии + "_1_" + СтрокаЦентр7.Отступ + "#";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаЦентр8) Тогда
		ВидОтверстийЗначение = ПолучитьВидОтверстийЗначение(СтрокаЦентр8.ВидОтверстий);
		Если СтрокаЦентр8.ВысотаПервойЛинии > 0 Тогда
			Если ЭтоСтруктура Тогда
				Данные.Вставить("Сторона8", ВидОтверстийЗначение + "_5_" + СтрокаЦентр8.Количество + "_" + СтрокаЦентр8.Смещение + "_" + СтрокаЦентр8.Шаг + "_" + СтрокаЦентр8.ВысотаПервойЛинии + "_1_" + СтрокаЦентр8.Отступ);
			Иначе
				Данные = Данные + ВидОтверстийЗначение + "_5_" + СтрокаЦентр8.Количество + "_" + СтрокаЦентр8.Смещение + "_" + СтрокаЦентр8.Шаг + "_" + СтрокаЦентр8.ВысотаПервойЛинии + "_1_" + СтрокаЦентр8.Отступ + "#";
			КонецЕсли;
		КонецЕсли;
		Если СтрокаЦентр8.ВысотаВторойЛинии > 0 Тогда
			Если ЭтоСтруктура Тогда
				Данные.Вставить("Сторона9", ВидОтверстийЗначение + "_5_" + СтрокаЦентр8.Количество + "_" + СтрокаЦентр8.Смещение + "_" + СтрокаЦентр8.Шаг + "_" + СтрокаЦентр8.ВысотаВторойЛинии + "_1_" + СтрокаЦентр8.Отступ);
			Иначе
				Данные = Данные + ВидОтверстийЗначение + "_5_" + СтрокаЦентр8.Количество + "_" + СтрокаЦентр8.Смещение + "_" + СтрокаЦентр8.Шаг + "_" + СтрокаЦентр8.ВысотаВторойЛинии + "_1_" + СтрокаЦентр8.Отступ + "#";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСтруктуруЕвропазов(СтруктураОтверстий) Экспорт
	
	ТаблицаОтверстий = ЗначениеИзСтрокиВнутр(СтруктураОтверстий);
	
	СтруктураПоиска = Новый Структура("ВидОтверстий", Перечисления.ВидыОтверстий.Европаз);
	Европаз = ТаблицаОтверстий.НайтиСтроки(СтруктураПоиска);
	
	СтруктураЕвропазов = Новый Структура;
	СтруктураЕвропазов.Вставить("Сверху","0");
	СтруктураЕвропазов.Вставить("Снизу","0");
	СтруктураЕвропазов.Вставить("Слева","0");
	СтруктураЕвропазов.Вставить("Справа","0");
	
	Для Каждого Элемент Из Европаз Цикл
		Если Элемент.РасположениеОтверстия = "Сверху" Тогда
			СтруктураЕвропазов.Удалить("Сверху");
			СтруктураЕвропазов.Вставить("Сверху","1");
		ИначеЕсли Элемент.РасположениеОтверстия = "Снизу" Тогда
			СтруктураЕвропазов.Удалить("Снизу");
			СтруктураЕвропазов.Вставить("Снизу","1");
		ИначеЕсли Элемент.РасположениеОтверстия = "Слева" Тогда
			СтруктураЕвропазов.Удалить("Слева");
			СтруктураЕвропазов.Вставить("Слева","1");
		ИначеЕсли Элемент.РасположениеОтверстия = "Справа" Тогда
			СтруктураЕвропазов.Удалить("Справа");
			СтруктураЕвропазов.Вставить("Справа","1");
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураЕвропазов;
КонецФункции

Функция ПолучитьВидОтверстийЗначение(ВидОтверстий)
	
	Если ВидОтверстий = Перечисления.ВидыОтверстий.ПазыПетель Тогда Возврат "3";
	ИначеЕсли ВидОтверстий = Перечисления.ВидыОтверстий.ТорцеваяПрисадка Тогда Возврат "2";
	ИначеЕсли ВидОтверстий = Перечисления.ВидыОтверстий.ПрисадкаПодЕвровинт Тогда Возврат "1";
	ИначеЕсли ВидОтверстий = Перечисления.ВидыОтверстий.ПрисадкаПодСтяжки Тогда Возврат "4";
	ИначеЕсли ВидОтверстий = Перечисления.ВидыОтверстий.ПрисадкаПодПолкодержательАвто Тогда Возврат "5";
	ИначеЕсли ВидОтверстий = Перечисления.ВидыОтверстий.Европаз Тогда Возврат "6";
	ИначеЕсли ВидОтверстий = Перечисления.ВидыОтверстий.ПрисадкаПодПолкодержатель Тогда Возврат "7";
	ИначеЕсли ВидОтверстий = Перечисления.ВидыОтверстий.ОбратнаяПрисадка Тогда Возврат "8";
	КонецЕсли;		
КонецФункции

Функция ОпределитьШагОтверстия(ТаблицаОтверстий, ШиринаДетали, ВысотаДетали) 
	
	Для Каждого СтрокаОтверстий Из ТаблицаОтверстий Цикл
		РасположениеОтверстия = СтрокаОтверстий.РасположениеОтверстия;
		Если РасположениеОтверстия = "Слева" ИЛИ РасположениеОтверстия = "Справа" Тогда 
			Размер = ВысотаДетали;
		КонецЕсли;
		Если РасположениеОтверстия = "Сверху" ИЛИ РасположениеОтверстия = "Снизу" ИЛИ РасположениеОтверстия = "Центр" 
			ИЛИ РасположениеОтверстия = "Центр7" ИЛИ РасположениеОтверстия = "Центр8" Тогда 
			Размер = ШиринаДетали;
		КонецЕсли;
		
		Если СтрокаОтверстий.ВидОтверстий = ПредопределенноеЗначение("Перечисление.ВидыОтверстий.ПазыПетель") 
			ИЛИ СтрокаОтверстий.ВидОтверстий = ПредопределенноеЗначение("Перечисление.ВидыОтверстий.ТорцеваяПрисадка") Тогда
			Если СтрокаОтверстий.Количество > 1 И СтрокаОтверстий.ВидОтверстий = ПредопределенноеЗначение("Перечисление.ВидыОтверстий.ПазыПетель") Тогда
				СреднийИнтервал = Цел((Размер  - (СтрокаОтверстий.Смещение + 50)) / (СтрокаОтверстий.Количество - 1));
			ИначеЕсли СтрокаОтверстий.Количество > 1 И СтрокаОтверстий.ВидОтверстий = ПредопределенноеЗначение("Перечисление.ВидыОтверстий.ТорцеваяПрисадка") Тогда	
				СреднийИнтервал = Цел((Размер - (СтрокаОтверстий.Смещение + СтрокаОтверстий.Смещение)) / (СтрокаОтверстий.Количество - 1));
			Иначе
				СреднийИнтервал = ?(СтрокаОтверстий.ВидОтверстий = ПредопределенноеЗначение("Перечисление.ВидыОтверстий.ТорцеваяПрисадка"), 32, 0);
			КонецЕсли;
			Если СреднийИнтервал < 32 Тогда
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Нет возможности расположить количество отверстий равное - %1 на стороне размером - %2 и смещением - %3", СтрокаОтверстий.Количество, Размер, СтрокаОтверстий.Смещение);
				ВызватьИсключение Текст;
				ТаблицаОтверстий.Удалить(СтрокаОтверстий);
			Иначе
				Шаг = Цел(СреднийИнтервал / 32);
				СтрокаОтверстий.Шаг = Шаг * 32;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаОтверстий.ВидОтверстий = ПредопределенноеЗначение("Перечисление.ВидыОтверстий.ПрисадкаПодЕвровинт") 
			ИЛИ СтрокаОтверстий.ВидОтверстий = ПредопределенноеЗначение("Перечисление.ВидыОтверстий.ПрисадкаПодСтяжки") Тогда
			СтрокаОтверстий.Смещение = ВернутьСмещение(Размер);
			Если СтрокаОтверстий.Количество > 1 Тогда
				СтрокаОтверстий.Шаг = Окр((Размер - 2 * СтрокаОтверстий.Смещение) / (СтрокаОтверстий.Количество - 1), 0);
			Иначе
				СтрокаОтверстий.Шаг = 0;
			КонецЕсли;
		КонецЕсли;
		
		Если РасположениеОтверстия = "Центр" И СтрокаОтверстий.ВидОтверстий = ПредопределенноеЗначение("Перечисление.ВидыОтверстий.ПрисадкаПодПолкодержательАвто") Тогда
			Если СтрокаОтверстий.Количество > Цел((ВысотаДетали - 200) / 50) + 1 Тогда 
				СтрокаОтверстий.Количество = Цел((ВысотаДетали - 200) / 50) + 1; 
			КонецЕсли;
			СтрокаОтверстий.КоличествоКолонок = СтрокаОтверстий.Количество;
			СтрокаОтверстий.ВысотаПервойЛинии = ВысотаДетали - 50 - СтрокаОтверстий.КоличествоКолонок * 50;
			СтрокаОтверстий.Смещение = 64;
			Если Размер >= 255 И Размер <= 285  Тогда СтрокаОтверстий.Шаг = 160; СтрокаОтверстий.Количество = 2;
			ИначеЕсли Размер >= 286 И Размер <= 320  Тогда СтрокаОтверстий.Шаг = 192; СтрокаОтверстий.Количество = 2;
			ИначеЕсли Размер >= 321 И Размер <= 350  Тогда СтрокаОтверстий.Шаг = 224; СтрокаОтверстий.Количество = 2;
			ИначеЕсли Размер >= 351 И Размер <= 384  Тогда СтрокаОтверстий.Шаг = 256; СтрокаОтверстий.Количество = 2;
			ИначеЕсли Размер >= 385 И Размер <= 416  Тогда СтрокаОтверстий.Шаг = 288; СтрокаОтверстий.Количество = 2;
			ИначеЕсли Размер >= 417 И Размер <= 477  Тогда СтрокаОтверстий.Шаг = 160; СтрокаОтверстий.Количество = 3;
			ИначеЕсли Размер >= 478 И Размер <= 541  Тогда СтрокаОтверстий.Шаг = 192; СтрокаОтверстий.Количество = 3;
			ИначеЕсли Размер >= 542 И Размер <= 605  Тогда СтрокаОтверстий.Шаг = 224; СтрокаОтверстий.Количество = 3;
			ИначеЕсли Размер >= 606 И Размер <= 650  Тогда СтрокаОтверстий.Шаг = 256; СтрокаОтверстий.Количество = 3;
			Иначе 
				СтрокаОтверстий.Шаг = 0; 
				СтрокаОтверстий.Количество = 0;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Размещение типа элементов Х для данного размера не установлено!", , "Элементы.Детали.ТекущиеДанные.ВысотаДетали");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Размещение типа элементов Х для данного размера не установлено!", , "Элементы.Детали.ТекущиеДанные.ШиринаДетали");
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаОтверстий.ВидОтверстий = ПредопределенноеЗначение("Перечисление.ВидыОтверстий.ПрисадкаПодПолкодержатель")
			ИЛИ СтрокаОтверстий.ВидОтверстий = ПредопределенноеЗначение("Перечисление.ВидыОтверстий.ОбратнаяПрисадка")Тогда
			Если СтрокаОтверстий.Количество > 1 Тогда
				СтрокаОтверстий.Шаг = Окр((Размер - 2 * СтрокаОтверстий.Смещение) / (СтрокаОтверстий.Количество - 1), 0);
			Иначе
				СтрокаОтверстий.Шаг = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаОтверстий;
	
КонецФункции

Функция ВернутьСмещение(Размер)
	
	Если Размер > 1800 Тогда Возврат 150;
	ИначеЕсли Размер > 900 Тогда Возврат 120;
	ИначеЕсли Размер > 600 Тогда Возврат 70;
	ИначеЕсли Размер > 300 Тогда Возврат 64;
	ИначеЕсли Размер > 200 Тогда Возврат 50;
	Иначе Возврат 45;
	КонецЕсли;
	
КонецФункции

// Возвращает скидку контрагента для подразделения на конкретную дату
//
// Параметры
//  <Подразделение>  - <СправочникСсылка.Подразделение> - <Подразделение которое предоставляет скидку>
//  <Период>  - <Дата> - <Период которому соответствует ссылка>
//  <Контрагент>  - <СправочникСсылка.Контрагент> - <Контрагент которому предоставляется ссылка>
//
// Возвращаемое значение:
//   <Структура>   - <структура со скидками на услуги и на материалы>
//
Функция ПолучитьСкидкуКонтрагента(Подразделение, Период, Контрагент) Экспорт
	
	Ответ = Новый Структура("СкидкаНаМатериалы, СкидкаНаУслуги", 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизвольныеСкидкиКонтрагентамСрезПоследних.СкидкаНаМатериалы,
	|	ПроизвольныеСкидкиКонтрагентамСрезПоследних.СкидкаНаУслуги
	|ИЗ
	|	РегистрСведений.ПроизвольныеСкидкиКонтрагентам.СрезПоследних(
	|			&Период,
	|			Подразделение = &Подразделение
	|				И Контрагент = &Контрагент) КАК ПроизвольныеСкидкиКонтрагентамСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Ответ.СкидкаНаМатериалы = Выборка.СкидкаНаМатериалы;
		Ответ.СкидкаНаУслуги = Выборка.СкидкаНаУслуги;
	КонецЕсли;
	
	Если Ответ.СкидкаНаМатериалы + Ответ.СкидкаНаУслуги = 0 Тогда
		
		// произвольная скидка не установлена
		// смотрим по обороту (только нужно решить -- принесённые деньги или отгруженные изделия)
		
		НачалоПериода = НачалоМесяца(ДобавитьМесяц(Период, -1));
		КонецПериода = КонецМесяца(ДобавитьМесяц(Период, -1));
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УправленческийОбороты.СуммаОборот
		|ПОМЕСТИТЬ втОборотЗаМесяц
		|ИЗ
		|	РегистрБухгалтерии.Управленческий.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Месяц,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДенежныеСредства)),
		|			,
		|			Подразделение = &Подразделение
		|				И КорСубконто1 = &Контрагент,
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ВзаиморасчетыСПокупателями),
		|			) КАК УправленческийОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(втОборотЗаМесяц.СуммаОборот, 0) КАК СуммаОборот,
		|	ЕСТЬNULL(ДилерскиеСкидкиСрезПоследних.ПервыйПределСумма, 0) КАК ПервыйПределСумма,
		|	ЕСТЬNULL(ДилерскиеСкидкиСрезПоследних.ПервыйПределСкидкаМатериалы, 0) КАК ПервыйПределСкидкаМатериалы,
		|	ЕСТЬNULL(ДилерскиеСкидкиСрезПоследних.ПервыйПределСкидкаУслуги, 0) КАК ПервыйПределСкидкаУслуги,
		|	ЕСТЬNULL(ДилерскиеСкидкиСрезПоследних.ВторойПределСумма, 0) КАК ВторойПределСумма,
		|	ЕСТЬNULL(ДилерскиеСкидкиСрезПоследних.ВторойПределСкидкаМатериалы, 0) КАК ВторойПределСкидкаМатериалы,
		|	ЕСТЬNULL(ДилерскиеСкидкиСрезПоследних.ВторойПределСкидкаУслуги, 0) КАК ВторойПределСкидкаУслуги,
		|	ЕСТЬNULL(ДилерскиеСкидкиСрезПоследних.ТретийПределСумма, 0) КАК ТретийПределСумма,
		|	ЕСТЬNULL(ДилерскиеСкидкиСрезПоследних.ТретийПределСкидкаМатериалы, 0) КАК ТретийПределСкидкаМатериалы,
		|	ЕСТЬNULL(ДилерскиеСкидкиСрезПоследних.ТретийПределСкидкаУслуги, 0) КАК ТретийПределСкидкаУслуги
		|ИЗ
		|	РегистрСведений.ДилерскиеСкидки.СрезПоследних(&КонецПериода, Подразделение = &Подразделение) КАК ДилерскиеСкидкиСрезПоследних
		|		ПОЛНОЕ СОЕДИНЕНИЕ втОборотЗаМесяц КАК втОборотЗаМесяц
		|		ПО (ИСТИНА)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Если Выборка.СуммаОборот >= Выборка.ТретийПределСумма Тогда
				Ответ.СкидкаНаМатериалы = Выборка.ТретийПределСкидкаМатериалы;
				Ответ.СкидкаНаУслуги = Выборка.ТретийПределСкидкаУслуги;
			ИначеЕсли Выборка.СуммаОборот >= Выборка.ВторойПределСумма Тогда
				Ответ.СкидкаНаМатериалы = Выборка.ВторойПределСкидкаМатериалы;
				Ответ.СкидкаНаУслуги = Выборка.ВторойПределСкидкаУслуги;
			ИначеЕсли Выборка.СуммаОборот >= Выборка.ПервыйПределСумма Тогда
				Ответ.СкидкаНаМатериалы = Выборка.ПервыйПределСкидкаМатериалы;
				Ответ.СкидкаНаУслуги = Выборка.ПервыйПределСкидкаУслуги;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьСпецификацииПоСтатусу (Подразделение, Статус) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусСпецификацииСрезПоследних.Спецификация
	|ИЗ
	|	РегистрСведений.СтатусСпецификации.СрезПоследних(, ) КАК СтатусСпецификацииСрезПоследних
	|ГДЕ
	|	СтатусСпецификацииСрезПоследних.Спецификация.Проведен
	|	И СтатусСпецификацииСрезПоследних.Спецификация.Производство = &Производство
	|	И СтатусСпецификацииСрезПоследних.Статус = &Статус
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусСпецификацииСрезПоследних.Спецификация.ДатаИзготовления";
	
	Запрос.УстановитьПараметр("Производство", Подразделение);
	Запрос.УстановитьПараметр("Статус", Статус);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция РеализацияИзделийРозничныеПроводки(МассивСпецификаций, Дата, Движения) Экспорт
	
	Если МассивСпецификаций.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого Спецификация Из МассивСпецификаций Цикл
		
		СвойстваСпецификации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Спецификация, "Контрагент, Подразделение, СуммаДокумента, ВнутренняяСтоимостьСпецификации, Производство, Дилерский");
		ЕстьДоговор = ЗначениеЗаполнено(Документы.Спецификация.ПолучитьДоговор(Спецификация));
		
		ДоговорСпецификация = Документы.Спецификация.ПолучитьДоговор(Спецификация);
		Если НЕ ЗначениеЗаполнено(ДоговорСпецификация) Тогда
			ДоговорСпецификация = Спецификация;
		КонецЕсли;
		
		СуммаВзаиморасчетов = ДоговорСпецификация.СуммаДокумента;
		
		Если СвойстваСпецификации.Дилерский Тогда
			СтатьяДохода = Справочники.СтатьиДоходовРасходов.ДоходыОтДилеровПоСпецификациям;
			СтатьяРасхода = Справочники.СтатьиДоходовРасходов.РасходПоСпецификациямДилеров;
		ИначеЕсли ЕстьДоговор Тогда
			СтатьяДохода = Справочники.СтатьиДоходовРасходов.ДоходыОтРозничныхКлиентов;
			СтатьяРасхода = Справочники.СтатьиДоходовРасходов.РасходНаПроизводствоМебельногоКомплекта;
		Иначе
			СтатьяДохода = Справочники.СтатьиДоходовРасходов.ДоходыОтЧастныхЛицПоСпецификациям;
			СтатьяРасхода = Справочники.СтатьиДоходовРасходов.РасходПоСпецификациямЧастныхЛиц;
		КонецЕсли;
		
		// Оприходование изделия от производства
		Проводка = Движения.Управленческий.Добавить();
		Проводка.Период = Дата;
		Проводка.Подразделение = СвойстваСпецификации.Подразделение;
		Проводка.Сумма = СвойстваСпецификации.ВнутренняяСтоимостьСпецификации;
		Проводка.СчетДт = ПланыСчетов.Управленческий.ГотоваяПродукция;
		Проводка.КоличествоДт = 1;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СпецификацияДоговор] = ДоговорСпецификация;
		Проводка.СчетКт = ПланыСчетов.Управленческий.ВзаиморасчетыСПодразделениями;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Подразделения] = СвойстваСпецификации.Производство;
		
		// Расходы
		Проводка = Движения.Управленческий.Добавить();
		Проводка.Период = Дата;
		Проводка.Подразделение = СвойстваСпецификации.Подразделение;
		Проводка.Сумма = СвойстваСпецификации.ВнутренняяСтоимостьСпецификации;
		Проводка.СчетДт = ПланыСчетов.Управленческий.РасходыРозничнойСети;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = СтатьяРасхода;
		Проводка.СчетКт = ПланыСчетов.Управленческий.ГотоваяПродукция;
		Проводка.КоличествоКт = 1;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СпецификацияДоговор] = ДоговорСпецификация;
		
		// Доходы
		Проводка = Движения.Управленческий.Добавить();
		Проводка.Период = Дата;
		Проводка.Подразделение = СвойстваСпецификации.Подразделение;
		Проводка.Сумма = СуммаВзаиморасчетов;
		Проводка.СчетДт = ПланыСчетов.Управленческий.ВзаиморасчетыСПокупателями;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = ДоговорСпецификация.Контрагент;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СпецификацияДоговор] = ДоговорСпецификация;
		
		Проводка.СчетКт = ПланыСчетов.Управленческий.Доходы;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = СтатьяДохода;
		
	КонецЦикла;
	
КонецФункции

// Процедура Регламентного задания
//
//  перепроведение всех проведенных документов
// 
//  
Процедура Перепроведение() Экспорт
	
	Если ПустаяСтрока(ИмяПользователя()) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Текст = "";
	Для Каждого Документ Из Метаданные.Документы Цикл
		
		Текст = Текст + "ВЫБРАТЬ
		|	нДокумент.Ссылка,
		|	нДокумент.Дата
		|ИЗ
		|	Документ." + Документ.Имя + " КАК нДокумент
		|ГДЕ
		|	нДокумент.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ ";
		
	КонецЦикла;
	Запрос.Текст = Лев(Текст,СтрДлина(Текст) - СтрДлина(" ОБЪЕДИНИТЬ ВСЕ "));
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Док = Выборка.Ссылка.ПолучитьОбъект(); 
		Попытка
			
			Док.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			
			МассивОшибки = ПолучитьСообщенияПользователю();
			
			Если ТипЗнч(МассивОшибки) = Тип("ФиксированныйМассив") Тогда
				Если МассивОшибки.Количество() > 0 Тогда
					ТекстОшибки = СокрЛП(ТекстОшибки) + Символы.ПС + Символы.ВК + Док + " - " + МассивОшибки[0].Текст;
				КонецЕсли;
			КонецЕсли;			
			
			ПолучитьСообщенияПользователю(Истина);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ПараметрыПисьма = Новый Структура;
		
		ПараметрыПисьма.Вставить("Тема", "Ошибки при перепроведении документа за " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
		ПараметрыПисьма.Вставить("Тело", ТекстОшибки);
		ПараметрыПисьма.Вставить("Кому", Справочники.УчетныеЗаписиЭлектроннойПочты.УчетнаяЗаписьГлБухгалтера.АдресЭлектроннойПочты);
		ЭлектроннаяПочта.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыПисьма);
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует структуру из строки адреса
Функция ПолучитьСтруктуруИзАдреса(Адрес) Экспорт
	
	СтруктураАдреса = Новый Структура;
	
	СтруктураАдреса.Вставить("НаселенныйПункт","");
	СтруктураАдреса.Вставить("Улица","");
	СтруктураАдреса.Вставить("Дом","");
	СтруктураАдреса.Вставить("Подъезд","");
	СтруктураАдреса.Вставить("КодПодъезда","");
	СтруктураАдреса.Вставить("Этаж","");
	СтруктураАдреса.Вставить("Квартира","");
	
	//Разбираем старый адрес на сотовляющие и определяем город или населенный пункт
	Если ЗначениеЗаполнено(Адрес) Тогда
		СтарыйАдрес 	 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Адрес, ", ");
		
		Для каждого Элемент Из СтарыйАдрес Цикл
			
			СтруктураАдреса.Вставить("Улица", ?( Найти(Элемент, "ул. ") > 0, СтрЗаменить(Элемент, "ул. ",""),СтруктураАдреса.Улица));
			СтруктураАдреса.Вставить("Дом", ?( Найти(Элемент, "дом. ") > 0, СтрЗаменить(Элемент, "дом. ",""),СтруктураАдреса.Дом));
			СтруктураАдреса.Вставить("Подъезд", ?( Найти(Элемент, "подъезд. ") > 0, СтрЗаменить(Элемент, "подъезд. ",""),СтруктураАдреса.Подъезд));
			СтруктураАдреса.Вставить("КодПодъезда", ?( Найти(Элемент, "код подъезда. ") > 0, СтрЗаменить(Элемент, "код подъезда. ",""),СтруктураАдреса.КодПодъезда));
			СтруктураАдреса.Вставить("Этаж", ?( Найти(Элемент, "этаж. ") > 0, СтрЗаменить(Элемент, "этаж. ",""),СтруктураАдреса.Этаж));
			СтруктураАдреса.Вставить("Квартира", ?( Найти(Элемент, "кв. ") > 0, СтрЗаменить(Элемент, "кв. ",""),СтруктураАдреса.Квартира));
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураАдреса;
	
КонецФункции

Функция ПолучитьСкидкуДоговора(Подразделение, Период, Сумма, ВидОплаты, Офис) Экспорт
	
	Скидка = 0;
	
	// проверим офис на принадлженость производству
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Офис", Офис);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Подразделения.ОсновнойОфис
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|ГДЕ
	|	Подразделения.ВидПодразделения = ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Производство)
	|	И Подразделения.ОсновнойОфис = &Офис";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат Скидка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОплатыДоговора", ВидОплаты);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкидкиДоговоровСрезПоследних.ВторойПределСкидка,
	|	СкидкиДоговоровСрезПоследних.ВторойПределСумма,
	|	СкидкиДоговоровСрезПоследних.ПервыйПределСкидка,
	|	СкидкиДоговоровСрезПоследних.ПервыйПределСумма
	|ИЗ
	|	РегистрСведений.СкидкиДоговоров.СрезПоследних(
	|			&Период,
	|			Подразделение = &Подразделение
	|				И ВидыОплатыДоговоров = &ВидОплатыДоговора) КАК СкидкиДоговоровСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если Сумма >= Выборка.ВторойПределСумма Тогда
			Скидка = Выборка.ВторойПределСкидка;
		ИначеЕсли Сумма >= Выборка.ПервыйПределСумма Тогда
			Скидка = Выборка.ПервыйПределСкидка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Скидка;
	
КонецФункции

 //Записыват в Регистр сведений текущий статус СлужебнойЗаписки
  //Параметры
 // МассивЗаписок - Массив - Массив ссылок на служебные записки для которых меняем статус
Функция ОбработатьСтатусыМассиваСлужебныхЗаписок(МассивЗаписок) Экспорт
	
	ДатаВремя = ТекущаяДата();
	СтатусыСлужебнойЗаписки = Перечисления.СтатусыСлужебнойЗаписки;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЗаписок", МассивЗаписок);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СлужебнаяЗаписка.Ссылка,
	|	СлужебнаяЗаписка.Дата,
	|	СлужебнаяЗаписка.Ознакомлен,
	|	СлужебнаяЗаписка.Утверждаю,
	|	СлужебнаяЗаписка.ДатаКонтроля,
	|	СлужебнаяЗаписка.НеСогласен,
	|	СлужебнаяЗаписка.Проведен,
	|	СлужебнаяЗаписка.Виновный,
	|	СлужебнаяЗаписка.ДатаОзнакомления,
	|	СлужебнаяЗаписка.ДатаВыполнения,
	|	СлужебнаяЗаписка.ВидСлужебнойЗаписки
	|ИЗ
	|	Документ.СлужебнаяЗаписка КАК СлужебнаяЗаписка
	|ГДЕ
	|	СлужебнаяЗаписка.Ссылка В(&МассивЗаписок)";
	
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Записка = ВыборкаДетальныеЗаписи.Ссылка;
		НаборЗаписей = РегистрыСведений.СтатусыСлужебныхЗаписок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СлужебнаяЗаписка.Установить(Записка);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			Запись = НаборЗаписей.Добавить();
			
		Иначе
			
			Запись = НаборЗаписей[0];
			
		КонецЕсли;
		
		ВидСлужебнойЗаписки = ВыборкаДетальныеЗаписи.ВидСлужебнойЗаписки;
		
		Если НЕ ВыборкаДетальныеЗаписи.Ознакомлен и НЕ ВыборкаДетальныеЗаписи.Утверждаю и НЕ ВыборкаДетальныеЗаписи.НеСогласен и НачалоДня(ДатаВремя) < ВыборкаДетальныеЗаписи.ДатаКонтроля Тогда
			
			НовыйСтатус = СтатусыСлужебнойЗаписки.Новая;
			
		ИначеЕсли НачалоДня(ДатаВремя) < ВыборкаДетальныеЗаписи.ДатаКонтроля Тогда
			
			НовыйСтатус = СтатусыСлужебнойЗаписки.Прочитана;
			
		ИначеЕсли ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.Информирование или ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.Заявка Тогда
			
			Если НЕ ВыборкаДетальныеЗаписи.Ознакомлен и НЕ ВыборкаДетальныеЗаписи.Утверждаю и НЕ ВыборкаДетальныеЗаписи.НеСогласен Тогда
				
				НовыйСтатус = СтатусыСлужебнойЗаписки.Просрочена;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ДатаОзнакомления > ВыборкаДетальныеЗаписи.ДатаКонтроля Тогда
				
				НовыйСтатус = СтатусыСлужебнойЗаписки.Просрочена;
				
			Иначе
				//////////////////После первого проведения по всем запискам можно эту строку убрать
				НовыйСтатус = СтатусыСлужебнойЗаписки.Прочитана;
				
			КонецЕсли;
			
		ИначеЕсли ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.НарушенияВРаботе Тогда
			
			Если ВыборкаДетальныеЗаписи.ДатаВыполнения <> Дата("01.01.0001 0:00:00") Тогда
				
				Если ВыборкаДетальныеЗаписи.ДатаВыполнения > ВыборкаДетальныеЗаписи.ДатаКонтроля Тогда
					
					НовыйСтатус = СтатусыСлужебнойЗаписки.Просрочена;
					
				КонецЕсли;
				
			Иначе
				
				НовыйСтатус = СтатусыСлужебнойЗаписки.Просрочена;
				
			КонецЕсли;
			
		ИначеЕсли ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.ПретензияЗаявление Тогда
			
			ДеньНеделиКонтроля = ДеньНедели(ВыборкаДетальныеЗаписи.ДатаКонтроля);
			
			ДатаКонтроля = ?(ДеньНеделиКонтроля > 2, ВыборкаДетальныеЗаписи.ДатаКонтроля + 86400 * 6, ВыборкаДетальныеЗаписи.ДатаКонтроля + 86400 * 5);
			
			Если ДатаКонтроля < НачалоДня(ДатаВремя) Тогда
				
				НовыйСтатус = СтатусыСлужебнойЗаписки.Просрочена;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		
		
		//Если ВыборкаДетальныеЗаписи.ДатаКонтроля < НачалоДня(ДатаВремя) Тогда
		//	
		//	НовыйСтатус = СтатусыСлужебнойЗаписки.Просрочена;
		//	
		//ИначеЕсли НЕ ВыборкаДетальныеЗаписи.Ознакомлен и НЕ ВыборкаДетальныеЗаписи.Утверждаю и НЕ ВыборкаДетальныеЗаписи.НеСогласен Тогда
		//	
		//	НовыйСтатус = СтатусыСлужебнойЗаписки.Новая;
			
		//Иначе
		//	
		//	НовыйСтатус = СтатусыСлужебнойЗаписки.Прочитана;
		//	
		//КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.Проведен Тогда
			
			НовыйСтатус = СтатусыСлужебнойЗаписки.Архивная;
			
		КонецЕсли;
		
		Запись.Статус = НовыйСтатус;
		Запись.СлужебнаяЗаписка = Записка;
		Запись.Период = ДатаВремя;
		
		Запись.Ответственный = ВыборкаДетальныеЗаписи.Виновный;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецФункции // ОбработатьСтатусыСлужебныхЗаписок()

// Увеличивает дополнительный лимит цеха на количество требуемое по
// переданным спецификациям
//
// Параметры
//  МассивСпецификаций  - Массив - Массив спецификаций для которых увеличить лимит
//  Движения  - КоллекцияДвижений - коллекция движений регистратор
//  Дата  - Дата - дата регистратора
//  Подразделение  - СправочникСсылка.Подразделения - подразделение регистратора
//
// Возвращаемое значение:
//   нет   - 
//
Функция УвеличитьДополнительныйЛимит(МассивСпецификаций, Движения, Дата, Подразделение) Экспорт
	
	Счет = ПланыСчетов.Управленческий.ДополнительныйЛимитЦеха;
	ПВХНоменклатура = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСпецификаций", МассивСпецификаций);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпецификацияСписокНоменклатуры.Номенклатура,
	|	СУММА(СпецификацияСписокНоменклатуры.Количество) КАК Количество
	|ИЗ
	|	Документ.Спецификация.СписокНоменклатуры КАК СпецификацияСписокНоменклатуры
	|ГДЕ
	|	СпецификацияСписокНоменклатуры.Ссылка В(&МассивСпецификаций)
	|	И СпецификацияСписокНоменклатуры.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)
	|
	|СГРУППИРОВАТЬ ПО
	|	СпецификацияСписокНоменклатуры.Номенклатура";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Проводка = Движения.Управленческий.Добавить();
		Проводка.Период = Дата;
		Проводка.Подразделение = Подразделение;
		Проводка.СчетДт = Счет;
		Проводка.СубконтоДт[ПВХНоменклатура] = Выборка.Номенклатура;
		Проводка.КоличествоДт = Выборка.Количество;
		
	КонецЦикла;
	
	
КонецФункции
