
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Движения.СостояниеОсновныхСредств.Очистить();
	//Движения.СостояниеОсновныхСредств.Записать();
	//
	//Движения.Управленческий.Очистить();
	//Движения.Управленческий.Записать();
	
	Ошибки = Неопределено;
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Управленческий.ПервоначальнаяСтоимостьОС);
	МассивСчетов.Добавить(ПланыСчетов.Управленческий.АмортизацияОС);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МодернизацияОсновныхСредств.ОС КАК ОсновноеСредство,
	|	МодернизацияОсновныхСредств.НомерСтроки,
	|	МодернизацияОсновныхСредств.НачислятьАмортизацию,
	|	МодернизацияОсновныхСредств.СрокАмортизации,
	|	МодернизацияОсновныхСредств.Статья,
	|	МодернизацияОсновныхСредств.Стоимость,
	|	МодернизацияОсновныхСредств.Ссылка.Контрагент
	|ПОМЕСТИТЬ тчДок
	|ИЗ
	|	Документ.МодернизацияОсновныхСредств.ОсновныеСредства КАК МодернизацияОсновныхСредств
	|ГДЕ
	|	МодернизацияОсновныхСредств.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчДок.ОсновноеСредство,
	|	ЕСТЬNULL(СостояниеОССрезПоследних.ПринятоКУчету, ЛОЖЬ) КАК ПринятоКУчету,
	|	СостояниеОССрезПоследних.СрокАмортизации,
	|	СостояниеОССрезПоследних.ПервоначальнаяСтоимость,
	|	тчДок.НомерСтроки,
	|	тчДок.НачислятьАмортизацию,
	|	тчДок.СрокАмортизации КАК НовыйСрокАмортизации,
	|	тчДок.Статья,
	|	тчДок.Стоимость,
	|	СостояниеОССрезПоследних.МОЛ
	|ИЗ
	|	тчДок КАК тчДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеОсновныхСредств.СрезПоследних(
	|				&МоментВремени,
	|				ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						т.ОсновноеСредство
	|					ИЗ
	|						тчДок КАК т)) КАК СостояниеОССрезПоследних
	|		ПО тчДок.ОсновноеСредство = СостояниеОССрезПоследних.ОсновноеСредство";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПолеОшибки = "Объект.ОсновныеСредства[%1].ОсновноеСредство";
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.ПринятоКУчету ИЛИ Выборка.ПервоначальнаяСтоимость = 0 Тогда
			
			ТекстГруппыОшибок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Основное средство %1 (строка %%1) по данным управленческого учета не числится", Выборка.ОсновноеСредство);
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Основное средство %1  по данным управленческого учета не числится", Выборка.ОсновноеСредство);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПолеОшибки, ТекстОшибки, 1, Выборка.НомерСтроки - 1, ТекстГруппыОшибок);
			
		КонецЕсли;
		
		Если Ошибки <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого Строка Из ОсновныеСредства Цикл
			
			Если Строка.ОС = Выборка.ОсновноеСредство Тогда
				
				Проводки = Движения.СостояниеОсновныхСредств.Добавить();
				Проводки.ОсновноеСредство = Выборка.ОсновноеСредство;
				Проводки.НачислятьАмортизацию  = Выборка.НачислятьАмортизацию;
				Проводки.МОЛ = Выборка.МОЛ;
				Проводки.Период = Дата;
				Проводки.ПринятоКУчету = Истина;
				Проводки.СрокАмортизации = Выборка.СрокАмортизации + Строка.СрокАмортизации;
				//////
				НоваяСтоимость = Выборка.ПервоначальнаяСтоимость +Строка.Стоимость;
				Проводки = Движения.Управленческий.Добавить();
				Проводки.Период = Дата;
				Проводки.Подразделение = Подразделение;
				Проводки.Сумма = НоваяСтоимость;
				
				Проводки.СчетДт = ПланыСчетов.Управленческий.ПервоначальнаяСтоимостьОС;
				Проводки.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства] = Выборка.ОсновноеСредство;
				
				Проводки.СчетКт = ПланыСчетов.Управленческий.ВзаиморасчетыСПоставщиками;
				Проводки.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
	Если НЕ Отказ Тогда
		
		Движения.Управленческий.Записывать = Истина;
		Движения.СостояниеОсновныхСредств.Записывать = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Заглушка = Истина;
	
КонецПроцедуры
