
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивСлужебок") Тогда
		
		Для Каждого Записка Из Параметры.МассивСлужебок Цикл
			
			НоваяСтрока = СписокСлужебок.Добавить();
			НоваяСтрока.Дата = Записка.Дата;
			НоваяСтрока.Номер = Формат(Записка.Номер, "ЧГ=0");
			НоваяСтрока.Вид = Записка.ВидСлужебнойЗаписки;
			НоваяСтрока.Тема = Записка.Тема;
			
			ФизЛицо = Записка.Автор.ФизическоеЛицо;
			Автор = Строка(ФизЛицо.Фамилия)+" "+Лев(Строка(ФизЛицо.Имя),1)+". "+Лев(Строка(ФизЛицо.Отчество),1)+". ";
			НоваяСтрока.Автор = Автор;
			
			НоваяСтрока.Ссылка = Записка.Ссылка;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Параметры.Свойство("МассивПеределок") Тогда
		
		Для Каждого Спецификация Из Параметры.МассивПеределок Цикл
			
			НоваяСтрока = СписокСлужебок.Добавить();
			НоваяСтрока.Дата = Спецификация.Дата;
			НоваяСтрока.Номер = Формат(Спецификация.Номер, "ЧГ=0");
			НоваяСтрока.Вид = "Переделка";
			НоваяСтрока.Тема = "Переделка не изготовлена";
			
			ФизЛицо = Спецификация.Автор.ФизическоеЛицо;
			Автор = Строка(ФизЛицо.Фамилия)+" "+Лев(Строка(ФизЛицо.Имя),1)+". "+Лев(Строка(ФизЛицо.Отчество),1)+". ";
			НоваяСтрока.Автор = Автор;
			
			НоваяСтрока.Ссылка = Спецификация.Ссылка;
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокСлужебокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры
