
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСлужебок.ЗагрузитьЗначения(Параметры.МассивСлужебок);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСлужебокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСлужебокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСлужебокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		ОткрытьЗначение(Элемент.ТекущиеДанные.Значение);
		
	КонецЕсли;
	
КонецПроцедуры
