
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивСлужебок") Тогда
		
		Для Каждого Записка Из Параметры.МассивСлужебок Цикл
			
			ДобавитьСтрокуВФорму(Записка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Параметры.Свойство("МассивПеределокИСрочек") Тогда
		
		Для Каждого Спецификация Из Параметры.МассивПеределокИСрочек Цикл
			
			ДобавитьСтрокуВФорму(Спецификация);
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокСлужебокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВФорму(Документ)
	
	НоваяСтрока = СписокСлужебок.Добавить();
	НоваяСтрока.Дата = Документ.Дата;
	НоваяСтрока.Номер = Формат(Документ.Номер, "ЧГ=0");
	ДилерскаяСпец = Ложь;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.Спецификация") Тогда
		
		ДилерскаяСпец = Документ.Дилерский;
		
		Если Документ.Срочный Тогда
			
			НоваяСтрока.Вид = "Срочная спецификация";
			НоваяСтрока.Тема = "Срочная спецификация";
			
		Иначе
			
			НоваяСтрока.Вид = "Переделка";
			НоваяСтрока.Тема = "Переделка не изготовлена";
			
		КонецЕсли; 
		
		
	Иначе
		
		НоваяСтрока.Вид = Документ.ВидСлужебнойЗаписки;
		НоваяСтрока.Тема = Документ.Тема;
		
	КонецЕсли;
	
	Если ДилерскаяСпец ИЛИ ТипЗнч(Документ.Автор) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
	
		Автор = Документ.Автор.Наименование;
		
	Иначе
	
		ФизЛицо = Документ.Автор.ФизическоеЛицо;
		Автор = Строка(ФизЛицо.Фамилия)+" "+Лев(Строка(ФизЛицо.Имя),1)+". "+Лев(Строка(ФизЛицо.Отчество),1)+". ";
	
	КонецЕсли;
	
	НоваяСтрока.Автор = Автор;
			
	НоваяСтрока.Ссылка = Документ.Ссылка;
	
КонецПроцедуры // ДобавитьСтрокуВФорму()
