
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ФиксированныйКомплект", Ложь);
	ПараметрыПечати.Вставить("ПереопределитьПользовательскиеНастройкиКоличества", Истина);
	
	СписокСпецификаций = ПолучитьСписокСпецификаций(ПараметрКоманды);
	
	Для Каждого Спец Из СписокСпецификаций Цикл
		
		ЕстьНеноменклатурный = ПроверитьНеноменклатурныйМатериал(Спец);
		
		Если ЕстьНеноменклатурный Тогда
			
			 ПараметрыРаскрой = ОбновитьРаскройНаСервере(Спец);
			 ПолучитьИЗаписатьРаскрой(ПараметрыРаскрой);
			
			 УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Спецификация", "Раскрой", Спец, ПараметрыВыполненияКоманды.Источник, ПараметрыПечати);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокСпецификаций(Наряд)
	
	Мас = Новый Массив();
	
	Для Каждого Строка ИЗ Наряд.СписокСпецификаций Цикл
		
		Мас.Добавить(Строка.Спецификация);
		
	КонецЦикла;
	
	Возврат Мас;
	
КонецФункции

&НаСервере
Функция ОбновитьРаскройНаСервере(Элемент)
	
	Возврат Документы.Спецификация.ОбновитьРаскройНаСервере(Элемент);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьИЗаписатьРаскрой(Элемент)
	
	НашаСпецификация = Элемент.Спецификация;	
	ВидОтображения = "1";
	
	Если ЗначениеЗаполнено(Элемент.СтрокаРаскрой) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ХранимыйФайл", "НовыйРаскрой");
		ПараметрыФормы.Вставить("Спецификация", НашаСпецификация);
		ПараметрыФормы.Вставить("СтрокаНовогоРаскрояЛДСП", Элемент.СтрокаРаскрой);
		ПараметрыФормы.Вставить("ВидОтображения", ВидОтображения);
		
		Значение = ОткрытьФормуМодально("Документ.Спецификация.Форма.ФормаФлэш", ПараметрыФормы);
		
		Элемент.РисунокРаскроя = Значение;
		
	КонецЕсли;
	
	ЗаписатьРаскрой(Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРаскрой(Элемент)
	
	Документы.Спецификация.ЗаписатьРаскрой(Элемент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОтображенияРаскрой(Спецификация) Экспорт
	
	Возврат Документы.Спецификация.ПолучитьВидОтображенияРаскрой(Спецификация);
	
КонецФункции

&НаСервере
Функция ПроверитьНеноменклатурныйМатериал(Спецификация)
	
	ЕстьНоменклатурный = Ложь;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпецификацияСписокНоменклатуры.Номенклатура
	|ИЗ
	|	Документ.Спецификация.СписокНоменклатуры КАК СпецификацияСписокНоменклатуры
	|ГДЕ
	|	СпецификацияСписокНоменклатуры.Номенклатура.Неноменклатурный
	|	И СпецификацияСписокНоменклатуры.Номенклатура.НоменклатурнаяГруппа.ВидМатериала = ЗНАЧЕНИЕ(Перечисление.ВидыМатериалов.Листовой)
	|	И СпецификацияСписокНоменклатуры.Ссылка = &Спецификация";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		 ЕстьНоменклатурный = Истина;
	КонецЕсли;
	 
	Возврат ЕстьНоменклатурный;
	
КонецФункции
