////////////////////////////////////////////////////////////////////////////////
// Подсистема "Префиксация объектов"
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает признак наличия в конфигурации функциональной опции ПрефиксыОрганизаций.
//
// Возвращаемое значение:
//  Булево - признак наличия в конфигурации функциональной опции ПрефиксыОрганизаций.
//
Функция ЕстьФункциональнаяОпцияПрефиксыОрганизаций() Экспорт
	
	Возврат СтандартныеПодсистемыПереопределяемый.ЕстьФункциональнаяОпцияПрефиксыОрганизаций();
	
КонецФункции

// Возвращает признак наличия в конфигурации функциональной опции ПрефиксИнформационнойБазы.
//
// Возвращаемое значение:
//  Булево - признак наличия в конфигурации функциональной опции ПрефиксИнформационнойБазы.
//
Функция ЕстьФункциональнаяОпцияПрефиксИнформационнойБазы() Экспорт
	
	Возврат СтандартныеПодсистемыПереопределяемый.ЕстьФункциональнаяОпцияПрефиксИнформационнойБазы();
	
КонецФункции

// Возвращает таблицу префиксообразующих реквизитов, заданных в переопределяемом модуле.
//
Функция ПрефиксообразующиеРеквизиты() Экспорт
	
	Объекты = Новый ТаблицаЗначений;
	Объекты.Колонки.Добавить("Объект");
	Объекты.Колонки.Добавить("Реквизит");
	
	ПрефиксацияОбъектовПереопределяемый.ПолучитьПрефиксообразующиеРеквизиты(Объекты);
	
	Возврат Объекты;
КонецФункции
